{"records":[{"name": "Agumon","profile": "A cheerful Digimon who uses its hard claws as weapons. Hidden in its small body lies boundless courage, a fearless personality, and an uncharted potential for growth."},{"name": "Gabumon","profile": "A Digimon that wears Garurumon’s fur and is normally very shy. However, wearing the fur inverts its personality and makes it bold. Its weapons are its stiff horn and the sharp claws attached to the fur."},{"name": "Greymon","profile": "A Digimon with a strong body and a hard, fine horn that boasts high combat power. Its head is covered with a hard shell that increases its defensive ability. It is also skilled at cooperating with its friends in combat."},{"name": "Monochromon","profile": "A Digimon whose shell and horns are hard as diamond. They say when its horns are completely grown, they will reach half the size of its body. It is an herbivorous and calm Digimon, but when it gets angry it goes on a rampage."},{"name": "Centalmon","profile": "A Digimon with the upper body of a human and the lower body of an animal. Each part of its body is covered in blue armor. It releases compressed gas through the pipe on its back to help it reach close to the speed of sound."},{"name": "Leomon","profile": "A Digimon praised as a noble hero. It is a warrior with a just heart who has defeated many atrocious Digimon. Its rival is Orgemon. On its waist, it carries a magical sword called ’Shishiou-maru’."},{"name": "Garurumon","profile": "A Digimon covered with fur as hard as mithril. It is feared by other Digimon because it hunts its prey with a carnivore’s speed and very precise attacks."},{"name": "Unimon","profile": "A synthetic Digimon with a unicorn’s horn and a pegasus’ wings. Its wings help it fly freely within the network, and its sharp horn helps it fight its enemies. It has a very wild temper."},{"name": "Pandamon","profile": "A Digimon that looks like a panda but is not very popular because of its bluntness. It pretends to be a maverick, but it secretly yearns to be like the popular Monzaemon. Surprisingly, it is actually very capable."},{"name": "Weregarurumon","profile": "A commando-type Digimon that has the leg strength of Garurumon and skilled war tactics. Its jumping abilities are top tier. It has a strong sense of duty and serves its master and partners faithfully."},{"name": "Mammon","profile": "An ancient Digimon, discovered in the melted ice and snow due to the Digital World warming. On its mask there is a crystal of knowledge which gives it the power of clairvoyance and allows it to see far into the future."},{"name": "Metalgreymon","profile": "A Digimon with over half of its body mechanized. It is said to have the power of a nuclear warhead. Only a Greymon who has won numerous battles can evolve to this stage."},{"name": "Skullgreymon","profile": "A menacing Digimon obsessed with fighting. Thanks to its battle instincts, it continues to fight even though it is nothing but bones. It is feared by other Digimon because it has no intelligence and fights indiscriminately."},{"name": "Saberleomon","profile": "An ancient Digimon that is said to be the ancestor of Leomon. It is a huge beast with overwhelmingly destructive claws, strong penetrative tusks, and legs that allow it to run at Mach speed."},{"name": "Baalmon","profile": "An enlightened Digimon called ’The Noble King’. It encompasses all knowledge. The charms attached to its mantle contain the solutions to all possible problems. It serves as general of the Bagra army."},{"name": "Metalgarurumon","profile": "A Digimon whose whole body is mechanized. It is the final form of Garurumon. It retains Garurumon’s speed despite the many heavy firearms attached to its body. It finds its enemies with the laser on the tip of its nose and swiftly shoots them down."},{"name": "Wargreymon","profile": "A Digimon equipped with Dramon Killers on both its arms and the Brave Shield on its back. It is a veteran hero wearing armor made of Chrome Digizoid. It has a humanoid shape and is remarkably powerful and fast."},{"name": "Hagurumon","profile": "A mutant Digimon made of a combination of gears. Removing even one gear is enough to make it stop working. It has the deadly skill of manipulating other Digimon, which it uses in mischievous ways."},{"name": "Kokuwamon","profile": "A mini insect machine Digimon. It has electricity stored in its body and can use this to even run domestic appliances. In crisis situations, it can release a current of 1 MV to protect its body."},{"name": "Revolmon","profile": "A Digimon with a strong sense of justice. It belongs to the Virus Busters and deletes evil Digimon. However, since it likes gambling, it pardons evil Digimon who win the Russian roulette."},{"name": "Tankmon","profile": "A Digimon that enjoys fighting so much its nickname is ’the Mercenary Digimon’. Heavy artillery is installed all throughout its body, which it likes using to shatter its enemies to pieces."},{"name": "Guardromon","profile": "A Digimon with outstanding defense. Originally it was guarding the network with Giromon the net-keeper, but it got infected by a virus and was used by evil Digimon."},{"name": "Knightmon","profile": "A loyal Digimon wearing armor made of Chrome Digizoid. It always disregards its own will and obeys the orders of its master. Depending on those orders, it can become either good or evil."},{"name": "Andromon","profile": "A cyborg Digimon created in an experiment. It has high combat power and strictly follows the orders it receives regardless of their good or evil nature."},{"name": "Mugendramon","profile": "A completely metal Digimon that was created by combining the parts of many cyborg Digimon. An evil program is written in its digicore and supplies it with infinite malice."},{"name": "Tentomon","profile": "A Digimon with a hard shell but an otherwise very peaceful personality. It is very easygoing and likes smelling the aroma of flowers and taking the occasional nap. It uses its claws deftly and can grab things like a human."},{"name": "Palmon","profile": "A rare type of Digimon that became a plant even though it started evolving like a reptile. A tropical plant blooms on its head and changes scents according to its mood. It buries its feet into the ground in order to absorb nutrients."},{"name": "Gomamon","profile": "A naughty Digimon that likes pranks. His body is covered with fur so that he can resist to cold temperatures. His claws help him break hard blocks of ice. When he gets angry, the red hair on his head bristles."},{"name": "Piyomon","profile": "A Digimon with wings that help it hold things but are unsuitable for flying. It can only fly at the same speed as Patamon. It aspires to someday become Birdramon, who can fly freely in the sky."},{"name": "Kuwagamon","profile": "A Digimon of the same maturity as Kabuterimon, its eternal rival. It has well-developed battle instincts. It attacks its prey immediately and grasps it in its scissors."},{"name": "Kabuterimon","profile": "A powerful insect Digimon with a hard shell. It boasts high defense due to its metallized head. It has no mercy when it attacks its rival Digimon."},{"name": "Birdramon","profile": "A Digimon dressed in a blazing flame and born of a firewall. It flies freely within the network. Its specialty is air attacks."},{"name": "Togemon","profile": "A plant Digimon that is easygoing and often absent-minded. However, when somebody upsets it, it angrily brings out its thorn-covered fists."},{"name": "Airdramon","profile": "An intelligent Digimon that flies freely in the sky. They say that its existence is close to the gods, especially when it calls up storms with its cry. Its fierce personality makes it difficult for ordinary tamers to use."},{"name": "Atlurkabuterimon","profile": "A Digimon discovered in the net area of the tropics. It is an evolved form of Kabuterimon. Its body is about 1.5 times that of Kabuterimon. Its fighting skills have improved thanks to the muscles it developed, but its flying skills dropped."},{"name": "Oukuwamon","profile": "An aggressive Digimon evolved from Kuwagamon. Its scissors have grown even stronger, and its scouting skills have improved due to an enhanced sense of touch. Its defensive abilities, which were not very developed in Kuwagamon, improved as well."},{"name": "Garudamon","profile": "A Digimon that loves justice and nature. It is the guardian god of earth and wind. Only bird Digimon with high intelligence and fighting ability can evolve into Garudamon. It is a close friend of Leomon, who shares its vision."},{"name": "Megaseadramon","profile": "A Digimon with an enlarged head, hard armor, and a blade in the shape of a lightning bolt. It also has a high level of intelligence and a very cautious personality, following its enemies until it brings them down."},{"name": "Heraklekabuterimon","profile": "An insect Digimon with a shining golden body. It has the features of both Kabuterimon and Kuwagamon. Its weapons are its huge horns and scissors, and it can fly at supersonic speed."},{"name": "Grankuwagamon","profile": "A dreadful Digimon called the devil of the deep forest. It is the final form of the Kuwagamon species. It lives in the depths of the forests and is fully nocturnal. Its eternal rival is Heraklekabuterimon."},{"name": "Metalseadramon","profile": "A Digimon fully covered in Chrome Digizoid alloy. It is the final form of the Seadramon species. It was adapted for use in interception and repels most attacks with its body."},{"name": "Rosemon","profile": "A beautiful female Digimon called the queen of flowers. On its breast it wears a Tiferet, a jewel in which is engraved the symbol of love and beauty. This jewel promises eternal beauty."},{"name": "Impmon","profile": "A Digimon that likes pranks and often plays them on electrical products. While it is cruel to its weak opponents, it also stubbornly faces enemies stronger than itself, rather than trying to curry favor with them. Ultimately, this Digimon is quite lonely."},{"name": "Keramon","profile": "A child Digimon that thinks destroying data is just a game. It destroys the computers it penetrates, eating away data at a rate of 100MB per second."},{"name": "Candmon","profile": "A Digimon with a burning digicore. It cannot survive if its digicore flame dies. For this reason, it is said that its true form is the flame. Although it is a flame-type, it has a calm personality."},{"name": "Picodevimon","profile": "A cunning Digimon that is said to have drawn Devimon to the dark side. It is used by its superiors, Devimon and Vamdemon, and does evil deeds for them."},{"name": "Wizarmon","profile": "A Digimon that came from Witchelny, a digital world in another dimension, in order to train. It is mastering the magic of earth and fire. It is very shy and doesn’t like to show its face."},{"name": "Devimon","profile": "A fallen angel Digimon. It originally belonged to the angel Digimon but fell to the dark side. It wears the symbol of evil engraved on its chest. It can control other Digimon using its evil intellect and fierce eyes."},{"name": "Bakemon","profile": "A ghost Digimon born from the dark area. It is made of a virus program that possesses computers and destroys them. It is said that inside its cloth there is a black hole."},{"name": "Orgemon","profile": "A Digimon hunter with a developed physique and high intelligence. Driven by its rage, it challenges strong Digimon to fight. It is not ashamed of its nickname and holds a bone club as proof that it has defeated Skullgreymon."},{"name": "Meramon","profile": "A Digimon whose whole body is shrouded in flames and was born from the firewall that protects the Internet. It has a violent temper, just like the flames that cover its body, and wants to burn everything."},{"name": "Madleomon","profile": "A frenzy Digimon who lost its own will. It is the result of extensive upgrading in order to obtain power. It relies on its physical strength and poisonous claws as it follows the orders it receives."},{"name": "Bluemeramon","profile": "A flame-type Digimon covered in blue flame. It burns at a higher temperature than Meramon. It has a rough personality and is hard to tame."},{"name": "Deathmeramon","profile": "A Digimon that overcame water and ice, the weak points of the Meramon species. A blue burning chain winds around its body. Its skilled attacks, defensive abilities, and burning temperature are all enhanced."},{"name": "Fantomon","profile": "A senior ghost Digimon which has the appearance of the god of death. It searches for its prey using the clairvoyant crystal hanging at its neck. It is said that the interior of the cloth covering its body leads to another dimension."},{"name": "Infermon","profile": "An atrocious Digimon capable of invading any network and destroying its data. Its defense is remarkably improved thanks to the limbs attached to its cocoon body."},{"name": "Ladydevimon","profile": "A female fallen angel Digimon that holds dark power of incomparable purity. It is impossible to control it using personal computers. Its enemy is Angewomon."},{"name": "Vamdemon","profile": "The king of the Undead Digimon. It was resurrected using dark magic. It is skilled at transforming broken data into evil computer viruses. Its powers are only half as strong during the daytime."},{"name": "Demon","profile": "One of the Seven Great Demon Lords. It was a high-ranking Angel Digimon, but it was exiled to the darkness after it rebelled against the good world. Now it is planning revenge against the Digital World."},{"name": "Lilithmon","profile": "A Digimon that was originally a high-ranking Angel Digimon. It fell to the dark side and is now called ’The Goddess of Darkness’. It is one of the Seven Great Demon Lords. Anything touched by the nails of its left hand will corrode."},{"name": "Piemon","profile": "A Digimon shrouded in mystery. No one knows how or why it was born. It possesses a strong and elusive power, so if you meet it you’ll have no choice but to resign yourself to your final moments."},{"name": "Patamon","profile": "A Digimon that can fly in the sky due to its big ears. However, its speed is only 1 km/h, so it is faster if it walks. It doesn’t wear a Holy Ring, but the genes of ancient Digimon are hidden inside it."},{"name": "Tailmon","profile": "A Holy Digimon wearing a Holy Ring on its tail. It looks very sweet and innocent, but it has very sharp nails that are copied from Saberleomon’s data."},{"name": "Angemon","profile": "A Digimon whose job is maintaining Good in the Digital World and keeping out Evil. It has six divine wings that are said to bring happiness."},{"name": "Angewomon","profile": "A Digimon who has a calm personality but is very strict with twisted and evil individuals. It will punish them until they change. Thanks to its morals and power, it is praised as ’The Goddess’ of the Digital World."},{"name": "Holyangemon","profile": "A Digimon responsible for surveilling the world as an agent of light. Whenever darkness approaches, it changes to battle mode. It fights the darkness with its sacred sword Excalibur in its right hand and its Beam Shield in its left hand."},{"name": "Goddramon","profile": "A Holy dragon Digimon with a shining, golden body. It is one of the Four Great Dragons. It is small and wears in its right hand Umon the Blue Thunder, a weapon of regeneration, and in its left hand Amon the Red Flame, a weapon of destruction."},{"name": "Holydramon","profile": "A Digimon seated on the highest cliff of the god beast Digimon. It is the master of the skies and has the power to invade anything. It is one of the Four Great Dragons. Legends predict its advent when the evil forces become too strong."},{"name": "Hououmon","profile": "The head of the bird Digimon. It has four shiny golden wings. It wears two Holy Rings and is said to govern all the Holy Bird Digimon. Its power is immeasurable."},{"name": "Elecmon","profile": "A Digimon evolved from Tsunomon. It is very curious and likes pranks. Its nine tails open during battle like the feathers of a peacock and intimidate the enemy."},{"name": "Gaomon","profile": "A Digimon with sharp claws, agile moves, and strong legs. It is a subspecies of Gazimon. It has a number of deadly skills that involve movement. Depending on its partner, it can also be a cool, intellectual character."},{"name": "V-mon","profile": "A Digimon that can use digimentals and perform armor evolution, it is the survivor of a family that flourished during the Genesis of the Digital World. Although it is mischievous, it has a strong sense of justice and cares about its partners."},{"name": "Geogreymon","profile": "A subspecies of Greymon. Its whole body developed like a lethal weapon, becoming even more aggressive. It has the same lethal skill as Greymon."},{"name": "Blackgaogamon","profile": "A Digimon evolved to the Black form. During its evolution process a mysterious secretion called ’Black Digitron’ was mixed in. It is not as light as Gaogamon, but it has a sturdier body."},{"name": "Blackgarurumon","profile": "A type of virus Garurumon. Sharp blades grow from its shoulders, which it can use to cut anything it touches. It collects bones and buries them in the ground, but sometimes Drimogemon steals them from it."},{"name": "Pegasmon","profile": "A Digimon covered in golden armor. It armor-evolved from Patamon with the Digimental of Hope. It flies freely in the sky and holds absolute power, using its holy power against evil."},{"name": "Lighdramon","profile": "A Digimon who armor-evolved from V-mon using the Digimental of Friendship. It possesses the attribute of thunder and attacks its enemies with a lightning-quick electric shock."},{"name": "Blackmachgaogamon","profile": "A Digimon evolved to the Black form. During its evolution process a mysterious secretion called ’Black Digitron’ was mixed in. It is not as fast as Machgaogamon, but it can fly for longer periods."},{"name": "Blackweregarurumon","profile": "A Digimon evolved from the virus Garurumon. Its speed decreased but the attack power of both its arms increased, improving its ability. It became even more bloodthirsty and puts more pressure on its enemy."},{"name": "Rizegreymon","profile": "A Digimon with over half of its body mechanized. It also learned how to fly. It flies freely in the sky with its huge body and attacks using the Chrome Digizoid revolver in its left hand."},{"name": "Shinegreymon","profile": "A Light Dragon Digimon that stores the burning energy of the Sun and uses it in battle. No matter how many times it falls, it always gets back up due to its strong spirit. It can summon the Geogrey Sword, in which the power of the earth is concentrated."},{"name": "Kotemon","profile": "A Swordsman Digimon that wears its armor at all times, so its body is a true mystery. It is working hard to become a top-class swordsman. It is a coward and cries very easily, but it is a good friend and has a strong sense of justice."},{"name": "Gargomon","profile": "A hunter Digimon. It is agile and can jump very high. It wears a gatling gun on each of its arms. Its favorite jeans are the specially ordered D-Vi’S503XX."},{"name": "Rapidmon","profile": "A Digimon who armor-evolved from Terriermon using the Digimental of Fate, turning its body golden. Its abilities are as strong as those of the ultimate level."},{"name": "Seraphimon","profile": "The highest of the Angel Digimon. It has ten golden wings on its back. It is the unifier of all Angel Digimon and the enforcer of divine law. It is said that it will descend for the final battle against evil."},{"name": "Blackmetalgarurumon","profile": "A virus type of Metal Garurumon. All its armament works at low temperatures. It has an unforgiving personality, hunting its prey with everything it has."},{"name": "Aquilamon","profile": "A Giant Bird Digimon called The Great Eagle of the Desert. It is always faithful to its master. It flies the sky at Mach speed, locates its prey using its sharp eyes, and charges its enemy using the horns on its head."},{"name": "Ankylomon","profile": "A Digimon whose whole body is covered in a hardened epidermis. It uses its stiff spine in both defense and attack. It has a brave personality and attacks its enemies with great force."},{"name": "Lilamon","profile": "A Digimon that has the appearance of a lilac, a flower loved by everyone. A beautiful Digimon, it governs over death and rebirth. It has a pure and innocent personality, but its leaves contain a lethal poison."},{"name": "Kingetemon","profile": "An Etemon Digimon that calls itself The King of Kings. Acting like an ultimate clown, it always has a sneer on its face and is dressed in a Monkey Costume with the ’Great King’ characters written on its chest."},{"name": "Goburimon","profile": "A Digimon that loves evil and uses its cunning attacks in a group. It is as intelligent as it is cunning, but it is very cowardly. If it is left to fight alone and realizes it is at a disadvantage, it runs away like a rabbit."},{"name": "Devidramon","profile": "An Evil Beast Digimon called from the Dark Area by Devimon. It was born from a hacker who misused the network. It freezes its enemies by staring at them with its four glowing red eyes."},{"name": "Chimairamon","profile": "A Digimon created by combining the biological parts of various other Digimon. It is driven by its battle instincts and is very strong in combat, but nobody knows how it was born or other details about its life."},{"name": "Neodevimon","profile": "A Digimon artificially strengthened by somebody unknown. It is incredibly strong but completely controlled by its mask, which suppresses even its own will."},{"name": "Venomvamdemon","profile": "A Digimon evolved from Vamdemon with all its power unleashed. It has lost most of its intelligence and is only driven by the desire for destruction. Even Vamdemon itself hates becoming this ugly Digimon."},{"name": "Cherubimon (evil)","profile": "Although one of The Three Great Angels, it transformed into an evil form for some mysterious reason. It is incredibly powerful and capable of destroying the equilibrium in the Digital World. It passes divine judgement on all living things."},{"name": "Blackseraphimon","profile": "A hybrid Digimon that stole its data from Seraphimon and Mercuremon. It has ten bat wings and wields power directed toward evil. It also has Mercuremon’s tricks."},{"name": "Belialvamdemon","profile": "A Digimon that lurks in the darkness of the human heart. It is the final form of Vamdemon. Unlike Venomvamdemon, it kept its intelligence. On its arms it has the parasitic living guns Sodom and Gomorrah."},{"name": "Millenniumon","profile": "An ultimate form synthetic Digimon born through the combination of the mechanized Mugendramon and the synthetic Chimairamon. It has the power to control time, and it is said it cannot be knocked down."},{"name": "Terriermon","profile": "A Digimon whose evolution is shrouded in mystery. It is rumored that it is sometimes born with a twin. It has a very cute appearance, but as a combat Digimon there is immense power hidden inside it."},{"name": "Nefertimon","profile": "A Digimon who armor-evolved from Tailmon using the Digimental of Light. It has the attribute of light and can gracefully fly in the sky. It can purify the corruption of the darkness using the power of intense light."},{"name": "Ofanimon","profile": "A Digimon that spreads love and mercy. It is the ultimate form of the female Angel Digimon. It protects the Kernel (the God’s land) together with Seraphimon and Cherubimon."},{"name": "Agumon","profile": "A Digimon with a red waistband wrapped around its arms. It is unlike the normal Agumon. It does not distinguish between regular attacks and special moves, and it is believed that its evolution path is different."},{"name": "Renamon","profile": "A Digimon of high intelligence. It can become even more intelligent through the influence of its partners or its childhood education. Its enemies are at its mercy in battles that favor speed over force."},{"name": "Kyubimon","profile": "A Digimon evolved from a very skilled and experienced Renamon. It is a bewitching fox. Although it is not very strong, it has a strong spirit and a variety of skills."},{"name": "Fladramon","profile": "A Digimon who has armor-evolved from V-mon through the Digimental of Courage. Its combat skills are similar to a burning flame, and it hits its enemies with extremely strong knuckles."},{"name": "Grappuleomon","profile": "A martial arts Digimon who has been enlightened to some original secrets. It received its fighting data from the veteran warrior Leomon. Its digicore moves the four turbines that stand for its limbs."},{"name": "Taomon","profile": "A Digimon with a strong mind and great knowledge of Onmyodo. It can use all the skills of this art. It has many charms and dark weapons in its sleeves. It is adept at attacking its enemies from the dark."},{"name": "Ulforcevdramon","profile": "A Digimon that can freely manipulate the holy Ulforce and has the power to reconstruct digital data. It is the sacred knight predicted in the legends. It wears armor made of Blue Digizoid and has godly speed."},{"name": "Sakuyamon","profile": "A Digimon fulfilling the role of a miko, the agent of God’s will. It has four kuda-kitsune around its waist-belt. The sound of its servants and the echo of its singing voice have the power to exorcise all evil."},{"name": "Bancholeomon","profile": "A Digimon who wins while respecting its sense of justice and holding to its beliefs. It would face even the Three Great Angels or the Royal Knights to make its sense of justice understood."},{"name": "Toyagumon","profile": "A Digimon whose whole body is made of plastic blocks. It was built using Agumon as a model. However, it is very cowardly and has no courage. When it is surprised, its body breaks into pieces."},{"name": "Magnamon","profile": "A Digimon who armor-evolved through the Digimental of Miracles. Dressed in Chrome Digizoid armor, its power is comparable to that of an ultimate form. In times of crisis, it can escape using the power of miracles."},{"name": "Mechanorimon","profile": "A Powered Suit Digimon. It is run by a small Digimon inside it. A Digimon still under development, its digicore can cause overheating depending on the operating conditions."},{"name": "Giromon","profile": "A Digimon patrolling the computer network. It fights off illegal intruders. Called the Net Keeper, it attacks any invading enemy with all its forces."},{"name": "Megadramon","profile": "A Virus Dark Dragon Digimon. It was upgraded to be able to destroy a network by itself. It invades the computer network, destroys the host computers, and modifies them easily."},{"name": "Craniummon","profile": "The most respectful Digimon of the Royal Knights. It pays respect even to its enemies during combat. It holds the legendary magic spear Claiomh Solais and the sturdy shield Avalon."},{"name": "Justimon","profile": "A hero of justice Digimon trailing a red muffler. It can change its arm by replacing the plug of its Extend Transmitter."},{"name": "Saintgargomon","profile": "A huge machine Digimon equipped with high-temperature weapons on its whole body. These weapons are comparable to those carried by Metalgarurumon. It is slow but can easily repel its enemies with the power of fire."},{"name": "Kamemon","profile": "A Digimon equipped with a shell in the shape of a mouse and trackball on its belly. When it retreats into its shell, its defense increases significantly, but its helmet cannot fit inside."},{"name": "Sunflowmon","profile": "A Digimon that looks like a sunflower. It absorbs energy when it bathes in the sunlight. It loves basking in the sun and, on days with good weather, it flies using the leaves on its back."},{"name": "Tortamon","profile": "A Digimon with dense armor and sharp blades. It makes a soft noise when it walks. Its moving speed is extremely slow. However, it can retract its limbs and rotate, making its speed more than 10 times greater."},{"name": "Reppamon","profile": "A kamaitachi-style Digimon. Its tail is a sharp blade with a will of its own. It likes to battle in the forest. It attacks together with its blade, but there are times when they don’t get along very well."},{"name": "Etemon","profile": "A Digimon calling itself the King of Digimon. It wears a fortified monkey suit and sings its best numbers. It gets along well with Monzaemon, but it is rumored it pulls the other’s strings in the shadows."},{"name": "Sagomon","profile": "A Digimon with a cheerful and easy-going personality. It transforms into a dreadful Digimon if even one of the skulls at its waist disappears. It was expelled from heaven and has set out on a journey in search of its true identity."},{"name": "Leviamon","profile": "One of the Seven Great Demon Lords sleeping in the abyss of the Digital World. It has a huge body and is called the Devil Beast due to its very large jaw."},{"name": "Phascomon","profile": "A Digimon living in the Evil Forest spreading in the Dark Area. It is a dangerous Digimon, even though it doesn’t look like one. It sleeps in trees all the time and sometimes attacks negligent opponents by jumping on them."},{"name": "Porcupamon","profile": "An endangered species of Digimon. It didn’t live in the Dark Area originally but was driven away by other species. Its body is covered with a special razor material."},{"name": "Astamon","profile": "A young noble Digimon from the Dark Area which binds together the devil-type Digimon. It has the power to surpass the ultimate form, and it attacks its enemies without mercy. Its favorite machine gun is Oro Salmon."},{"name": "Skullsatamon","profile": "A ruined but refined Fallen Angel Digimon. Its main purposes are power and destruction. Dark power is condensed in its dark digicore."},{"name": "Marindevimon","profile": "A subspecies of Digimon. It is full of hatred because it lives alone in the deep sea. Its two tentacles have their own will and are free to attack on their own."},{"name": "Armagemon","profile": "A super ultimate form Digimon, formed by scattering Kuramon everywhere and then putting all the pieces together in the real world. It took over Diablomon’s plans and seeks revenge against Omegamon."},{"name": "Barbamon","profile": "A Digimon living in the center of the Dark Area. It is one of Seven Great Demon Lords, the supervisors of the fallen angels. Obsessed with all the treasures in the network, it can employ any methods when it comes to materialistic issues."},{"name": "Belphemon: Ragemode","profile": "A Digimon awakened after a long sleep. It is the incarnation of anger. Its ferocious roar is enough to disintegrate the data of weaker Digimon. It considers everything that comes into its sight to be an enemy."},{"name": "Metaletemon","profile": "The ’King of Digimon’ studied its weak points after each battle and coated its whole body in Chrome Digizoid. Thus, a strong and dirty warrior was born!"},{"name": "Lilithmon","profile": "The mysterious and beautiful goddess of darkness. It deceives its opponents and always brings death to those who fall into temptation. It is generous with evil and unforgiving with good."},{"name": "Kudamon","profile": "A Holy Beast Digimon with a holy shell. It always calmly analyzes the situation and leads the battle to a position favorable for it. It deposits sacred power into its earring daily, and the deposited amount can influence its evolution."},{"name": "Sanzomon","profile": "A monk Digimon who continues its journey of trials in order to find enlightenment. It holds no weapon but only sings its sutras and leads the hearts gone astray. Some Digimon aim for the pure energy stored in its digicore."},{"name": "Tyilinmon","profile": "A Digimon who, though it has been in its Perfect form since the genesis of the Digital World, is said to hold the same power as an Ultimate form. It has a very merciful personality, but it severely punishes those who kill unjustly."},{"name": "Shakamon","profile": "A Digimon originally very close to Yggdrasil. It has been protecting the eastern region for a long time and is full of affection. It sometimes gives trials to the Digital World and waits for Digimon to surmount them."},{"name": "V-dramon","profile": "An ancient species of Digimon that only exists on the Folder Continent of the Digital World. When its emotions go wild, its strength grows such that it can even overpower Perfect-form Digimon, though this has detrimental effects on its long-term health."},{"name": "Aerovdramon","profile": "A legendary Digimon. It evolved after many battles from V-dramon, a rare species. It now has stronger fighting skills due to its flying ability, its hard skin, and its sharp claws and horns."},{"name": "Cyberdramon","profile": "A mysterious Digimon covered in special rubber armor. It is the partner of the legendary tamers. It doesn’t belong to the Virus Busters, but it hunts viruses on its own."},{"name": "Zhuqiaomon","profile": "A legendary Digimon protecting the southern region of the Digital World. One of the Four Holy Beasts, it has a wild temper and is hostile towards human interference to the Digital World."},{"name": "Yaksamon","profile": "A Demon Man Digimon with a fierce fighting force. It uses its secret arts in its battles. It wields its two wooden swords freely, giving it a god-like power. It has a very calm personality and places much importance in faithfulness."},{"name": "Wolfmon","profile": "A Digimon who evolved through the Human Spirit of Light, inheriting the power of the Ten Warriors of Light. It embodies the spirit of chivalry, and its body is covered in holy amethyst that gives it power if used with the right intentions."},{"name": "Garummon","profile": "A Digimon who evolved through the Beast Spirit of Light, inheriting the power of the Ten Warriors of Light. It uses its high speed to surprise its enemies with its attacks and its sharp claws and fangs to rip them apart."},{"name": "Locomon","profile": "A Digimon whose purpose in life is to continue running and advancing on the rails. It isn’t very fast, but, because it runs continuously, it can sometimes distort time and space."},{"name": "Grandlocomon","profile": "A Digimon obtained through the limit breakthrough of Locomon. It created its own rails and now runs carelessly through the network. It runs with outstanding speed and breaks everything it collides with into pieces."},{"name": "Baihumon","profile": "One of the Four Holy Beasts. It protects the western region of the Digital World. It boasts the greatest power of the Four Holy Beasts. It is said that it has god-like power, but it is basically a neutral figure."},{"name": "Beowolfmon","profile": "A Digimon who inherited power from the Ten Warriors of Light. It acquired unknown abilities, combining the powers of both man and beast. It has Trinitat in its right hand and Roland 2 in its left hand. It is very good at distance attacks."},{"name": "Lordknightmon","profile": "A member of the Royal Knights that governs over all Knight Digimon. It sticks to its own sense of justice, but if it must maintain peace, it can also use force to eliminate the weak."},{"name": "Floramon","profile": "A Digimon who evolved like a reptile but is classified as a plant. Its petals protect its head like a helmet. Its rival is Palmon."},{"name": "Woodmon","profile": "A Digimon with the shape of a huge withered tree. It pretends to be a simple tree, seizes passing Digimon, and absorbs their energy. It has a ferocious character but is vulnerable to fire."},{"name": "Lilimon","profile": "A Digimon that looks like a human but hides immeasurable power. It is impossible to control once it starts crying. It opens its heart only to humans with the same temperament as its own."},{"name": "Xuanwumon","profile": "One of the Four Holy Beasts. It protects the northern region of the Digital World. It is the oldest of the Four Holy Beasts and has a very warm character. It performs its water skills masterfully."},{"name": "Neovamdemon","profile": "The general of the Moonlight troops. It commands undead Digimon who hide in fields before slaughtering their enemies. Since it lurks in the darkness all the time, it has forgotten what it is like to have feelings and devotes all its time to missions."},{"name": "Huanglongmon","profile": "The emperor of the center of the world. It supervises the Four Holy Beasts, the protectors of the Digital World. Its body is covered in scales made of Huanglong Ore, the basis for Chrome Digizoid. These scales protect it from any wound."},{"name": "Qinglongmon","profile": "One of the Four Holy Beasts. It protects the eastern region of the Digital World. It has been deified and is considered a legendary figure. However, in times of crisis, it always helps the Digital World."},{"name": "Chrysalimon","profile": "An adult Digimon with the appearance of a chrysalis. The child Digimon Keramon temporarily becomes a chrysalis and conserves its energy in order to evolve into a stronger Digimon."},{"name": "Angewomon","profile": "A Digimon with a calm personality, but very strict with twisted and evil characters. She will punish them until they will change. Thanks to her morals and power, she is praised as ’The Goddes’ of the Digital World."},{"name": "Keramon","profile": "A child Digimon that thinks that destroying data is just a game. He destroys the computers he penetrates, eating away data at a rate of 100MB per second."},{"name": "Patamon","profile": "A Digimon that can fly in the sky due to his big ears. However, his speed is only 1 km/h, so it is faster if he walks. He doesn’t wear a Holy Ring, but inside him lie hidden genes of ancient Digimon."},{"name": "Bancholeomon","profile": "A Digimon who continued to win respecting his spirit of justice and without having to break his beliefs. He would face even the Three Great Angels or the Royal Knights if this would help him make his spirit of justice understood."},{"name": "Devimon & Ladydevimon","profile": "Two Fallen Angel Digimon dressed in black. They have sly and atrocious personalities but superior intelligence!"},{"name": "Angemon & Angewomon","profile": "These Digimon have gentle personalities but are very composed when it comes to punishing evil. They attack the enemy until they destroy it!"},{"name": "Devimon & Lady Devimon","profile": "Anniversary limited scenario! Two Fallen Angel Digimon dressed in black, with a sly and atrocious personality, but superior intelligence!"},{"name": "Angemon & Angewomon","profile": "Thank you for preregistering! These Digimon have gentle personalities, but are very composed when it comes to punishing evil. They attack the enemy until they destroy him!"},{"name": "Lunamon","profile": "A Digimon born through the fusion of lunar observation data. Its big ears make it look like a rabbit. It is timid and gets attached easily. It can also wield abilities connected to the power of darkness."},{"name": "Lekismon","profile": "A Beast Man Digimon with amazing, powerful jumps. It has its enemies at its mercy with its fast moves. It has a very elusive personality, making its appearance somewhat mysterious."},{"name": "Crescemon","profile": "A Demon Man Digimon. It fights its enemies with its flexible body and supple moves. It always fights in an elegant way, and it is said that its power increases considerably under the moonlight."},{"name": "Dianamon","profile": "One of the Olympos XII. It presides over water and ice and can act even when the surrounding temperature is absolute zero. Like the moon, it is two-faced and hides a terrible power under its beauty."},{"name": "Dorumon","profile": "A beast Digimon with an old-style interface on its forehead. It is speculated it is an experimental ’prototype Digimon’ from before the Digimon were discovered."},{"name": "Dorugamon","profile": "A ferocious Beast Dragon Digimon. It has the attributes of both beasts and dragons. Many Digimon start running away as soon as they see its shadow."},{"name": "Doruguremon","profile": "A Beast Dragon Digimon of huge size. Its nickname is ’the Final Enemy’. Its form was released through the interface on its forehead by the life-data of the legendary creature ’the Dragon’."},{"name": "Alphamon","profile": "One of the Royal Knights. It is also called ’the Aloof Hermit’. It wears a blue fluttering cloak, and its place is called ’the Empty Seat’."},{"name": "Vajramon","profile": "A Digimon who seeks to find the truth about the physical and spiritual worlds. It is under the command of Xuanwumon, one of the Four Holy Beasts."},{"name": "Gaioumon","profile": "A Dragon Man Digimon. It is a subspecies of the Greymon species. It is excellent as a combat species, and its becomes more powerful whenever it wins a battle."},{"name": "Zanbamon","profile": "A Digimon who likes to fight directly with the enemy. It is a general who always stands in the vanguard of its army."},{"name": "Guilmon","profile": "A fighter Digimon comparable to a carnivorous beast. It hides in itself the inherent potential of Digimon. It can become a protective presence in the Digital World if its power is correctly exercised."},{"name": "Growmon","profile": "A wild and ferocious Digimon. It is called ’the Deep Crimson Demon Dragon’. Its roar has the power to shake the ones who hear it, and its mouth spits burning flames. Depending on the tamer’s level of training, it can also fight in the name of justice."},{"name": "Megalogrowmon","profile": "A huge Cyborg Digimon whose upper body is covered in Chrome Digizoid. It can also fly using the verniers on its shoulders, making it immensely powerful in both terrestrial and aerial combat."},{"name": "Dukemon","profile": "A Digimon born from Megidramon. Its name is also linked to the Royal Knights. Its weapons, Gram and Aegis, form from its armor, which is made completely of Chrome Digizoid."},{"name": "Gomamon","profile": "A naughty Digimon that likes pranks. Its body is covered with fur so that it can resist cold temperatures. Its claws help it break hard blocks of ice. When it gets angry, the red hair on its head bristles."},{"name": "Ikkakumon","profile": "A Digimon with a horn made of Mithril. The skin under its fur is as hard as its horn. Its claws emit a high temperature which melts the ice under its feet, secures it on firm ground, and allows it to act even in extremely cold places."},{"name": "Zudomon","profile": "A materialistic Digimon that protects its honed body with leather and armor stolen from its enemies. It also possesses the Thor Hammer, a Chrome Digizoid weapon dug out of ancient ice, which produces violent shock waves when used."},{"name": "Plesiomon","profile": "A Digimon that rarely shows itself. It appears to be surrounded by mist, disturbing the viewer’s vision. With its white body and refined appearance, it is a very mysterious figure."},{"name": "Vikemon","profile": "A Beast Man Digimon in the ultimate form. It governs permafrost, the land of extreme cold. Its fur has crystallized, and it’s said to now be as hard as Chrome Digizoid."},{"name": "Coronamon","profile": "A Digimon born from sun-watching data. It has a strong sense of justice and is an innocent, naive character. It is good at direct fire attacks, and it can also release flame bombs."},{"name": "Firamon","profile": "A Beast Digimon with the nickname of ’the Lion soaring in the sky’. It is a careful leader, protecting a certain relic of the Digital World."},{"name": "Flaremon","profile": "A majestic Beast Man Digimon. Its mane and presence make it look scary at first glance. However, it has great strength of will and fights through any difficulty for the sake of its friends."},{"name": "Apollomon","profile": "One of the Olympos XII. It has in its body a fiery energy with the power to purify all that exists. Its boiling blood and its pride give it the strength to control this fierce energy."},{"name": "Omegamon","profile": "A Holy Knight Digimon born through the fusion of miracles by the will of the good ones. Well-rounded in combat, it effortlessly wields weapons that themselves have the strength of two Digimon."},{"name": "Imperialdramon FM","profile": "A Digimon who unleashed its full power in dragon mode and transformed into a legendary dragon warrior. It is incredibly intelligent and capable of controlling its violent power."},{"name": "Paildramon","profile": "A Digimon who jogress-evolved from XV-mon and Stingmon. Although it has the skilled attacks of dragons and the defensive ability of insects, the dragon attributes are a little stronger. It is very loyal and always protects its master."},{"name": "Ceresmon","profile": "A Digimon with a peaceful appearance. It can control plant Digimon and absorb the enemy’s energy using its terrifying skill, Famis."},{"name": "Rapidmon Armor","profile": "A Digimon who armor-evolved from Terriermon using the Digimental of Fate, turning its body golden. Its abilities are as strong as those of the ultimate level."},{"name": "Magnagarurumon","profile": "A transcendent-species Digimon and user of light-based abilities. It is said its power surpasses that of the legendary Ten Warriors. A master of high-speed travel, when it’s equipped with its flight unit, it can fly at close to the speed of light."},{"name": "Lotusmon","profile": "A Fairy Digimon that looks like a lotus, the flower said to be blooming in heaven. A lady with a calm and gracious personality, it has the power to make one forget one’s sorrows and have happy dreams."},{"name": "Leomon","profile": "A Digimon praised as a noble hero. It is a warrior with a just heart who has defeated many atrocious Digimon. Its rival is Orgemon. On its waist, it carries a magical sword called ’Shishiou-maru’."},{"name": "Imperialdramon DM","profile": "An ancient and incredibly powerful dragon Digimon. Besides its dragon form, it also has another form that can employ its full power. However, because this force is so big, it is difficult to control."},{"name": "Beelzebumon","profile": "An aloof Digimon with a powerful spirit. It has two double-barreled shotguns, the Berenjena. It is feared as one of the Seven Great Demon Lords and looks for battles with strong Digimon."},{"name": "Metalgreymon Virus","profile": "A Digimon who dark-evolved when Agumon was manipulated by the Evil Spiral. It is now a virus type and follows the orders of the Digimon Kaiser, attacking its partners."},{"name": "Blackmetalgarurumon","profile": "A virus type of Metal Garurumon. All its armament works at low temperatures. It has an unforgiving personality, hunting its prey with everything it has."},{"name": "Blackwargreymon","profile": "A Dragon Warrior Digimon that earnestly pursues its own brand of justice. While its ’Brave Shield’ is missing its crest of Courage, it maintains the pride of a warrior, seeking always to understand why it has a soul."},{"name": "Omegamon Zwart","profile": "A Digimon born temporarily as a black Holy Knight by mixing in the recently discovered substance Black Digitron during the fusion process with Omegamon. It sports enhanced powers, not the least of which are the weapons on both its arms."},{"name": "Dracomon","profile": "An old pure-blooded Dragon Digimon. It is said it is the ancestor of all Dramon-type Digimon."},{"name": "Coredramon","profile": "A Digimon evolved from Dracomon. It now lives in the steep mountains. For this reason, it has developed wings with which it can fly at high speeds."},{"name": "Wingdramon","profile": "A Sky Dragon Digimon that can fly freely using the big wings it has developed. The scales on its wings can block gravity, which is why it can fly without flapping its wings."},{"name": "Slayerdramon","profile": "A Dragon Man Digimon with its body covered in Chrome Digizoid scale armor."},{"name": "Betamon","profile": "An Amphibian Digimon walking on four legs. It has a warm and quiet personality. However, once it gets angry it releases 1.000.000 V of electric current to attack its enemy."},{"name": "Seadramon","profile": "An Aquatic Digimon with a long body, like a big snake. It uses this long body and coils tightly around its enemy until it stops breathing."},{"name": "Waruseadramon","profile": "A Digimon evolved on an evil path from Seadramon. It is very similar to Megaseadramon and their skills are very much alike as well."},{"name": "Alraumon","profile": "A Plant Digimon similar to Palmon. It lives in warm areas, opening the flowers on top of its head and on its arms and performing photosynthesis."},{"name": "Kiwimon","profile": "An ancient mythical Digimon said to have been extinct due to too much hunting following the spread of the internet. It is a Bird-type Digimon but cannot fly due to the complete degeneration of its wings."},{"name": "Sirenmon","profile": "A God Man Digimon that looks like a combination of fish and man. It has a cheerful personality and always sings a joyful song."},{"name": "Darkdramon","profile": "A Cyborg Digimon that is supposed to be the weapon of last resort for the mechanized ’D-brigade’."},{"name": "Qinglongmon","profile": "One of the Four Holy Beasts. It protects the eastern region of the Digital World. It has been deified and is considered a legendary figure. However, in times of crisis, it always helps the Digital World."},{"name": "Turuiemon","profile": "A Digimon blessed with a rare talent for Chinese martial arts but still in training. It uses its originally developed technique to fight its enemies."},{"name": "Cherubimon (good)","profile": "An Angel Digimon in the shape of a beast. It is one of the Three Great Angels and sits in the highest position together with the Seraph Digimon Seraphimon."},{"name": "Valkyrimon","profile": "A Digimon covered in shiny armor. Its armor produces an aurora which regenerates the data of heroes fallen in battle and returns them to a new Digitama."},{"name": "Dianamon","profile": "One of the Olympos XII. It presides over water and ice and can act even when the surrounding temperature is absolute zero. Like the moon, it is two-faced and hides a terrible power under its beauty."},{"name": "Alphamon","profile": "One of the Royal Knights. It is also called ’the Aloof Hermit’. It wears a blue fluttering cloak, and its place is called ’the Empty Seat’."},{"name": "Dukemon","profile": "A Digimon born from Megidramon. Its name is also linked to the Royal Knights. Its weapons, Gram and Aegis, form from its armor, which is made completely of Chrome Digizoid."},{"name": "Apollomon","profile": "One of the Olympos XII. It has in its body a fiery energy with the power to purify all that exists. Its boiling blood and its pride give it the strength to control this fierce energy."},{"name": "Omegamon","profile": "A Holy Knight Digimon born through the fusion of miracles by the will of the good ones. Well-rounded in combat, it effortlessly wields weapons that themselves have the strength of two Digimon."},{"name": "Vikemon","profile": "A Beast Man Digimon in the ultimate form. It governs permafrost, the land of extreme cold. Its fur has crystallized, and it’s said to now be as hard as Chrome Digizoid."},{"name": "Ulforcevdramon","profile": "A Digimon that can freely manipulate the holy Ulforce and has the power to reconstruct digital data. It is the sacred knight predicted in the legends. It wears armor made of Blue Digizoid and has godly speed."},{"name": "Goddramon","profile": "A Holy dragon Digimon with a shining, golden body. It is one of the Four Great Dragons. It is small and wears in its right hand Umon the Blue Thunder, a weapon of regeneration, and in its left hand Amon the Red Flame, a weapon of destruction."},{"name": "Leviamon","profile": "One of the Seven Great Demon Lords sleeping in the abyss of the Digital World. It has a huge body and is called the Devil Beast due to its very large jaw."},{"name": "Ceresmon","profile": "A Digimon who forgot the gratitude owed to the forest and land. It now brings fear to the forests, harming trees and spoiling the land."},{"name": "Grandlocomon","profile": "A Digimon obtained through the limit breakthrough of Locomon. It created its own rails and now runs carelessly through the network. It runs with outstanding speed and breaks everything it collides with into pieces."},{"name": "Sleipmon","profile": "A member of the Royal Knights that dresses in Red Digizoid armor, which is known for its hardness. It moves with a superior, instantaneous speed, shooting light arrows with the sacred crossbow Muspelheim."},{"name": "Grankuwagamon","profile": "A dreadful Digimon called the devil of the deep forest. It is the final form of the Kuwagamon species. It lives in the depths of the forests and is fully nocturnal. Its eternal rival is Heraklekabuterimon."},{"name": "Huanglongmon","profile": "The emperor of the center of the world. It supervises the Four Holy Beasts, the protectors of the Digital World. Its body is covered in scales made of Huanglong Ore, the basis for Chrome Digizoid. These scales protect it from any wound."},{"name": "Highandromon","profile": "An ultimate Cyborg Digimon who has reached the perfect form of the incomplete Andromon."},{"name": "Dukemon","profile": "A Digimon born from Megidramon. Its name is also linked to the Royal Knights. Its weapons, Gram and Aegis, form from its armor, which is made completely of Chrome Digizoid."},{"name": "Ofanimon","profile": "A Digimon that spreads love and mercy. It is the ultimate form of the female Angel Digimon. It protects the Kernel (the God’s land) together with Seraphimon and Cherubimon."},{"name": "Lopmon","profile": "A very rare Digimon. It is born as the twin of Terriermon and has three horns. Although it is a Combat-species like Terriermon, it is a crybaby and feels lonely very easily."},{"name": "Andiramon","profile": "A Grappling Digimon. It can easily control its mind and harden its body, having kaleidoscopic attack and defense skills. When it receives damage from the enemy, it can instantly recover using the power of its mind."},{"name": "Hawkmon","profile": "A calm and polite Digimon that protects its partners with the dedication of a knight. The descendant of an ancient race, it can armor-evolve using Digimentals."},{"name": "Silphymon","profile": "A Digimon who jogress-evolved from Aquilamon and Tailmon. Its developed legs allow it to jump and glide easily. It captures its enemies with the radar on both its ears."},{"name": "Shoutmon x3GM","profile": "An Incandescent Dragon Digimon. It burns everything with its flame wings. Its strong point is aerial combat at super speed."},{"name": "Shoutmon x4B","profile": "A God Horse Digimon, formed from a Victory-form base Digimon to which Beelzebumon was added. Beelzebumon’s power is added to all attacks, producing strong sword and gun skills."},{"name": "Shoutmon x7","profile": "A Digimon formed through the Alder-burst of Shoutmon DX and the DigiXros of Ballistamon, Dorulumon, Sparrowmon, and Starmons. The burning hearts of the seven Digimon will lead to world peace."},{"name": "Bagramon","profile": "An Angel Digimon who originally governed over Death. It became disappointed with the world’s philosophy and started a revolt, for which it was punished. It now continues searching for a new philosophy to substitute the gods’ philosophy."},{"name": "Blastmon","profile": "A Mineral Digimon with a super hard and heavy body. Its strength lies in attacks that use its body. Even if its crystal armor breaks, it can regenerate. It loves eating gems."},{"name": "Tactimon","profile": "A soldier carrying an evil sword called Jatetsufujin-maru. Its ingenuity is essential in planning its battles, and it wouldn’t draw back from sacrificing allies for victory."},{"name": "Dianamon","profile": "One of the Olympos XII. It presides over water and ice and can act even when the surrounding temperature is absolute zero. Like the moon, it is two-faced and hides a terrible power under its beauty."},{"name": "Dukemon","profile": "A Digimon born from Megidramon. Its name is also linked to the Royal Knights. Its weapons, Gram and Aegis, form from its armor, which is made completely of Chrome Digizoid."},{"name": "Apollomon","profile": "One of the Olympos XII. It has in its body a fiery energy with the power to purify all that exists. Its boiling blood and its pride give it the strength to control this fierce energy."},{"name": "Ulforcevdramon","profile": "A Digimon that can freely manipulate the holy Ulforce and has the power to reconstruct digital data. It is the sacred knight predicted in the legends. It wears armor made of Blue Digizoid and has godly speed."},{"name": "Gazimon","profile": "A Digimon with a nasty personality. It sometimes uses its claws to attack its enemies, but mostly just to dig pitfalls and trap them."},{"name": "Dobermon","profile": "A ferocious Hunter Digimon. It was born through the transformation of a Virus into a Vaccine Digimon. It always follows its instincts and hunts Virus Digimon."},{"name": "Cerberumon","profile": "A Demon Beast Digimon called ’the Watchdog of Hell’. The claws on its four limbs are hard enough to be able to tear through a low-grade Chrome Digizoid alloy."},{"name": "Gaogamon","profile": "A Digimon evolved from Gaomon, whose claws grew out of its gloves. It uses its cool behavior and strong legs to quickly approach the enemy, then attacks it with its sharp claws."},{"name": "Machgaogamon","profile": "A Digimon equipped with a rocket engine on its back that possesses a huge driving force. It can fly at maximum thrust for a short time. Its special tactics are head-on and hit-and-run."},{"name": "Shakamon","profile": "A Digimon originally very close to Yggdrasil. It has been protecting the eastern region for a long time and is full of affection. It sometimes gives trials to the Digital World and waits for Digimon to surmount them."},{"name": "Omegamon","profile": "A Holy Knight Digimon born through the fusion of miracles by the will of the good ones. Well-rounded in combat, it effortlessly wields weapons that themselves have the strength of two Digimon."},{"name": "Demon","profile": "A Digimon looking to evolve to the super ultimate form using Arkadimon. Its ambitions are controlling the Digital World and invading the real world. All its acts stem from a desire for vengeance against the existence of all that is good."},{"name": "Seraphimon","profile": "The highest of the Angel Digimon. It has ten golden wings on its back. It is the unifier of all Angel Digimon and the enforcer of divine law. It is said that it will descend for the final battle against evil."},{"name": "Ofanimon","profile": "A Digimon that spreads love and mercy. It is the ultimate form of the female Angel Digimon. It protects the Kernel (the God’s land) together with Seraphimon and Cherubimon."},{"name": "Craniummon","profile": "The most respectful Digimon of the Royal Knights. It pays respect even to its enemies during combat. It holds the legendary magic spear Claiomh Solais and the sturdy shield Avalon."},{"name": "Zhuqiaomon","profile": "A legendary Digimon protecting the southern region of the Digital World. One of the Four Holy Beasts, it has a wild temper and is hostile towards human interference to the Digital World."},{"name": "Baihumon","profile": "One of the Four Holy Beasts. It protects the western region of the Digital World. It boasts the greatest power of the Four Holy Beasts. It is said that it has god-like power, but it is basically a neutral figure."},{"name": "Xuanwumon","profile": "One of the Four Holy Beasts. It protects the northern region of the Digital World. It is the oldest of the Four Holy Beasts and has a very warm character. It performs its water skills masterfully."},{"name": "Qinglongmon","profile": "One of the Four Holy Beasts. It protects the eastern region of the Digital World. It has been deified and is considered a legendary figure. However, in times of crisis, it always helps the Digital World."},{"name": "Imperialdramon FM","profile": "A Digimon who unleashed its full power in dragon mode and transformed into a legendary dragon warrior. It is incredibly intelligent and capable of controlling its violent power."},{"name": "Imperialdramon PM","profile": "A Digimon, originally Imperialdramon: Fightermode, who received the power of Omegamon. On its Omega Blade is engraved ’Reset’ in Digimon letters, as it resets all the data of the enemy Digimon it cuts."},{"name": "Seraphimon","profile": "The highest of the Angel Digimon. It has ten golden wings on its back. It is the unifier of all Angel Digimon and the enforcer of divine law. It is said that it will descend for the final battle against evil."},{"name": "Ofanimon","profile": "A Digimon that spreads love and mercy. It is the ultimate form of the female Angel Digimon. It protects the Kernel (the God’s land) together with Seraphimon and Cherubimon."},{"name": "Qinglongmon","profile": "One of the Four Holy Beasts. It protects the eastern region of the Digital World. It has been deified and is considered a legendary figure. However, in times of crisis, it always helps the Digital World."},{"name": "Slayerdramon","profile": "A Dragon Man Digimon with its body covered in Chrome Digizoid scale armor."},{"name": "Jupitermon","profile": "One of the Olympos XII. It governs the sky and weather. On the battlefield it distinguishes skillfully between good and evil and applies divine punishment to the evil ones."},{"name": "Evilmon","profile": "A Small Devil Digimon. It is tough and hates to lose. It doesn’t fight directly but instead teases its weak enemies in a mean and dirty way."},{"name": "Mephismon","profile": "A Digimon born from the residual thoughts of Apoclymon. It seeks revenge against Omegamon and wants to destroy any form of life. It has a developed intellect and careful tactics."},{"name": "Jupitermon","profile": "One of the Olympos XII. It governs the sky and weather. On the battlefield it distinguishes skillfully between good and evil and applies divine punishment to the evil ones."},{"name": "Jupitermon","profile": "One of the Olympos XII. It governs the sky and weather. On the battlefield it distinguishes skillfully between good and evil and applies divine punishment to the evil ones."},{"name": "Cherubimon (good)","profile": "An Angel Digimon in the shape of a beast. It is one of the Three Great Angels and sits in the highest position together with the Seraph Digimon Seraphimon."},{"name": "Wargreymon","profile": "A Digimon equipped with Dramon Killers on both its arms and the Brave Shield on its back. It is a veteran hero wearing armor made of Chrome Digizoid. It has a humanoid shape and is remarkably powerful and fast."},{"name": "Venomvamdemon","profile": "A Digimon evolved from Vamdemon with all its power unleashed. It has lost most of its intelligence and is only driven by the desire for destruction. Even Vamdemon itself hates becoming this ugly Digimon."},{"name": "Baihumon","profile": "One of the Four Holy Beasts. It protects the western region of the Digital World. It boasts the greatest power of the Four Holy Beasts. It is said that it has god-like power, but it is basically a neutral figure."},{"name": "Kingetemon","profile": "An Etemon Digimon that calls itself The King of Kings. Acting like an ultimate clown, it always has a sneer on its face and is dressed in a Monkey Costume with the ’Great King’ characters written on its chest."},{"name": "Monzaemon","profile": "A Digimon covered in mystery. It looks like a simple teddy bear, but there are several rumors as to who hides under the zipper on its back."},{"name": "Rosemon","profile": "A beautiful female Digimon called the queen of flowers. On its breast it wears a Tiferet, a jewel in which is engraved the symbol of love and beauty. This jewel promises eternal beauty."},{"name": "Magnakidmon","profile": "A Digimon who loves single combat. When it comes to important fights, it shoots bullets indescriminately and becomes very trigger happy."},{"name": "Avengekidmon","profile": "A Digimon born from a Digimon that was defeated by Magnakidmon. Overtaken by a ruthless desire for revenge, its digicore was overloaded by negative mind data, resulting in a sudden transformation."},{"name": "Aegiomon","profile": "This Digimon loves peace and doesn’t especially care for combat. However, it conceals many latent hidden powers, and when it fights to protect someone, its actual combat abilities are exceptional."},{"name": "Wargreymon","profile": "A Digimon equipped with Dramon Killers on both its arms and the Brave Shield on its back. It is a veteran hero wearing armor made of Chrome Digizoid. It has a humanoid shape and is remarkably powerful and fast."},{"name": "Metalgarurumon","profile": "A Digimon whose whole body is mechanized. It is the final form of Garurumon. It retains Garurumon’s speed despite the many heavy firearms attached to its body. It finds its enemies with the laser on the tip of its nose and swiftly shoots them down."},{"name": "Metalgreymon","profile": "A Digimon with over half of its body mechanized. It is said to have the power of a nuclear warhead. Only a Greymon who has won numerous battles can evolve to this stage."},{"name": "Weregarurumon","profile": "A commando-type Digimon that has the leg strength of Garurumon and skilled war tactics. Its jumping abilities are top tier. It has a strong sense of duty and serves its master and partners faithfully."},{"name": "Atlurkabuterimon","profile": "A Digimon discovered in the net area of the tropics. It is an evolved form of Kabuterimon. Its body is about 1.5 times that of Kabuterimon. It’s fighting skills have improved thanks to the muscles it developed, but its flying skills dropped."},{"name": "Belialvamdemon","profile": "A Digimon that lurks in the darkness of the human heart. It is the final form of Vamdemon. Unlike Venomvamdemon, it kept its intelligence. On its arms it has the parasitic living guns Sodom and Gomorrah."},{"name": "Mummymon","profile": "A Digimon also known as ’the Necromancer’ because it summons and manipulates the residual data of Digimon who have died before their time. It treats the bandages that wrap its body like individual creatures. It fights using its favorite gun, Obelisk."},{"name": "Archnemon","profile": "A queen Digimon that has the appearance of the spider queen from Greek legends. It governs over all Dokugumon. It is very intelligent and uses cunning tricks when attacking its prey. It can also take human shape."},{"name": "Wendimon","profile": "A Digimon who dark-evolved from a Lopmon consumed by hatred and anger. Deep down it has a kind heart, but it is hidden under a destructive impulse. It can manipulate time and space in its need to destroy."},{"name": "Holydramon","profile": "A Digimon seated on the highest cliff of the god beast Digimon. It is the master of the skies and has the power to invade anything. It is one of the Four Great Dragons. Legends predict its advent when the evil forces become too strong."},{"name": "Seraphimon","profile": "The highest of the Angel Digimon. It has ten golden wings on its back. It is the unifier of all Angel Digimon and the enforcer of divine law. It is said that it will descend for the final battle against evil."},{"name": "Dinobeemon","profile": "A Digimon who jogress-evolved from Stingmon and XV-mon. Its insect attributes are more pronounced now. It discovers its enemies with its compound eye and finishes them off with violent techniques."},{"name": "Shakkoumon","profile": "A Digimon who jogress-evolved from Ankylomon and Angemon. It is believed that it might be an ancient Angel Digimon. Its neck and torso can rotate 360 degrees and allow it to attack in all directions."},{"name": "Silphymon","profile": "A Digimon who jogress-evolved from Aquilamon and Tailmon. Its developed legs allow it to jump and glide easily. It captures its enemies with the radar on both its ears."},{"name": "Minotaurmon","profile": "A Digimon who doesn’t move very fast. It has very tough skin and barely feels anything from normal attacks. Its lethal skill is Darkside Quake, where it produces a great earthquake with its left ’Demon Arm’."},{"name": "Skullbaluchimon","profile": "A huge Undead Digimon. It was reproduced by adding data from fake fossils to the fossil data of what is thought to have been the largest terrestrial mammal."},{"name": "Titamon","profile": "A Digimon with the nickname ’One-Man Division’. Its strong body is possessed by limitless hatred. It runs through the battlefield in search of the Olympos XII, whom it wants dead."},{"name": "Digitamamon","profile": "A Digimon shaped like a Digitama, the beginning and end of all Digimon. It is covered in mystery, not participating in the processes of evolution or growth. Its shell repels all attacks."},{"name": "Fugamon","profile": "A subspecies of Orgemon. It has a red body and wears shorts with a tiger pattern. Its lethal skill is ’Evil Hurricane’."},{"name": "Saberleomon","profile": "An ancient Digimon that is said to be the ancestor of Leomon. It is a huge beast with overwhelmingly destructive claws, strong penetrative tusks, and legs that allow it to run at Mach speed."},{"name": "Dinotigermon","profile": "An Ancient Beast Digimon. It was born through the partial evolution of Saberleomon, whose body was fortified with metal."},{"name": "Lilimon","profile": "A Digimon that looks like a human but hides immeasurable power. It is impossible to control once it starts crying. It opens its heart only to humans with the same temperament as its own."},{"name": "Dinorexmon","profile": "A Carnivorous Dinosaur Digimon nicknamed ’the King of Terror’. Its strength stands completely apart from that of other Dinosaur Digimon. It fights with unparalleled ferocity."},{"name": "Jyureimon","profile": "A Digimon that is extremely intelligent and powerful. It is the higher evolution of Woodmon."},{"name": "Imperialdramon PM","profile": "A Digimon, originally Imperialdramon: Fightermode, who received the power of Omegamon. On its Omega Blade is engraved ’Reset’ in Digimon letters, as it resets all the data of the enemy Digimon it cuts."},{"name": "Zekegreymon","profile": "A Digimon who received the power to evolve from the legendary Digimon. It is now a Greymon who seeks perfect victory and the ability to fight any kind of enemy. Its body, covered in Gold Digizoid, has high defense and is very light."},{"name": "Victorygreymon","profile": "A subspecies of Wargreymon. This Digimon is a heroic dragon warrior carrying the crushing sword ’Dramon Breaker’. It developed its own fencing style that hits and smashes its enemies rather than cutting them."},{"name": "Metalgreymon","profile": "A reinforced battle form of Digimon, born through the DigiXros of Greymon and Mailbirdramon. With Greymon’s power and Mailbirdramon’s armor, it now has the strength to annihilate many enemies."},{"name": "Omegashoutmon","profile": "A Digimon born when the released burning soul of Shoutmon received the legendary ’Evolution’ from Omegamon. It is covered in Omega Force so godly bright that it movements are perceived only as an afterimage of light."},{"name": "Miragegaogamon","profile": "A Digimon with its whole body covered in Chrome Digizoid armor. It moves at such incredible speed that it tricks its enemies into believing it is just a mirage. It can also cut it enemies instantly using Gale Claws."},{"name": "Jewelbeemon","profile": "An Insect Digimon with a shiny iridescence like a jewel beetle. Its hard armor changes color depending on the angle from which you view it, like a prism. This also has the effect of dazzling the eyes of its enemies."},{"name": "Tyrantkabuterimon","profile": "The ’King of Bugs’. It is the leader of all Insect Digimon. Its den is the ’Under Forest’, deep underneath the dark forest. It is said it is only active at night."},{"name": "Flymon","profile": "An Insect Digimon with huge, evil wings which allow it to fly around at very high speeds. When it flies, it emits a howling noise that deafens the ones who hear it."},{"name": "Yammamon","profile": "An Insect Digimon possessing the data of the enormous Oniyamma. It is carnivorous, so it has a rather savage personality."},{"name": "Hououmon","profile": "The head of the bird Digimon. It has four shiny golden wings. It wears two Holy Rings and is said to govern all the Holy Bird Digimon. Its power is immeasurable."},{"name": "Garudamon","profile": "A Digimon that loves justice and nature. It is the guardian god of earth and wind. Only bird Digimon with high intelligence and fighting ability can evolve into Garudamon. It is a close friend of Leomon, who shares its vision."},{"name": "Metalmamemon","profile": "A Cyborg Digimon with the nickname ’Smiley Bomber’. It evolved from Mamemon and became even stronger."},{"name": "Chaosdramon","profile": "A Digimon born from a successful experiment where Mugendramon, a combination of parts from numerous Cyborg Digimon, uses its abilities beyond the limits."},{"name": "Metaltyranomon","profile": "A Cyborg Digimon who modified its body in order to become stronger. Just as Megadramon has superior aerial combat skills, Metaltyranomon has superior terrestrial combat skills."},{"name": "Stingmon","profile": "A very rare Insect Digimon that has the appearance of a human. It also has a hard exterior frame and the very swift moves of an insect."},{"name": "Shakkoumon","profile": "A Digimon who jogress-evolved from Armagemon and Angemon. It is believed that he might be an ancient Angel Digimon. His neck and torso can rotate 360 degrees and allow him to attack in all directions."},{"name": "Highandromon","profile": "An ultimate Cyborg Digimon who has reached the perfect form of the incomplete Andromon."},{"name": "Wargreymon","profile": "A Digimon equipped with Dramon Killers on both its arms and the Brave Shield on its back. It is a veteran hero wearing armor made of Chrome Digizoid. It has a humanoid shape and is remarkably powerful and fast."},{"name": "Aegiomon","profile": "This Digimon loves peace and doesn’t especially care for combat. However, it conceals many latent hidden powers, and when it fights to protect someone, its actual combat abilities are exceptional."},{"name": "Agumon & Wargreymon","profile": "The cheerful Agumon, who fears nothing and fights with its strong claws, joins forces with the veteran hero Wargreymon, dressed in its Chrome Digizoid armor."},{"name": "Fragment of Courage","profile": "Fragment used to evolve to Wargreymon. Can be found in specific Events."},{"name": "Grain of Courage","profile": "Grain used to evolve to Wargreymon. Can be found in specific Events."},{"name": "Crystal of Courage","profile": "Crystal used to evolve to a particular Wargreymon. Can be found in specific Events."},{"name": "Fragment of Friendship","profile": "Fragment used to evolve to Metalgarurumon. Can be found in specific Events."},{"name": "Grain of Friendship","profile": "Grain used to evolve to Metalgarurumon. Can be found in specific Events."},{"name": "Crystal of Friendship","profile": "Crystal used to evolve to a particular Metalgarurumon. Can be found in specific Events."},{"name": "Fragment of the Darkness King","profile": "Fragment used to evolve to Belialvamdemon. Can be found in specific Events."},{"name": "Grain of the Darkness King","profile": "Grain used to evolve to Belialvamdemon. Can be found in specific Events."},{"name": "Crystal of the Darkness King","profile": "Crystal used to evolve to a particular Belialvamdemon. Can be found in specific Events."},{"name": "Aegiochusmon","profile": "A Digimon based on Dragon-type data stored in its body, concentrated in the crystal in its chest. In this form, the data manifests on the surface of its body as armor."},{"name": "Titamon","profile": "A Digimon with the nickname ’One-Man Division’. Its strong body is possessed by limitless hatred. It runs through the battlefield in search of the Olympos XII, whom it wants dead."},{"name": "Fragment of Soul","profile": "Fragment used to evolve to Titamon. Can be found in specific Events."},{"name": "Grain of Soul","profile": "Grain used to evolve to Titamon. Can be found in specific Events."},{"name": "Soul of the Demon","profile": "Soul used to evolve to a particular Titamon. Can be found in specific Events."},{"name": "The Giant’s Helmet","profile": "Helmet used to evolve to Titamon. Can be found in specific Events."},{"name": "The Giant’s Armour","profile": "Armor used to evolve to Titamon. Can be found in specific Events."},{"name": "The Giant’s Sword","profile": "Sword used to evolve to Titamon. Can be found in specific Events."},{"name": "Dragon’s Knowledge","profile": "The heart of the wild fierce dragon. Can be found in specific Events."},{"name": "EXP Floppy Gold","profile": "Use it in Digifuse as a Material Digimon to get more XP for your Base Digimon."},{"name": "EXP Floppy Silver","profile": "Use it in Digifuse as a Material Digimon to get more XP for your Base Digimon."},{"name": "EXP Floppy Bronze","profile": "Use it in Digifuse as a Material Digimon to get more XP for your Base Digimon."},{"name": "Bit Ingot Gold","profile": "Sell it for 30000 Bits."},{"name": "Zekegreymon","profile": "A Digimon who received the power to evolve from the legendary Digimon. It is now a Greymon who seeks perfect victory and the ability to fight any kind of enemy. Its body, covered in Gold Digizoid, has high defense and is very light."},{"name": "Victorygreymon","profile": "A subspecies of Wargreymon. This Digimon is a heroic dragon warrior carrying the crushing sword ’Dramon Breaker’. It developed its own fencing style that hits and smashes its enemies rather than cutting them."},{"name": "Weregarurumon","profile": "A commando-type Digimon that has the leg strength of Garurumon and skilled war tactics. Its jumping abilities are top tier. It has a strong sense of duty and serves its master and partners faithfully."},{"name": "Garurumon","profile": "A Digimon covered with fur as hard as mithril. It is feared by other Digimon because it hunts its prey with a carnivore’s speed and very precise attacks."},{"name": "Victorygreymon","profile": "A subspecies of Wargreymon, a heroic dragon warrior carrying the crushing sword ’Dramon Breaker’. He developed his own fencing style and, rather than cutting his enemies, he hits and smashes them."},{"name": "Metalgreymon virus species","profile": "A Digimon who dark-evolved when Agumon was manipulated by the Evil Spiral. It is now a virus type and follows the orders of the Digimon Kaiser, attacking its partners."},{"name": "Blackwargreymon","profile": "A Dragon Warrior Digimon that earnestly pursues its own brand of justice. While its ’Brave Shield’ is missing its crest of Courage, it maintains the pride of a warrior, seeking always to understand why it has a soul."},{"name": "Marinangemon","profile": "A Fairy Digimon living in the Internet sea. It rarely shows itself to others. An Angemon in name only, it is a completely different species in terms of ecosystem."},{"name": "Kaiserleomon","profile": "A Digimon evolved through the beast spirit. It carries the power of the Ten Warriors of Darkness. Released from the curse of Cherubimon, it is covered in Obsidian Digizoid and is called ’the Jet-black Lion’."},{"name": "Darkknightmon","profile": "A Digimon combined through the vows of two blood-brothers. It is a first-level warrior that mixes their ingenuity and ability to take action. It uses any method to achieve its purpose."},{"name": "Lynxmon","profile": "A Beast Digimon in the shape of a lynx. It is covered in burning fur and inhabits the tropical jungles. It has a free spirit and is the exact opposite of Garurumon, who lives in cold areas."},{"name": "Gokumon","profile": "A fugitive Digimon born from the data on a list of wanted criminals."},{"name": "Nanomon","profile": "A Digimon originally used as a Vaccine for restoring the data of crashed computers. Its thought circuits were destroyed when it was attacked by a powerful Virus Digimon. It is now uncontrollable."},{"name": "Tuwarmon","profile": "A Ninja Digimon released from the Punpun Armor, which was restraining the abilities of Damemon. It deceives its enemies with its foolish appearance and chops them up using Mantis Arm."},{"name": "Drimogemon","profile": "A Digimon who can move swiftly underground using the huge drill on its nose. It is very rarely seen, as it spends most of its time deep underground."},{"name": "Chimairamon","profile": "A Digimon created by combining the biological parts of various other Digimon. It is driven by its battle instincts and is very strong in combat, but nobody knows how it was born or other details about its life."},{"name": "Mugendramon","profile": "A completely metal Digimon that was created by combining the parts of many cyborg Digimon. An evil program is written in its digicore and supplies it with infinite malice."},{"name": "Mugendramon","profile": "A completely metal Digimon that was created by combining the parts of many cyborg Digimon. An evil program is written in its digicore and supplies it with infinite malice."},{"name": "Millenniumon","profile": "An ultimate form synthetic Digimon born through the combination of the mechanized Mugendramon and the synthetic Chimairamon. It has the power to control time, and it is said it cannot be knocked down."},{"name": "Grankuwagamon","profile": "A dreadful Digimon called the devil of the deep forest. It is the final form of the Kuwagamon species. It lives in the depths of the forests and is fully nocturnal. Its eternal rival is Heraklekabuterimon."},{"name": "Cyberdramon","profile": "A mysterious Digimon covered in special rubber armor. It is the partner of the legendary tamers. It doesn’t belong to the Virus Busters, but it hunts viruses on its own."},{"name": "Airdramon","profile": "An intelligent Digimon that flies freely in the sky. They say that its existence is close to the gods, especially when it calls up storms with its cry. Its fierce personality makes it difficult for ordinary tamers to use."},{"name": "Kuwagamon","profile": "A Digimon of the same maturity as Kabuterimon, its eternal rival. It has well-developed battle instincts. It attacks its prey immediately and grasps it in its scissors."},{"name": "Oukuwamon","profile": "An aggressive Digimon evolved from Kuwagamon. Its scissors have grown even stronger, and its scouting skills have improved due to an enhanced sense of touch. Its defensive abilities, which were not very developed in Kuwagamon, improved as well."},{"name": "Karatenmon","profile": "A Demon Man Digimon with the appearance of a Shugenja and the face of a crow. It is a follower of the Daitengu Digimon."},{"name": "Breakdramon","profile": "A Digimon with abilities and powers that surpass those of other Machine Digimon. It has the ability to hack certain pieces of heavy construction equipment while they are evolving, capturing them."},{"name": "Bigmamemon","profile": "A boss variant of Mamemon. It has the nickname of ’Smiley Bomber’. It is also believed it might be an aggregate of Mamemon."},{"name": "Snimon","profile": "A Digimon made from the data of a mantis. It hunts down its target like a very precise machine."},{"name": "Pukumon","profile": "A British Punk Digimon, it was born from the mutation of a computer virus created by the greatest hacker in all of Britain."},{"name": "Metalpiranimon","profile": "A Digimon with a metal head, very sharp teeth, and very strong jaw. It can cut any armor into pieces."},{"name": "Grain of Synthetic Beast","profile": "Grain used to evolve to Chimairamon. Can be found in specific Events."},{"name": "Grain of Machine Dragon","profile": "Grain used to evolve to Mugendramon. Can be found in specific Events."},{"name": "Grain of Dimensions","profile": "Grain used to evolve to Millenniumon. Can be found in specific Events."},{"name": "Valdurmon","profile": "A rare Holy Bird Digimon living in the stratosphere at 40,000m above ground. It has 6 giant wings, the largest of which reach 30m when fully spread."},{"name": "Yatagaramon","profile": "A Digimon leading the chosen ones to the Golden Land in the eastern part of the Digital World. During this trip, it gives them a three-part trial, and only those who complete it can reach the Golden Land."},{"name": "Peckmon","profile": "A Bird Digimon with the ability to fly. It is actually faster when it runs with its strongly developed legs. Due to its high jumps and fast rotations, it can use its body like a shuriken to attack its enemies."},{"name": "Aquilamon","profile": "A Giant Bird Digimon called The Great Eagle of the Desert. It is always faithful to its master. It flies the sky at Mach speed, locates its prey using its sharp eyes, and charges its enemy using the horns on its head."},{"name": "Birdramon","profile": "A Digimon dressed in a blazing flame and born of a firewall. It flies freely within the network. Its specialty is air attacks."},{"name": "Ornismon","profile": "An Ancient Bird Digimon said to be extinct since ancient times. Called ’the Ruler of the Skies’, it attacks much larger Digimon from above."},{"name": "Cockatrimon","profile": "A Giant Bird Digimon who lived for so long on the ground that it became unable to fly. It attacks very ferociously using its developed body and legs as weapons, but it possesses very low energy efficiency."},{"name": "Saberdramon","profile": "A savage Digimon resembling Birdramon. It is covered in dark flames and attacks ferociously. It is said that its sharp claws are the origin of its name."},{"name": "Diatrymon","profile": "An Ancient Bird Digimon with very strong legs. It is called ’the Living Fossil’."},{"name": "Akatorimon","profile": "A Giant Bird Digimon living in the savanna. It is related to Cockatrimon. Just like Cockatrimon, it cannot fly."},{"name": "Deramon","profile": "A strange Digimon that looks like a Bird Digimon at first glance. It actually has a lush green plant growing on its back. It has plant attributes and cannot fly, similar to Kiwimon."},{"name": "Parrotmon","profile": "A strange bird that came from another Digital World through a crack in time and space. It has very strong foot claws and wears two Holy Rings on its arms."},{"name": "Hippogriffomon","profile": "A Mythical Beast Digimon in the shape of a synthetic beast. It is said it evolves into Griffomon, but further details are unknown."},{"name": "Kokabuterimon","profile": "An Insect Digimon that is small but very strong. It has a large horn and front legs. Although it is greatly feared, it doesn’t really like conflicts and has a mild personality."},{"name": "Ceresmon","profile": "A Digimon who forgot the gratitude owed to the forest and land. It now brings fear to the forests, harming trees and spoiling the land."},{"name": "Ceresmon Medium","profile": "A Digimon who forgot the gratitude owed to the forest and land. It now brings fear to the forests, harming trees and spoiling the land."},{"name": "Vegimon","profile": "An Insectivore Plant Digimon with long ivy and a mouth that can open very wide."},{"name": "Blossomon","profile": "A Plant Digimon in its Perfect form. It has the appearance of an enormous flower. Numerous tentacles grow from its body. Despite the grotesqueness of its appearance, its has a quiet personality and rarely shows itself in front of others."},{"name": "Grain of the Fertility God","profile": "Grain used to evolve to Ceresmon. Can be found in specific Events."},{"name": "Crystal of the Fertility God","profile": "Crystal used to evolve to a particular Ceresmon. Can be found in specific Events."},{"name": "Yorishiro’s Grain","profile": "Grain used to evolve to Ceresmon Medium. Can be found in specific Events."},{"name": "Yorishiro’s Crystal","profile": "Crystal used to evolve to a particular Ceresmon Medium. Can be found in specific Events."},{"name": "Matadrmon","profile": "A Digimon said to be born from the folk music database of a certain museum. It has mastered the unique steps for ’Bulldog’, a dance it arranged itself."},{"name": "Metalfantomon","profile": "A Digimon that receives its energy from a Digital World in another dimension. It is said this Digimon is manipulated by an unknown entity."},{"name": "Pharaohmon","profile": "A Digimon said to evolve from Mummy Digimon. It had absolute power and dominated many areas in the ancient Digital World."},{"name": "Matadrmon","profile": "A bloodsucking martial artist Digimon that performs a magnificent dance. It has mastered the unique steps for ’Bulldog’, a dance it arranged itself."},{"name": "Metalfantomon","profile": "A Digimon that receives its energy from a Digital World in another dimension. It is said this Digimon is manipulated by an unknown entity."},{"name": "Pharaohmon","profile": "A Digimon said to evolve from Mummy Digimon. It had absolute power and dominated many areas in the ancient Digital World."},{"name": "Sakuyamon (Miko)","profile": "The appearance of Sakuyamon when it performs religious rituals and asks the gods for divine guidance. It doesn’t fight very much in this form, but it has a stronger ability to remove evil spirits."},{"name": "Kuzuhamon","profile": "A God Man Digimon said to have lived a long time as a fox Digimon. It has changed over time and now has a human appearance."},{"name": "Slashangemon","profile": "A Power Digimon that commands the Angel corps ’Powers’ and leads all battles. When it comes to defending justice, it doesn’t fear even death."},{"name": "Karatenmon","profile": "A follower of Daitengu Digimon. It excels in shugendo. In its hands it holds the two swords ’Irataka no Ken’, in which magical powers are concentrated. It can read its opponent’s spirit and anticipate its moves."},{"name": "Wisemon","profile": "A Digimon using the ’Book’ as its spiritual dwelling. It can use it to change its appearance and show up anywhere in time and space. This is why it’s said its real body might actually exist in a different dimension."},{"name": "Gulfmon","profile": "A Demon Beast emerged from the abyss of the Dark Area. Embedded in the lower half of its body is a mouth able to swallow everything. It is said that the swallowed Digimon have their digicore crushed and fall to the Dark Area."},{"name": "Mephismon","profile": "A Digimon born from the residual thoughts of Apoclymon. It seeks revenge against Omegamon and wants to destroy any form of life. It has a developed intellect and careful tactics."},{"name": "Youkomon","profile": "A Bewitching Beast Digimon in the shape of a giant blue fox with nine tails. Unlike Kyubimon, it is feared as a Bewitching Beast that brings ruin and destruction."},{"name": "Asuramon","profile": "A Digimon from the ancient Indian civilization. It has four arms and three faces: anger, mercy, and blessing. It values justice, and its wrath strikes those that commit injustices. This is why it is also called the incarnation of the god of light."},{"name": "Kyubimon","profile": "A Digimon evolved from a very skilled and experienced Renamon. It is a bewitching fox. Although it is not very strong, it has a strong spirit and a variety of skills."},{"name": "Doumon","profile": "An onmyoji Digimon mastering the Onmyodo. It fights making full use of a variety of techniques. It is particularly strong in using magic, especially spells and talismans."},{"name": "Siesamon","profile": "A Digimon in the shape of a Shisa, the holy beast of Okinawa. It gathers its energy from the sun and protects its tamer from any disaster, exerting great power against the forces of evil."},{"name": "Picklemon","profile": "A Fairy Digimon mastering magic. It can recite a sophisticated programming language from another dimension to produce miracles similar to magic."},{"name": "Dracumon","profile": "A mischievous Digimon from the Dark Area. It spends all its energy playing pranks, even on the Four Holy Beasts. It is aiming for the Royal Knights as its next targets."},{"name": "Soulmon","profile": "A Digimon exactly like Bakemon, who incorporates magic data from fantasies, except its magic is enhanced by a black hat."},{"name": "Sangloupmon","profile": "A sublime blood-sucking wolf Digimon. It is a rather old species of Digimon, surviving from the Genesis era of the Digital World."},{"name": "Granddracumon","profile": "A Demon Beast Digimon, considered the king of vampire Digimon. It built a castle in the Dark Area that has been there since the old times. It is said that it is so strong that not even the Seven Great Demon Lords dare to meddle with it."},{"name": "Skullmammon","profile": "An Undead Digimon whose whole body was eaten by viruses and is now reduced to only a skeleton."},{"name": "Kaisergreymon","profile": "A transcendent species of Digimon that possesses fire powers and is said to surpass the power of even the legendary Ten Warriors."},{"name": "Wolfmon","profile": "A Digimon who evolved through the Human Spirit of Light, inheriting the power of the Ten Warriors of Light. It embodies the spirit of chivalry, and its body is covered in holy amethyst that gives it power if used with the right intentions."},{"name": "Ancientvolcamon","profile": "One of the legendary Ten Warriors said to have saved the ancient Digital World. It has the Earth attribute. Its power is matchless because it uses a volcano as its source. It specializes in attacks based on explosions."},{"name": "Musyamon","profile": "A Digimon evolved from a game’s samurai data infected with a virus. Its ghastly appearance is the proof of its survival in endless battle. It seeks a final battle with the brave Leomon."},{"name": "Panjyamon","profile": "A Digimon evolved from a part of Leomon. Leomon, who trains every day so it can defend justice, acquired the power of cold in the snowy arctic areas of the Digital World."},{"name": "Raptordramon","profile": "A Cyborg Digimon based on a wild predator Digimon so that it is certain to kill its target."},{"name": "Death-X-Dorugamon","profile": "An Undead Digimon born through an experiment that sought a higher evolution. It is said that, at the time of the experiment, it strikingly resembled the Adult form of the original ’Prototype Digimon’ of the ’Doru Series’."},{"name": "Death-X-Doruguremon","profile": "An Undead Digimon born through an experiment that sought a higher evolution. It is said that, at the time of the experiment, it strikingly resembled the Ultimate form of the original ’Prototype Digimon’ of the ’Doru Series’."},{"name": "Ginryumon","profile": "A Dragon Beast Digimon with its whole body covered in a robust Japanese style armor. Despite its appearance, it has a very light body and drifts gracefully through the air. It fights and parries its enemies’ attacks with its hard and slippery armor."},{"name": "Hisyaryumon","profile": "A Digimon usually as calm and intelligent as a god. However, when the crystal-like sphere it’s holding is damaged, its godly wrath is awakened and it attacks with all of its body and soul."},{"name": "Omekamon","profile": "A Puppet Digimon born from a computer’s data of design drawings. It itself doesn’t know who and what it is and, for now, acts like the ’Royal Knights’, the most famous Holy Knights Digimon."},{"name": "Whamon","profile": "A giant Digimon living in the depths of the Net Sea. It is rarely encountered since it has a quiet personality and lives in obscurity. It is sometimes seen in the waters near File Island."},{"name": "Tankdramon","profile": "A Machine Digimon and member of the mechanized ’D-brigade’, whose missions are riot, assault, and destruction. It is specialized in destroying multiple targets and boasts overwhelming firepower."},{"name": "Assaultmon","profile": "A Cyborg Digimon armed with various heavy weapons. Its combat power is increased by its Protect Suit. It is a member of Centalmon’s Special Forces."},{"name": "Cannondramon","profile": "A Cyborg Digimon equipped with a long-range cannon. It wears very hard armor and eliminates approaching enemies with one blow of its tail."},{"name": "Tankdramon","profile": "A Machine Digimon and member of the mechanized ’D-brigade’, whose missions are riot, assault, and destruction. It is specialized in destroying multiple targets and boasts overwhelming firepower."},{"name": "Assaultmon","profile": "A Cyborg Digimon armed with various heavy weapons. Its combat power is increased by its Protect Suit. It is a member of Centalmon’s Special Forces."},{"name": "Cannondramon","profile": "A Cyborg Digimon equipped with a long-range cannon. It wears very hard armor and eliminates approaching enemies with one blow of its tail."},{"name": "Commandramon","profile": "An infantry Digimon. Member of the mechanized ’D-brigade’."},{"name": "Sealsdramon","profile": "It is said only 1 Commandramon in 100 can pass the special screening test ’Selection-D’ and evolve to Sealsdramon."},{"name": "Tyranomon","profile": "A Digimon like an ancient dinosaur that existed in the prehistoric world. It sweeps everything down with its huge tail and the two arms it has developed. It is also intelligent and docile, making it easy to get attached to."},{"name": "Beelzebumon","profile": "An aloof Digimon with a powerful spirit. It has two double-barreled shotguns, the Berenjena. It is feared as one of the Seven Great Demon Lords and looks for battles with strong Digimon."},{"name": "Alphamon","profile": "One of the Royal Knights. It is also called ’the Aloof Hermit’. It wears a blue fluttering cloak, and its place is called ’the Empty Seat’."},{"name": "Grain of the Bullet Knights","profile": "Grain used to evolve to Tankdramon. Can be found in specific Events."},{"name": "Crystal of the Bullet Knights","profile": "Crystal used to evolve to a particular Tankdramon. Can be found in specific Events."},{"name": "Grain of the Iron Horse","profile": "Grain used to evolve to Assaultmon. Can be found in specific Events."},{"name": "Crystal of the Iron Horse","profile": "Crystal used to evolve to a particular Assaultmon. Can be found in specific Events."},{"name": "Grain of the Gun Dragon","profile": "Grain used to evolve to Cannondramon. Can be found in specific Events."},{"name": "Crystal of the Gun Dragon","profile": "Crystal used to evolve to a particular Cannondramon. Can be found in specific Events."},{"name": "Gankoomon","profile": "A Digimon that rarely remains in the same place. It travels around the Digital World with next-generation Huckmon, seeking out and quashing any indications of abnormality or chaos."},{"name": "Shutumon","profile": "A Digimon evolved through the Beast Spirit. It harbors the wind power of the Ten Warriors. It has a capricious and deceiving personality and never takes initiative in battle. It can control the wind using a secret Mesopotamian spell."},{"name": "Bancholeomon","profile": "A Digimon who wins while respecting its sense of justice and holding to its beliefs. It would face even the Three Great Angels or the Royal Knights to make its sense of justice understood."},{"name": "Boltmon","profile": "An experimental Cyborg Digimon who was made at the same time as Andromon. As evident from its appearance, it isn’t a machine like Andromon but is made of flesh and blood."},{"name": "Volcamon","profile": "A Cyborg Digimon with a large and powerful body. Its name comes from the volcano on its back, which explodes when its anger reaches its peak, or when its tension voltage exceeds maximum capacity."},{"name": "Kangarumon","profile": "A Digimon with incredibly powerful punches, kicks, and jumps. It moves swiftly to the bosom of its enemy and performs an uppercut, then jumps high and kicks hard."},{"name": "Volcdramon","profile": "A Volcano Dragon Digimon that inhabits the magma layer of the active volcanoes sprinkled in the Digital World."},{"name": "Valvemon","profile": "The largest Machine Digimon. Its purpose is to carry many Digimon at once, but Valvemon itself has enough power to drive back its enemies."},{"name": "Metallifekuwagamon","profile": "A Digimon with a human shape and grappling ability. With its hard shell and quick movements, it is one of the most well-balanced Perfect form Digimon."},{"name": "Bladekuwagamon","profile": "An Insect Machine Digimon whose whole body has turned into a dangerous weapon. It is a rare species whose body is made of Chrome Digizoid in Adult form."},{"name": "Fairimon","profile": "A Digimon evolved through the Human Spirit. It harbors the wind power of the Ten Warriors. It freely manipulates the air and can produce vacuums and mirages. It is also good at gathering information."},{"name": "Thunderballmon","profile": "A Digimon related to Mamemon. It stores electricity in its magnetized body. Its nickname is ’Generator Digimon’. It releases an electric shock of 10 million V to attacking enemies."},{"name": "Loaderliomon","profile": "A Machine Digimon born through the fusion of Beast Digimon data and the construction machine CAD data leaked from the server."},{"name": "Grappuleomon","profile": "A martial arts Digimon who has been enlightened to some original secrets. It received its fighting data from the veteran warrior Leomon. Its digicore moves the four turbines that stand for its limbs."},{"name": "Marsmon","profile": "One of the Olympos XII. It is a war hero who has mastered all martial arts, including dirty fighting. It excels at direct fights and mainly prefers to wrestle."},{"name": "Liamon","profile": "A Holy Beast Digimon who already has the air of a king despite only being an Adult form. It is said it evolved from Liollmon. However there are even fewer surviving Liamon than Liollmon, making it an ’illusion’ creature."},{"name": "Aegiochusmon Green","profile": "A Digimon based on Plant-type data stored in its body, concentrated in the crystal in its chest. In this form, the data is particularly entrenched in its upper body and arms."},{"name": "Knowledge of Nature","profile": "The spirit of the gently whispering trees is marked. Can be found in specific Events."},{"name": "Wargreymon","profile": "A Digimon equipped with Dramon Killers on both its arms and the Brave Shield on its back. It is a veteran hero wearing armor made of Chrome Digizoid. It has a humanoid shape and is remarkably powerful and fast."},{"name": "Metalgarurumon","profile": "A Digimon whose whole body is mechanized. It is the final form of Garurumon. It retains Garurumon’s speed despite the many heavy firearms attached to its body. It finds its enemies with the laser on the tip of its nose and swiftly shoots them down."},{"name": "Garudamon","profile": "A Digimon that loves justice and nature. It is the guardian god of earth and wind. Only bird Digimon with high intelligence and fighting ability can evolve into Garudamon. It is a close friend of Leomon, who shares its vision."},{"name": "Lilimon","profile": "A Digimon emerging from a beautiful blossoming flower. It has a tomboyish and whimsical character, but it is gentle and always lends a hand to the weak. A refreshing wind blows after it flies with its leaf wings."},{"name": "Zudomon","profile": "A materialistic Digimon that protects its honed body with leather and armor stolen from its enemies. It also possesses the Thor Hammer, a Chrome Digizoid weapon dug out of ancient ice, which produces violent shock waves when used."},{"name": "Ladydevimon","profile": "A female fallen angel Digimon that holds dark power of incomparable purity. It is impossible to control it using personal computers. Its enemy is Angewomon."},{"name": "Hangyomon","profile": "A Digimon that fast-travels in the Net waters using its wet suit and the high-speed water motor attached to its back. It pierces enemies entering its territory with its beloved harpoon ’Trent’."},{"name": "Pinochimon","profile": "A Puppet Digimon born from the cursed Jyureimon data. It is like a marionette but can also move by itself. It loves saying all kinds of lies."},{"name": "Angewomon","profile": "A beautiful and gentle Angel Digimon with eight pure white wings. It has the compassionate ability to heal its allies’ wounds, but it can also destroy evil enemies."},{"name": "Weregarurumon","profile": "A commando-type Digimon that has the leg strength of Garurumon and skilled war tactics. Its jumping abilities are top tier. It has a strong sense of duty and serves its master and partners faithfully."},{"name": "Venomvamdemon","profile": "A Digimon evolved from Vamdemon with all its power unleashed. It has lost most of its intelligence and is only driven by the desire for destruction. Even Vamdemon itself hates becoming this ugly Digimon."},{"name": "Piemon","profile": "A Digimon shrouded in mystery. No one knows how or why it was born. It possesses a strong and elusive power, so if you meet it you’ll have no choice but to resign yourself to your final moments."},{"name": "Apoclymon","profile": "A Dark Digimon born from negative human feelings, its appearance was foretold in ancient prophecies. It seeks to pull the Digital World into the dark world that spreads out infinitely."},{"name": "Venomvamdemon","profile": "A Digimon evolved from Vamdemon with all its power unleashed. It has lost most of its intelligence and is only driven by the desire for destruction. Even Vamdemon itself hates becoming this ugly Digimon."},{"name": "Piemon","profile": "A Digimon shrouded in mystery. No one knows how or why it was born. It possesses a strong and elusive power, so if you meet it you’ll have no choice but to resign yourself to your final moments."},{"name": "Apoclymon","profile": "A Dark Digimon born from negative human feelings, its appearance was foretold in ancient prophecies. It seeks to pull the Digital World into the dark world that spreads out infinitely."},{"name": "Black grain","profile": "Crystal used to evolve to a dark Digimon. Can be found in specific Events."},{"name": "Black crystal","profile": "Crystal used to evolve a particular dark Digimon. Can be found in specific Events."},{"name": "Anubimon","profile": "A Digimon who monitors the Dark Area, the place where Digimon are transferred who died naturally or fell in battle. Fallen Angel Digimon are also transferred there while still alive."},{"name": "Clavisangemon","profile": "An Angel Digimon guarding the ’Zenith Gate’ that separates the Digital World from the outside world."},{"name": "Arkadimon (Ultimate)","profile": "A Digimon who evolved to an Ultimate form by absorbing dark data. It can also achieve the Ultimate evolution through its tamer, and when not controlled by its tamer, it can transform into various other forms."},{"name": "Mistymon","profile": "A Digimon who has mastered many magical skills (advanced programming languages) and is also quite skilled at swordplay."},{"name": "Boogiemon","profile": "An eerie Demon Man Digimon with countless tattoos of incantations on its body. They say each one signifies a spell it can use."},{"name": "Darklizamon","profile": "An Evil Dragon Digimon with its whole body covered in a quietly burning dark flame. It is a virus evolved from Flarelizamon with a cool personality."},{"name": "Phelesmon","profile": "A Fallen Angel Digimon resembling a nobleman. It is said it grants people’s wishes, but in exchange it steals their souls."},{"name": "Flarelizamon","profile": "A Flame Dragon Digimon with its whole body covered in flames. Hot-blooded, it possesses a burning heart and the power of a dragon."},{"name": "Clockmon","profile": "A Digimon that manages all time and space within the computers on the Network. It can freely move back and forth in time, at least within the years 1900-1999."},{"name": "Mametyramon","profile": "A small Mutant Digimon feared as the ’Little Tyrant’. It is comprised of Tyranomon’s data condensed into a tiny body, and despite its appearance, Tyranomon’s ferocity and combat instincts are remarkably recognizable."},{"name": "Ex-tyranomon","profile": "A Puppet Digimon that sneaked its way inside a stuffed animal in the shape of Tyranomon."},{"name": "Igamon","profile": "A mysterious Digimon wearing a red mask. It wanders through the Digital World accumulating knowledge."},{"name": "Kougamon","profile": "A subspecies of Igamon. Unlike red Igamon, Kougamon is colored in purple."},{"name": "Cerberumon Werewolfmode","profile": "A Mutant of Cerberumon, called the ’Hell’s Watchdog’ of the Digital World."},{"name": "Fangmon","profile": "It is said to be the Digimon form of the wicked wolf who appears in all the fairy tales. Once it has selected his prey, it never lets it escape. Sometimes it even masquerades as a friend of its prey in order to get close to them."},{"name": "Werewolf’s grain","profile": "Grain used to evolve Cerberumon. Can be found in specific Events."},{"name": "Werewolf’s crystal","profile": "Crystal used to evolve Cerberumon. Can be found in specific Events."},{"name": "Light of God","profile": "Grain used to evolve Aegiochusmon. Can be found in specific Events."},{"name": "Raijinmon","profile": "A Cyborg Digimon with the name of ’Raijin’, the thunder god of Eastern mythology. It is very adept at close combat."},{"name": "Fujinmon","profile": "A Cyborg Digimon with the name of ’Fujin’, the wind god of Eastern mythology. A light fighter who uses airy movements, it is skilled at close combat."},{"name": "Suijinmon","profile": "A Machine Digimon made of parts of Mugendramon and Justimon."},{"name": "Rapidmon","profile": "A Cyborg Digimon evolved from Gargomon. It moves at close to the speed of light and controls a large ear-type radar. It always captures its prey, even in the darkness."},{"name": "Ebidramon","profile": "A maverick Dramon type of Digimon, it has a lobster’s hard shell and huge scissors. Those inclined to treat it lightly due to his looks are destined to become its prey and fall victim to the Dramon attack power."},{"name": "Shellmon","profile": "A Digimon resembling a hermit crab who dwells in the seas of the Internet. It lives in a shell adapted to the size of his body. As it grows bigger, it exchanges its shell for a larger one, eventually reaching the size of a small hill."},{"name": "Mantaraymon","profile": "A Digimon who appears quick and aggressive but is actually quite the opposite. It swims gracefully in the seas of the Internet and has a gentle personality."},{"name": "Rukamon","profile": "An Aquatic Mammal Digimon, it is the Digimon form of some peculiar signals that occurred during the study of interspecies communication."},{"name": "Anomalocarimon","profile": "A Digimon evolved through the capture of ancient organisms’ data, when a computer virus infected the data bank of the institute responsible for investigating and excavating ancient organisms."},{"name": "Scorpiomon","profile": "An Insect Digimon called the ’Assassin of the Desert’. Concealing its presence, it approaches its opponent from behind and pierces them with the deadly poison needle at the tip of its tail."},{"name": "Waspmon","profile": "A Digimon with highly developed reconnaissance skills using its head antennae. It constantly patrols the perimeter of its base, alert for enemies approaching it and immediately attacking any who get too close."},{"name": "Tobucatmon","profile": "A Puppet Digimon in the shape of a cat flying around the Internet seas."},{"name": "Valvemon","profile": "The largest Machine Digimon. Its purpose is to carry many Digimon at once, but Valvemon itself has enough power to drive back its enemies."},{"name": "Eldoradimon","profile": "A Mutant Digimon born when a Digimon became lost in the ancient ruins of abandoned computers and eventually fused with the research data stored there."},{"name": "Raidenmon","profile": "A heavyweight Machine Digimon equipped with electromagnetic firing weapons."},{"name": "Mechanorimon","profile": "A Powered Suit Digimon. It is run by a small Digimon inside it. A Digimon still under development, its digicore can cause overheating depending on the operating conditions."},{"name": "Blimpmon","profile": "The soft balloon-like section of this Digimon is covered by a metal coating, but apparently it is still under development, as the left half of its body is left bare."},{"name": "Solarmon","profile": "A rare species of Machine Digimon believed to be a mutant form of Hagurumon. The digicore inside of it generates heat, giving its body a very high temperature that burns when touched."},{"name": "Chaosdramon","profile": "A Digimon built to repel any attack and destroy anything it encounters. Its body is made of the imaginary metal ’Red Digizoid’, a Chrome Digizoid repurified and given enhanced firmness."},{"name": "Witchmon","profile": "A Digimon in the shape of a witch who came from Witchelny, a digital world from another dimension. It is always chasing its rival Wizarmon."},{"name": "Dogmon","profile": "A Puppet Digimon born from the database of an American TV cartoon. Its rubberlike body is strong and elastic enough to absorb any attack."},{"name": "Starmon","profile": "A space warrior with a burning fighting spirit. The scars on its muffler are testament to its fierce battle history. Hot-blooded, this Digimon dashes like a meteor onto the battlefield in order to fight for justice."},{"name": "Petermon","profile": "An eternal-boy Digimon who soars freely through the sky. It invites all Digimon who refuse evolution into the children’s world, Never-Everland. It masterfully wields its knife to punish all those who break their promises."},{"name": "Redvegimon","profile": "An enhanced version of Vegimon with its entire body ripened into red. Unlike the immature Vegimon, it has strong attack power and high intelligence."},{"name": "Captainhookmon","profile": "The captain of a pirate ship that sails the Digital World. A skilled survivalist, it has a strong sense of responsibility towards its subordinates, and in turn inspires their devotion. It has the personality of a gentleman and effortlessly pursues success on both sea and land."},{"name": "Superstarmon","profile": "A Digimon evolved when Starmon, the space warrior who adores Leomon, finally became a star. It hides behind sunglasses, but its identity is transparently obvious."},{"name": "Darksuperstarmon","profile": "A Digimon tainted with darkness who was born from the observation data of a black hole. Its past is apparently so weighty that it must shut out all light with its sunglasses and abandon all its hopes and dreams."},{"name": "Pumpmon","profile": "An upbeat Digimon born on Halloween through the variation of a virus. It has a calm personality and avoids initiating hostilities, but its appearance belies its formidable abilities."},{"name": "Mermaimon","profile": "A Digimon in the shape of a legendary mermaid that lives in the icy seas of the Digital World."},{"name": "Jyagamon","profile": "A Mimetic Digimon that uses its potatolike shape to hide from its enemies. It has a timid personality and doesn’t like to fight very much, but when pressed, it in fact sports extremely high combat abilities."},{"name": "Lampmon","profile": "A Digimon possessing strong magical powers that can change its body and appearance in a kaleidoscopic manner. It’s also known to create palaces and enormous gold and silver treasures."},{"name": "Tinkermon","profile": "A Digimon who accompanies Petermon and fights to achieve Petermon’s dream. Its brilliant wings are a barometer of its mood, shining brightly when it is in high spirits. Together with Petermon, it performs ’Petermon Syndrome’."},{"name": "Tyumon","profile": "A close friend of Scumon, it acts as the brains of the duo. The two of them act in concert to spread false wisdom. A natural coward, this Digimon quickly runs away when left by itself."},{"name": "Gottsumon","profile": "A cheerful and naughty Digimon like a living ball of energy. Its body is made of hard ore that changes its properties depending on the location and circumstances of its birth, giving it unlimited possibilities for evolution."},{"name": "Tsukaimon","profile": "A Mammal Digimon with large distinctive ears. While it is considered a subspecies of Patamon, its quarrelsome personality is the exact opposite of Patamon’s. It normally acts as Devimon’s messenger."},{"name": "Pumpmon","profile": "An upbeat Digimon born on Halloween through the variation of a virus. It has a calm personality and avoids initiating hostilities, but its appearance belies its formidable abilities."},{"name": "Bit Ingot Bronze","profile": "Sell it for 5000 Bits."},{"name": "Bit Ingot Silver","profile": "Sell it for 10000 Bits."},{"name": "Bit Ingot Platinum","profile": "Sell it for 100000 Bits."},{"name": "Numemon","profile": "A Digimon with no attack power or intelligence, it prefers dark, dank environments. If raised incorrectly, it’s liable to turn into a Numemon, but they say it actually conceals a hidden secret..."},{"name": "Karatukinumemon","profile": "A subspecies of Numemon born when a Numemon entered a shell and became a snail."},{"name": "Gold Numemon","profile": "A subspecies of Numemon with a golden body. It was born when a Numemon discovered Goldine mine and incorporated elements from it."},{"name": "Platinum Numemon","profile": "An extremely rare subspecies of Numemon. It was born when a Numemon was the first in the Digital World to discover Platina Mine, evolving and incorporating elements from the mine."},{"name": "Paildramon","profile": "A Digimon who jogress-evolved from XV-mon and Stingmon. Although it has the skilled attacks of dragons and the defensive ability of insects, the dragon attributes are a little stronger. It is very loyal and always protects its master."},{"name": "Tonosamagekomon","profile": "A Digimon that plays its main theme through the two horns on its shoulders. The tone of its voice, several octaves lower than Gekomon’s, imparts a feeling of Tonosama’s grandeur."},{"name": "Seadramon","profile": "An Aquatic Digimon with a long body, like a big snake. It uses this long body and coils tightly around its enemy until it stops breathing."},{"name": "Snimon","profile": "An experimental Digimon created in the institute to be a virus hunter, using data from a praying mantis. It detects its enemies through the red sensors on its head and hunts them down with machinelike precision."},{"name": "Octmon","profile": "A Digimon discovered in a virus experimentally made by a hacker. A collecting maniac, it stores data and digital treasures in his body. It lives in symbiosis with Fujitsumon, a parasite that appeared in a jar."},{"name": "Hanumon","profile": "A Mythical Digimon reported to have been sighted in Central Asia. Its body covered in golden fur, it stands on something resembling a cloud, moving around the Network and fighting off viruses."},{"name": "Gorimon","profile": "A Power Digimon with strong arms that can break anything and powerful legs that can crush all in its path."},{"name": "Coelamon","profile": "A Digimon discovered in the Network seas. It has an extremely primitive body structure and rudimentary fins for limbs."},{"name": "Diablomon","profile": "A greedy Digimon that swelled to huge proportions by absorbing any and all data in the Network. It aims to take over military computers and destroy the Real World in a nuclear attack."},{"name": "Infermon","profile": "An atrocious Digimon capable of invading any network and destroying its data. Its defense is remarkably improved thanks to the limbs attached to its cocoon body."},{"name": "Darcmon","profile": "A junior Angel Digimon with two pairs of wings, it serves as the vanguard of the Angel Digimon. Fighting always at the front lines, it has been nicknamed the ’Goddess of the Battlefield’."},{"name": "Qinglongmon","profile": "One of the legendary Four Great Dragons, its wields thunder with godlike powers and presence. Unbound by the shackles of black-and-white thinking, it serves as a guide to Digimon faced with tough choices."},{"name": "Orochimon","profile": "An eight-headed Digimon. While its primary head in the center is black, the rest of its heads are camouflage. It was born in the ancient Digital World with the purpose of preserving harmony."},{"name": "Megadramon","profile": "A Virus Dark Dragon Digimon. It was upgraded to be able to destroy a network by itself. It invades the computer network, destroys the host computers, and modifies them easily."},{"name": "Blackmegalogrowmon","profile": "A Digimon that exemplifies the destructive nature of viruses, it is called the Black Destroyer Dragon. Its upper body is covered in Chrome Digizoid. Able to fly, it has outstandingly high attack and defense skills."},{"name": "Gargomon","profile": "Originally a Devil Digimon, it constrained its power with suppression instruments, and is now sometimes used by Angel Digimon as a servant."},{"name": "Strikedramon","profile": "A Digimon that retains some features of Monodramon, like the horn extending to the back of its head. However, it looks like a totally different species, as it has transformed into Commander Mode and wears a Metal Plate."},{"name": "Seahomon","profile": "A Digimon with a small body owing to the fact that it lives in areas of high water pressure. However, when it comes to seas with shallower waters, its body is said to grow even larger than Seadramon’s."},{"name": "Megaseadramon","profile": "A Digimon with an enlarged head, hard armor, and a blade in the shape of a lightning bolt. It also has a high level of intelligence and a very cautious personality, following its enemies until it brings them down."},{"name": "Gigaseadramon","profile": "A Digimon whose lethal attacks include the ’Giga Sea Destroyer’ torpedo launched from the cannon in its mouth and ’Sky Wave’ antiaircraft energy shots sprayed in immense number from the opening in its back."},{"name": "Megidramon","profile": "Although this Digimon is one of the Four Great Dragons, it was initially evil, and its very existence was regarded as a digital hazard. This power has been sealed, but if it were released, it could result in catastrophic damage."},{"name": "Goddramon","profile": "A Holy dragon Digimon with a shining, golden body. It is one of the Four Great Dragons. It is small and wears in its right hand Umon the Blue Thunder, a weapon of regeneration, and in its left hand Amon the Red Flame, a weapon of destruction."},{"name": "Holydramon","profile": "A Digimon seated on the highest cliff of the god beast Digimon. It is the master of the skies and has the power to invade anything. It is one of the Four Great Dragons. Legends predict its advent when the evil forces become too strong."},{"name": "Deltamon","profile": "Originally, it consisted of several separate Digimon. However, when a computer went wild during a powerful electromagnetic storm, a bug occurred that fused them all together."},{"name": "Babamon","profile": "Rumor has it that this Digimon resulted when a curse was cast upon a Rosemon."},{"name": "Leviamon","profile": "One of the Seven Great Demon Lords sleeping in the abyss of the Digital World. It has a huge body and is called the Devil Beast due to its very large jaw."},{"name": "Kyukimon","profile": "A Bewitching Beast Digimon that looks like a kamaitachi. Its whole body is like a sharp blade that indiscriminately cuts everything in its vicinity."},{"name": "Dinohumon","profile": "A Dragon Man Digimon gifted with fighting skills. It lives in unexplored territory and hunts down its enemies with its sword, Akinakes."},{"name": "Gesomon","profile": "A Digimon feared as the ’White Devil of the Deep Seas’. It is very intelligent and does no harm to Digimon outside of its territory."},{"name": "Devitamamon","profile": "A Digimon that treats everything it sees and touches as an object of its hatred. It chants magic in a lost, ancient high-level programming language."},{"name": "Manbomon","profile": "An Armor-body Mutant Digimon that evolved through the power of the ’Digimental of Light’. Highly rare, it is scarcely seen in the Network seas."},{"name": "Jijimon","profile": "An elder Digimon that has survived since the very creation of the Digital World. It is said that, when crisis threatened the Digital World, this elder guided the chosen humans."},{"name": "Pajiramon","profile": "One of the ’Deva Digimon’, this one is a Perfect form in the shape of a sheep. It is under the command of Zhuqiaomon, one of the Four Holy Beasts, and dominates the world of dreams with its great influence."},{"name": "Cockatrimon","profile": "A Giant Bird Digimon who lived for so long on the ground that it became unable to fly. It attacks very ferociously using its developed body and legs as weapons, but it possesses very low energy efficiency."},{"name": "Daipenmon","profile": "A Digimon that inherited the full powers of the legendary Ten Warriors. With the addition of mysterious unknown powers, its skill with ice surpasses even that told in the legends."},{"name": "Vikaralamon","profile": "One of the ’Deva Digimon’, this one is a Perfect form in the shape of a boar."},{"name": "Aegiomon","profile": "This Digimon loves peace and doesn’t especially care for combat. However, it conceals many latent hidden powers, and when it fights to protect someone, its actual combat abilities are exceptional."},{"name": "Magnagarurumon","profile": "A transcendent-species Digimon and user of light-based abilities. It is said its power surpasses that of the legendary Ten Warriors. A master of high-speed travel, when it’s equipped with its flight unit, it can fly at close to the speed of light."},{"name": "Surfimon","profile": "An enhanced version of an aquatic Digimon, this one can move quickly on land as well. A maverick, it is very proud and has a distaste for acting in groups as fish normally do."},{"name": "Aerovdramon","profile": "A legendary Digimon. It evolved after many battles from V-dramon, a rare species. It now has stronger fighting skills due to its flying ability, its hard skin, and its sharp claws and horns."},{"name": "Rinkmon","profile": "A Cyborg Digimon born from the sample data of an experiment that accelerated particles to the speed of light in a particle accelerator."},{"name": "Hyougamon","profile": "A species of Ogremon that lives in cold places. It is highly protective of its territory and angrily attacks any Digimon who dare take one step into it."},{"name": "Moosemon","profile": "A Digimon respected as the ’Protecting God of the Mountain’. All who would sully its mountain are fated to lose their lives at its hands."},{"name": "Ranamon","profile": "A Digimon that used to be primarily active in the oceanic part of the weather forecast system, which might account for its sharp intuition and oft-changing emotions."},{"name": "Calamaramon","profile": "A half-beast-half-human Digimon, it uses his tentacles for both attack and defense, spinning them to attack its enemies or retracting them to protect its body."},{"name": "Gryzmon","profile": "A Digimon that can easily avoid and parry enemy attacks, despite the size of its body. With its outstanding intuition for combat, it doesn’t have to rely solely on its offensive capabilities."},{"name": "Marindevimon","profile": "A subspecies of Digimon. It is full of hatred because it lives alone in the deep sea. Its two tentacles have their own will and are free to attack on their own."},{"name": "Raremon","profile": "An Undead Digimon whose muscles rotted and fell off all over its body. It has attempted to cling to life by mechanizing its body, but it remains highly unstable, and the data that mechanized it has begun to collapse."},{"name": "Kaisergreymon","profile": "A transcendent species of Digimon that possesses fire powers and is said to surpass the power of even the legendary Ten Warriors."},{"name": "Phelesmon","profile": "A Fallen Angel Digimon resembling a nobleman. It is said it grants people’s wishes, but in exchange it steals their souls."},{"name": "Flawizarmon","profile": "A Demon Man Digimon that Armor-evolved through the Digimental of Courage. While Wizarmon is shy and hesitant to show its face, FlaWizarmon is the total opposite, confidently showing its true face for all to see."},{"name": "Cho Hakkaimon","profile": "It was once an Angel Digimon, but it was transformed by Ofanimon into its current form and banished from heaven for committing a crime. It has a lighthearted personality, but it turns ferocious when it’s hungry."},{"name": "Qinglongmon","profile": "One of the legendary Four Great Dragons, its wields thunder with godlike powers and presence. Unbound by the shackles of black-and-white thinking, it serves as a guide to Digimon faced with tough choices."},{"name": "Dynasmon","profile": "One of the Royal Knights, it pledges absolute loyalty to the lord who values justice as much as it does. It has the capabilities of a flying dragon and boasts unmatchable strength in its Chrome Digizoid dragon armor."},{"name": "Ulforcevdramon","profile": "A Digimon that can freely manipulate the holy Ulforce and has the power to reconstruct digital data. It is the sacred knight predicted in the legends. It wears armor made of Blue Digizoid and has godly speed."},{"name": "XV-mon","profile": "A Digimon evolved from a V-mon that came into its inherent powers. With the enhanced attack power of its highly-developed limbs, it can reduce rocks the size of mountains into dust. One of its derived species is V-dramon."},{"name": "Mikemon","profile": "A Beast Digimon that resembles a tortoiseshell cat at first glance. It is said that Nyaromon’s data, which lay dormant inside its body in the child form, has now manifested itself in the adult form."},{"name": "Digmon","profile": "A Digimon that Armor-evolved from Armadimon through the Digimental of Knowledge. It has the attribute of earth. Skilled in the use of the drills on its nose and arms, it specializes in underground combat."},{"name": "Sabmarimon","profile": "A Digimon that Armor-evolved from Seahomon through the Digimental of Sincerity. It has the attribute of water. When it’s underwater, it commands full freedom of movement, with performance surpassing that of normal aquatic Digimon."},{"name": "Thunderbirmon","profile": "A Digimon that Armor-evolved through the Digimental of Friendship. Capable of summoning thunderclouds with its booming voice, it wields lightning via the horn on its head. Its temper is as wild as a thunderstorm."},{"name": "Mihiramon","profile": "A Digimon that fiercely hunts down all its enemies. When on land, it runs faster than the wind, and when it takes to the air using its dual wings, it can break the speed of sound."},{"name": "Majiramon","profile": "A Digimon under the command of Qinglongmon, one of the Four Holy Beasts. It has a mercenary attitude, refusing to lift a finger unless there is profit to be had in it."},{"name": "Tyilinmon","profile": "A Digimon who, though it has been in its Perfect form since the genesis of the Digital World, is said to hold the same power as an Ultimate form. It has a very merciful personality, but it severely punishes those who kill unjustly."},{"name": "Blackwargreymon","profile": "A Dragon Warrior Digimon that earnestly pursues its own brand of justice. While its ’Brave Shield’ is missing its crest of Courage, it maintains the pride of a warrior, seeking always to understand why it has a soul."},{"name": "Blackmegalogrowmon","profile": "A Digimon that exemplifies the destructive nature of viruses, it is called the Black Destroyer Dragon. Its upper body is covered in Chrome Digizoid. Able to fly, it has outstandingly high attack and defense skills."},{"name": "Blackseraphimon","profile": "A hybrid Digimon that stole its data from Seraphimon and Mercuremon. It has ten bat wings and wields power directed toward evil. It also has Mercuremon’s tricks."},{"name": "Ginkakumon","profile": "One of the two ’Demon Gold and Silver Brothers’, together with its sister Kinkakumon. Ginkakumon loves Kinkakumon very much, always quietly keeping an eye on its sister and carrying alcohol for it. It knows no greater happiness than when its sister climbs aboard its abdomen."},{"name": "Arkadimon (child)","profile": "An Artificial Digimon created based on data from various Demon Digimon, with the purpose of generating a Super-ultimate form. It evolves by absorbing the data of other Digimon."},{"name": "Lucemon","profile": "A great Angel Digimon that stopped a war and brought peace to the ancient Digital World. Its talents were inherited by the Three Great Angels."},{"name": "Funbeemon","profile": "An Insect Digimon that belongs to the mysterious clandestine air base ’Royal Base’. Although its life is different from other Insect Digimon, it is strong, hardworking, and has a positive personality."},{"name": "Swimmon","profile": "A Tropical Fish Digimon with a vividly colored body. It lives in a coral reef in the warm waters just below the equator."},{"name": "Ravmon","profile": "A Digimon that used to be called the ’Silver Raven’ in the Genesis era until god’s wrath dyed one of its wings black. It is stealthy and kills its enemies with its remaining white Digizoid wing."},{"name": "Warumonzaemon","profile": "A Digimon that looks like Monzaemon. However, its atrocity makes it completely different. Its left arm is equipped with ’Bear Claw’. It gets along well with Metaletemon, to whom it offered a stuffed Warumonzaemon as a present."},{"name": "Monzaemon","profile": "A Digimon covered in mystery. It looks like a simple teddy bear, but there are several rumors as to who hides under the zipper on its back."},{"name": "Knightchessmon (white)","profile": "A Digimon throwing master who shoots huge darts. It is weak in close combat, but it confuses its enemies by leaping high above them using its thoroughbred leg strength."},{"name": "Knightchessmon (black)","profile": "A Digimon throwing master who shoots huge darts. It is weak in close combat, but it confuses its enemies by leaping high above them using its thoroughbred leg strength."},{"name": "Grandgeneramon","profile": "A Digimon formed through the forced Digicross of seven strong Digimon without any compression. It has no mind or ego and performs the lethal skills of its seven origin Digimon against whoever appears in its sight."},{"name": "Chackmon","profile": "A Digimon evolved through the Human Spirit. It harbors the ice power of the Ten Warriors. Although it pretends to belong to the noble class, it possesses a wealth of survival knowledge and precise skill with launcher technology."},{"name": "Parasimon","profile": "A special kind of Digimon: although it is an Ultimate form, it must parasitically live off of another creature in order to survive. By itself, it is rather weak, but when attached to a host Digimon, it can push its host’s abilities to their limits."},{"name": "Dorbickmon","profile": "A Fire Corps General Digimon. It leads the Dragon Digimon and fights with its rich combat experience. It likes stoking the flames of destruction with its overwhelming force and starts battles in peaceful areas."},{"name": "Lighdramon","profile": "A Digimon who armor-evolved from V-mon using the Digimental of Friendship. It possesses the attribute of thunder and attacks its enemies with a lightning-quick electric shock."},{"name": "Rizegreymon","profile": "A Digimon with over half of its body mechanized. It also learned how to fly. It flies freely in the sky with its huge body and attacks using the Chrome Digizoid revolver in its left hand."},{"name": "Aegiochusmon Blue","profile": "A Digimon based on Cyborg-type data stored in its body, concentrated in the crystal in its chest. In this form, the data is particularly focused in the upper left of its body."},{"name": "Knowledge of the Steel Knights","profile": "Here is marked the heart of samurai standing solemnly. Can be found in specific Events."},{"name": "Insekimon","profile": "A rare Mineral Digimon formed by mixing meteor fragments into Gottsumon’s mineral body. These fragments then appeared on the surface."},{"name": "Mercurymon","profile": "One of the Olympos XII. It is a witty god and the fastest of all Digimon. It cannot remain in one place, wandering the Digital World at a speed that cannot be captured by the naked eye."},{"name": "Kinkakumon","profile": "A Digimon who is considered with its brother Ginkakumon to be ’the Demon Gold and Silver Brothers’. A naturally reckless character, it rushes into love affairs and falls in love easily, but beats down anyone not in its favor."},{"name": "Bearmon","profile": "A Digimon with a timid personality. It is very gentle and quickly befriends other Digimon. In battle it displays incredible fighting ability and uses its fist protected by a leather belt."},{"name": "Darktyranomon","profile": "A Digimon originally belonging to the Tyranomon species. It was infected by an evil computer virus. The data that constitutes its body developed a bug that transformed it into a violent Digimon."},{"name": "Tyrantkabuterimon","profile": "The ’King of Bugs’. It is the leader of all Insect Digimon. Its den is the ’Under Forest’, deep underneath the dark forest. It is said it is only active at night."},{"name": "Yukiagumon","profile": "A type of Agumon that lives in cold areas. It is naughty and frolics all the time. It excels at hiding in the snow and attacking when the enemy is vulnerable"},{"name": "Yukidarumon","profile": "An Icy Snow Digimon whose whole body is covered in crystals of snow and ice. Despite its cold appearance, it possesses a very warm and gentle personality."},{"name": "Craniummon","profile": "The most respectful Digimon of the Royal Knights. It pays respect even to its enemies during combat. It holds the legendary magic spear Claiomh Solais and the sturdy shield Avalon."},{"name": "Shinegreymon","profile": "A Light Dragon Digimon that stores the burning energy of the Sun and uses it in battle. No matter how many times it falls, it always gets back up due to its strong spirit. It can summon the Geogrey Sword, in which the power of the earth is concentrated."},{"name": "Breakdramon","profile": "A Digimon with abilities and powers that surpass those of other Machine Digimon. It has the ability to hack certain pieces of heavy construction equipment while they are evolving, capturing them."},{"name": "Miragegaogamon","profile": "A Beast Knight Digimon with its whole body covered in Chrome Digizoid armor. It moves at such incredible speed that it tricks its enemies into believing it is just a mirage. It can also cut it enemies instantly using Gale Claws."},{"name": "Deathmon","profile": "A Digimon who was originally a high-level Angel Digimon. It fell to the Dark Area and is now one of the Demon Lords."},{"name": "Vademon","profile": "An Alien Digimon that looks like it has come from the farthest reaches of the universe. However, there are rumors that it was born from a plant’s fruit."},{"name": "Devidramon","profile": "An Evil Beast Digimon called from the Dark Area by Devimon. It was born from a hacker who misused the network. It freezes its enemies by staring at them with its four glowing red eyes."},{"name": "Dynasmon","profile": "One of the Royal Knights, it pledges absolute loyalty to the lord who values justice as much as it does. It has the capabilities of a flying dragon and boasts unmatchable strength in its Chrome Digizoid dragon armor."},{"name": "Magnamon","profile": "A Digimon who armor-evolved through the Digimental of Miracles. Dressed in Chrome Digizoid armor, its power is comparable to that of an ultimate form. In times of crisis, it can escape using the power of miracles."},{"name": "Indaramon","profile": "One of the ’Deva’ Digimon. It is a perfect form Digimon that looks like a horse. It is under the control of Zhuqiaomon, one of the Four Holy Beasts. It has a very arrogant and snobbish personality."},{"name": "Kyubimon","profile": "A Digimon evolved from a very skilled and experienced Renamon. It is a bewitching fox. Although it is not very strong, it has a strong spirit and a variety of skills."},{"name": "Sandiramon","profile": "One of the ’Deva’ Digimon. It is a perfect form Digimon that looks like a snake. It is under the control of Zhuqiaomon, one of the Four Holy Beasts. It is the cruelest and most cunning of the Deva Digimon."},{"name": "Zhuqiaomon","profile": "A legendary Digimon protecting the southern region of the Digital World. One of the Four Holy Beasts, it has a wild temper and is hostile towards human interference to the Digital World."},{"name": "Dukemon: Crimsonmode","profile": "A Digimon covered in crimson armor. It was born when Dukemon released all its hidden power. It has wings produced by overflowing energy. It holds the divine lance ’Gungnir’ and the divine sword ’Blutgang’."},{"name": "Lilithmon","profile": "A Digimon that was originally a high-ranking Angel Digimon. It fell to the dark side and is now called ’The Goddess of Darkness’. It is one of the Seven Great Demon Lords. Anything touched by the nails of its left hand will corrode."},{"name": "Goddramon","profile": "A Holy dragon Digimon with a shining, golden body. It is one of the Four Great Dragons. It is small and wears in its right hand Umon the Blue Thunder, a weapon of regeneration, and in its left hand Amon the Red Flame, a weapon of destruction."},{"name": "Parasimon","profile": "A special kind of Digimon: although it is an Ultimate form, it must parasitically live off of another creature in order to survive. By itself, it is rather weak, but when attached to a host Digimon, it can push its host’s abilities to their limits."},{"name": "Dynasmon","profile": "One of the Royal Knights, it pledges absolute loyalty to the lord who values justice as much as it does. It has the capabilities of a flying dragon and boasts unmatchable strength in its Chrome Digizoid dragon armor."},{"name": "Dukemon","profile": "A Digimon born from Megidramon. Its name is also linked to the Royal Knights. Its weapons, Gram and Aegis, form from its armor, which is made completely of Chrome Digizoid."},{"name": "Duftmon","profile": "A Digimon regarded by the Royal Knights as one of the best strategists. It has the skill to lead the Royal Knights. When it gets to the battlefield itself, it changes to Leopardmode."},{"name": "Apoclymon","profile": "A Dark Digimon born from negative human feelings, its appearance was foretold in ancient prophecies. It seeks to pull the Digital World into the dark world that spreads out infinitely."},{"name": "Darcmon","profile": "A junior Angel Digimon with two pairs of wings, it serves as the vanguard of the Angel Digimon. Fighting always at the front lines, it has been nicknamed the ’Goddess of the Battlefield’."},{"name": "Plutomon","profile": "A Digimon with several mouths lined with sharp teeth. It finds joy only in biting villains. Its mouths make chattering noises in search of prey."},{"name": "Griffomon","profile": "A Synthetic Digimon with a Beast’s torso and a Bird’s head, wings, and legs. There is something like a snake attached to his tail."},{"name": "Hippogriffomon","profile": "A Mythical Beast Digimon in the shape of a synthetic beast. It is said it evolves into Griffomon, but further details are unknown."},{"name": "Unimon","profile": "A synthetic Digimon with a unicorn’s horn and a pegasus’ wings. Its wings help it fly freely within the network, and its sharp horn helps it fight its enemies. It has a very wild temper."},{"name": "Susanoomon","profile": "A god from Eastern folklore. It is the strongest destruction god and is said to descend to the network system only in extraordinary situations. One part of it is responsible for regeneration and creates a new system after everything has been destroyed."},{"name": "Kaiserleomon","profile": "A Digimon evolved through the beast spirit. It carries the power of the Ten Warriors of Darkness. Released from the curse of Cherubimon, it is covered in Obsidian Digizoid and is called ’the Jet-black Lion’."},{"name": "Bolgmon","profile": "A Digimon evolved through the thunder Beast Spirit. It has a very cautious personality since it is born from the security system that protects the deepest part of a pyramid. It has thick armor and cannot move very fast, so it needs somebody to protect its back."},{"name": "Lucemon","profile": "A great Angel Digimon that stopped a war and brought peace to the ancient Digital World. Its talents were inherited by the Three Great Angels."},{"name": "Lucemon Falldownmode","profile": "The strongest of the Seven Great Demon Lords. It combines magic and holiness. It rebelled against god in very ancient times and was sent to the Dark Area along with many other Demon Lord Digimon."},{"name": "Lucemon Larva","profile": "A Digimon who manipulates Satanmode, the incarnation of evil. It is very small, lying inside the sphere held by Satanmode. It has its own will and can also talk."},{"name": "Lucemon Satanmode","profile": "The final form of Lucemon in the shape of the dragon that appears in the Revelation. It wears the crown of the seven deadly sins and holds Gehenna, which absorbs all attacks. The real Digimon is inside Gehenna."},{"name": "Tigervespamon","profile": "A Digimon whose thin silhouette boasts a unimaginably phenomenal amount of stamina. It never stops moving during battle."},{"name": "Neptunemon","profile": "A Digimon that lives in the Abyss Sanctuary in the deep sea. It is the god governing over all marine Digimon. Its body is covered in scales made of blue Digizoid. Its agility and speed are excellent."},{"name": "Beowolfmon","profile": "A Digimon who inherited power from the Ten Warriors of Light. It acquired unknown abilities, combining the powers of both man and beast. It has Trinitat in its right hand and Roland 2 in its left hand. It is very good at distance attacks."},{"name": "Valkyrimon","profile": "A Digimon covered in shiny armor. Its armor produces an aurora which regenerates the data of heroes fallen in battle and returns them to a new Digitama."},{"name": "Sleipmon","profile": "A member of the Royal Knights that dresses in Red Digizoid armor, which is known for its hardness. It moves with a superior, instantaneous speed, shooting light arrows with the sacred crossbow Muspelheim."},{"name": "Anubimon","profile": "A Digimon who monitors the Dark Area, the place where Digimon are transferred who died naturally or fell in battle. Fallen Angel Digimon are also transferred there while still alive."},{"name": "Bastemon","profile": "A Digimon called the ’Cat God’. It seduces its opponents with its bright, mysterious eyes and the jewels that cover its body. It is Nefertimon’s friend. It hides its strength behind its supple movements."},{"name": "Nefertimon","profile": "A Digimon who armor-evolved from Tailmon using the Digimental of Light. It has the attribute of light and can gracefully fly in the sky. It can purify the corruption of the darkness using the power of intense light."},{"name": "Ancientsphinkmon","profile": "One of the legendary Ten Warriors who saved the ancient Digital World. It possesses the attribute of darkness."},{"name": "Falcomon","profile": "A subspecies that developed the ability to fly with its wings. It is different from the original Falcomon who had strong legs. It acts like a ninja in many cases and, even though it can fly, it rides kites and throws shuriken."},{"name": "Sethmon","profile": "A Demon Beast Digimon who armor-evolved through the Digimental of Love. The Digimental of Love’s power was too great and uncontrollable, and its power was converted into the power of hatred."},{"name": "Holsmon","profile": "A Digimon born when Hawkmon armor-evolved through the Digimental of Love. It has the attribute of wind, being able to flap his wings and dance in the sky like the wind. Its specialty is air battles."},{"name": "Angewomon","profile": "A Digimon who has a calm personality but is very strict with twisted and evil individuals. It will punish them until they change. Thanks to its morals and power, it is praised as ’The Goddess’ of the Digital World."},{"name": "Mermaimon","profile": "A Digimon in the shape of a legendary mermaid that lives in the icy seas of the Digital World."},{"name": "Lilithmon","profile": "A Digimon that was originally a high-ranking Angel Digimon. It fell to the dark side and is now called ’The Goddess of Darkness’. It is one of the Seven Great Demon Lords. Anything touched by the nails of its left hand will corrode."},{"name": "Ladydevimon","profile": "A female fallen angel Digimon that holds dark power of incomparable purity. It is impossible to control it using personal computers. Its enemy is Angewomon."},{"name": "Olegmon","profile": "The general of the Golden Thief Army. Even amongst the generals, it possesses a superhuman strength, snatching up treasure from the seas it crosses. It eats up the gold and silver treasure its finds and improves its armor."},{"name": "Cutemon","profile": "A coward Digimon that likes pranks. It developed ear-like sensory organs and is very sensitive to any movement around it, hiding immediately when necessary. The muffler around its neck protects it against the cold."},{"name": "Sakuyamon","profile": "A Digimon fulfilling the role of a miko, the agent of God’s will. It has four kuda-kitsune around its waist-belt. The sound of its servants and the echo of its singing voice have the power to exorcise all evil."},{"name": "Ofanimon","profile": "A Digimon that spreads love and mercy. It is the ultimate form of the female Angel Digimon. It protects the Kernel (the God’s land) together with Seraphimon and Cherubimon."},{"name": "Beelzebumon Blastmode","profile": "An aloof Digimon with a powerful spirit. It has two double-barreled shotguns, the Berenjena. It is feared as one of the Seven Great Demon Lords and looks for battles with strong Digimon."},{"name": "Mervamon","profile": "A form of Minervamon that has, through time and experience, acquired an adult’s grace and charm. It fascinates everyone around it with its refined and sophisticated gestures, even during battles."},{"name": "Venusmon","profile": "The goddess of love. It brings flowers to desolate lands together with its friends Olive and Hotan, conveying love and harmony. To suppress its bewitching nature, it hides its eyes, looking instead at a higher truth through its mind’s eye."},{"name": "Shoutmon x5","profile": "A Finalist form born by combining its x4 Victory form with Sparrowmon. It now has Sparrowmon’s flight ability."},{"name": "Grain of gloom","profile": "Grain hiding the book of darkness. Can be found in specific Events."},{"name": "Crystal of gloom","profile": "Crystal hiding the book of darkness. Can be found in specific Events."},{"name": "Knowledge of the dark","profile": "Here is marked the heart of darkness, that wriggles quietly. Can be found in specific Events."},{"name": "Aegiochusmon Dark","profile": "A Digimon based on Evil-type data stored in its body, concentrated in the crystal in its chest. In this form, the data has infested throughout its body."},{"name": "Aegiochusmon Dark","profile": "A Digimon based on Evil-type data stored in its body, concentrated in the crystal in its chest. In this form, the data has infested throughout its body."},{"name": "Aegiochusmon Dark","profile": "A Digimon based on Evil-type data stored in its body, concentrated in the crystal in its chest. In this form, the data has infested throughout its body."},{"name": "Arkadimon (Ultimate)","profile": "A Digimon who evolved to an Ultimate form by absorbing dark data. It can also achieve the Ultimate evolution through its tamer, and when not controlled by its tamer, it can transform into various other forms."},{"name": "Arkadimon (adult)","profile": "A Digimon who initially evolved from Arkadimon. Several long tentacles are attached to its arms, greedily absorbing the opponent’s data, but it remains unknown whether it possesses any self-awareness."},{"name": "Arkadimon (perfect)","profile": "A Digimon who evolved a second time by capturing Seraphimon’s light data. It used to be slim, but now it has a different style. It has one more evolution until it reaches the Ultimate form."},{"name": "Ofanimon Falldownmode","profile": "A Digimon who destroyed its own emotions. It now embraces anger to such an extent that it has fallen into madness against the continuously increasing misdeeds of the world. It hunts down all those who get in the way of it achieving its own justice."},{"name": "Imperialdramon FM","profile": "A Digimon who unleashed its full power in dragon mode and transformed into a legendary dragon warrior. It is incredibly intelligent and capable of controlling its violent power."},{"name": "Cyberdramon","profile": "A Blue Flare Digimon wearing armor made of a special rubber and holding a sharp lance. It can spin its tail and ride atop it to launch further attacks."},{"name": "Rapidmon","profile": "A Cyborg Digimon evolved from Gargomon. It moves at close to the speed of light and controls a large ear-type radar. It always captures its prey, even in the darkness."},{"name": "Murmusmon","profile": "Formerly a senior Angel, it fell from Heaven and became a Demon Lord. It is called an ’Earl’ and gathers 30 demon legions. It sows the seeds of conflict when it transforms into other Digimon."},{"name": "Marindevimon","profile": "A subspecies of Digimon. It is full of hatred because it lives alone in the deep sea. Its two tentacles have their own will and are free to attack on their own."},{"name": "Wendimon","profile": "A Digimon who dark-evolved from a Lopmon consumed by hatred and anger. Deep down it has a kind heart, but it is hidden under a destructive impulse. It can manipulate time and space in its need to destroy."},{"name": "Andiramon","profile": "A Grappling Digimon. It can easily control its mind and harden its body, having kaleidoscopic attack and defense skills. When it receives damage from the enemy, it can instantly recover using the power of its mind."},{"name": "Cherubimon (evil)","profile": "Although one of The Three Great Angels, it transformed into an evil form for some mysterious reason. It is incredibly powerful and capable of destroying the equilibrium in the Digital World. It passes divine judgement on all living things."},{"name": "Agumon Hakase","profile": "A genius Agumon with a Digital Monster PhD degree from the Digital World University."},{"name": "Shinegreymon Burstmode","profile": "A unique Digimon. It appears when Shinegreymon temporarily reaches the limit of its abilities through Burst evolution. It wears a special, high-energy solar flame aura."},{"name": "Rosemon Burstmode","profile": "A temporary form of Rosemon who reached the limit of its abilities through Burst Evolution. It has an aura of love and beauty. It gracefully attacks its enemies with the Tiferet on its chest, which is engraved with the symbol for love and beauty."},{"name": "Ravmon Burstmode","profile": "A unique Digimon. It appears when Ravmon temporarily reaches the limit of its abilities through Burst evolution. It wears an aura made of all the energy in the atmosphere."},{"name": "Shinegreymon Burstmode","profile": "A unique Digimon. It appears when Shinegreymon temporarily reaches the limit of its abilities through Burst evolution. It wears a special, high-energy solar flame aura."},{"name": "Rosemon Burstmode","profile": "A temporary form of Rosemon who reached the limit of its abilities through Burst Evolution. It has an aura of love and beauty. It gracefully attacks its enemies with the Tiferet on its chest, which is engraved with the symbol for love and beauty."},{"name": "Ravmon Burstmode","profile": "A unique Digimon. It appears when Ravmon temporarily reaches the limit of its abilities through Burst evolution. It wears an aura made of all the energy in the atmosphere."},{"name": "Darkdramon","profile": "A Cyborg Digimon that is supposed to be the weapon of last resort for the mechanized ’D-brigade’."},{"name": "Lotusmon","profile": "A Fairy Digimon that looks like a lotus, the flower said to be blooming in heaven. A lady with a calm and gracious personality, it has the power to make one forget one’s sorrows and have happy dreams."},{"name": "Wormmon","profile": "A timid and weak Digimon that possesses genuine tenderness. It is the descendant of an ancient family and can use Digimentals and armor-evolve. If it grows, it will demonstrate unbelievable strength."},{"name": "Stegomon","profile": "A Digimon who uses the blades on its back both to repel enemy attacks and perform counterattacks. It can move in the desired direction by its own will."},{"name": "Quetzalmon","profile": "A bewitching armor-form Beast that evolved through the Digimental of Light. It is the embodiment of the sun and wind in the shape of a winged white snake."},{"name": "Belphemon: Ragemode","profile": "A Digimon awakened after a long sleep. It is the incarnation of anger. Its ferocious roar is enough to disintegrate the data of weaker Digimon. It considers everything that comes into its sight to be an enemy."},{"name": "Gizmon: Prototype","profile": "A Digimon without an ego. It was upgraded artificially and carries out its missions according to the orders it receives. Its lethal skills are ’PT Laser’, where it releases a small laser through its red eyes, and ’PT Helix’, where it spins and cuts down its enemies."},{"name": "Gizmon: Attacker","profile": "A Digimon without an ego. It was upgraded artificially and carries out its missions according to the orders it receives. All its lethal skills are more powerful than those of Gizmon: Prototype. They are ’AT laser’, ’AT Helix’, and ’AT Hacking’."},{"name": "Gizmon: X-Terminator","profile": "A Digimon without an ego. It was upgraded artificially and carries out its missions according to the orders it receives. It focuses on a single enemy and does not rest or stop until the termination of the target or itself."},{"name": "Marinangemon","profile": "A Fairy Digimon living in the Internet sea. It rarely shows itself to others. An Angemon in name only, it is a completely different species in terms of ecosystem."},{"name": "Queenchessmon","profile": "The strongest Digimon of the Chessmon series. It has extreme range and offensive capability. It is a reliable presence and protects the coward Kingchessmon. Its immense offensive capabilities are sometimes even considered inhumanly powerful."},{"name": "Rookchessmon","profile": "A Digimon in the shape of a fort. It boasts an impregnable defense. Although a huge Digimon, it is very fast. It repels and counters enemy attacks."},{"name": "Dianamon","profile": "One of the Olympos XII. It presides over water and ice and can act even when the surrounding temperature is absolute zero. Like the moon, it is two-faced and hides a terrible power under its beauty."},{"name": "Paunchessmon (white)","profile": "A Puppet Digimon born from the data of a supercomputer’s chess game. While it is normally a weak general infantry Digimon, it has hidden powers and can be propelled into Ultimate-level class through victories."},{"name": "Knightchessmon (white)","profile": "A Digimon throwing master who shoots huge darts. It is weak in close combat, but it confuses its enemies by leaping high above them using its thoroughbred leg strength."},{"name": "Rookchessmon","profile": "A Digimon in the shape of a fort. It boasts an impregnable defense. Although a huge Digimon, it is very fast. It repels and counters enemy attacks."},{"name": "Queenchessmon","profile": "The strongest Digimon of the Chessmon series. It has extreme range and offensive capability. It is a reliable presence and protects the coward Kingchessmon. Its immense offensive capabilities are sometimes even considered inhumanly powerful."},{"name": "Paunchessmon (black)","profile": "A Puppet Digimon born from the data of a supercomputer’s chess game. While it is normally a weak general infantry Digimon, it has hidden powers and can be propelled into Ultimate-level class through victories."},{"name": "Knightchessmon (black)","profile": "A Digimon throwing master who shoots huge darts. It is weak in close combat, but it confuses its enemies by leaping high above them using its thoroughbred leg strength."},{"name": "Bishopchessmon","profile": "A Puppet Digimon that makes full use of its bombing skills. The attack range is long, and it can hit enemies from a long distance. Its catchphrase is ’Lord, grant me strength!’"},{"name": "Kingchessmon","profile": "A King Digimon who had to work behind the scenes in order to build the Great Empire of Chessmon. However, no one actually knows what the Great Empire of Chessmon is, and no one shows any interest in it."},{"name": "Aldamon","profile": "This Digimon transcended legend when it inherited the power of the Ten Warriors of Fire, granting it wondrous powers of both man and beast. Converting feelings of anger and fear into the power of justice, it plunges unhesitantly into battle."},{"name": "Fladramon","profile": "A Digimon who armor-evolved from V-mon through the Digimental of Courage. Its combat skills are similar to a burning flame, and it hits its enemies with extremely strong knuckles."},{"name": "Sistermon Blanc","profile": "A girl Digimon that looks like it is wearing a white rabbit. In contrast to its sister, Sistermon Noir, it is a little shy and is always hiding behind its sister."},{"name": "Sistermon Noir","profile": "A nun Digimon wearing a klobuk in the shape of a black cat’s head. It is Sistermon Blanc’s sister. It has a very cheerful personality, smoothing things over with its innocent behavior."},{"name": "Examon","profile": "A Digimon who belongs to the Royal Knights. It also stands at the pinnacle of all Dragon Digimon. Its nickname is ’the Dragon Emperor’."},{"name": "Spinomon","profile": "The biggest and strongest of the Dinosaur Digimon living in the Digital World. It has the same strength as Dinorexmon."},{"name": "Darkdramon","profile": "A Cyborg Digimon that is supposed to be the weapon of last resort for the mechanized ’D-brigade’."},{"name": "Duftmon: Leopardmode","profile": "The form Duftmon takes on the battlefield. It runs and flies through the world and strategically chooses its moves according to the conditions it faces in battle."},{"name": "Ladydevimon","profile": "An incredibly prideful Fallen Angel Digimon. It continues fighting with Angewomon, to the surprise of its tamer. Its wickedness can be seen when it takes hostages in battle."},{"name": "Belphemon: Sleepmode","profile": "A Digimon whose power is too great. It is said it can put data throughout the Digital World systems to sleep, but it cannot be proven if this is true."},{"name": "Yggdrasil 7D6","profile": "’7D6’ is the created avatar of the mysterious host computer ’Yggdrasil’, who governs the whole Digital World Network. (The Real World corresponds to the year 2006)."},{"name": "Yggdrasil 7D6","profile": "’7D6’ is the created avatar of the mysterious host computer ’Yggdrasil’, who governs the whole Digital World Network. (The Real World corresponds to the year 2006)."},{"name": "Yggdrasil 7D6","profile": "’7D6’ is the created avatar of the mysterious host computer ’Yggdrasil’, who governs the whole Digital World Network. (The Real World corresponds to the year 2006)."},{"name": "Minervamon","profile": "One of the Olympos XII. It is a Snake Princess with arms that wield the large sword ’Olympia’. It has a strong-willed personality and jumps in whenever it catches the scent of battle."},{"name": "Shoutmon DX","profile": "A Crusade form that was born through the Digicross of Zekegreymon and Omegashoutmon. Its speed, fighting ability, and armor have become more intense, and it engages in battle passionately and yet with calm determination."},{"name": "Petermon","profile": "An eternal-boy Digimon who soars freely through the sky. It invites all Digimon who refuse evolution into the children’s world, Never-Everland. It masterfully wields its knife to punish all those who break their promises."},{"name": "Aegiochusmon Holy","profile": "A Digimon based on Angel-type data stored in its body, concentrated in the crystal in its chest. In this form, the data envelops its whole body, keeping its heart as pure and clean as glass."},{"name": "Aegiochusmon Holy","profile": "A Digimon based on Angel-type data stored in its body, concentrated in the crystal in its chest. In this form, the data envelops its whole body, keeping its heart as pure and clean as glass."},{"name": "Aegiochusmon Holy","profile": "A Digimon based on Angel-type data stored in its body, concentrated in the crystal in its chest. In this form, the data envelops its whole body, keeping its heart as pure and clean as glass."},{"name": "Grain of the Holy","profile": "A grain sealed in the book of light. Can be found in specific Events."},{"name": "Crystal of the Holy","profile": "A crystal sealed in the book of light. Can be found in specific Events."},{"name": "Knowledge of the Holy God","profile": "Here is marked the light that shines divinely. Can be found in specific Events."},{"name": "Bacchusmon","profile": "One of the Olympos XII. It calls itself the heavy drinker of the Digital World. It has a cheerful personality and takes good care of others. It gathers Child and Adult Digimon and holds banquets, no matter the time of day."},{"name": "Orochimon","profile": "An eight-headed Digimon. While its primary head in the center is black, the rest of its heads are camouflage. It was born in the ancient Digital World with the purpose of preserving harmony."},{"name": "Gekomon","profile": "A coveted composer Digimon. It charms its surroundings and can play pleasant music, contrary to its looks. It can freely control its opponents’ feelings through the music it plays."},{"name": "Bakumon","profile": "A Digimon considered to have been generated by a medical machine for detecting brain waves. It has the ability to purify viruses and nightmares, for which it holds a Holy Ring."},{"name": "Sanzomon","profile": "A monk Digimon who continues its journey of trials in order to find enlightenment. It holds no weapon but only sings its sutras and leads the hearts gone astray. Some Digimon aim for the pure energy stored in its digicore."},{"name": "Cho Hakkaimon","profile": "It was once an Angel Digimon, but it was transformed by Ofanimon into its current form and banished from heaven for committing a crime. It has a lighthearted personality, but it turns ferocious when it’s hungry."},{"name": "Sagomon","profile": "A Digimon with a cheerful and easy-going personality. It transforms into a dreadful Digimon if even one of the skulls at its waist disappears. It was expelled from heaven and has set out on a journey in search of its true identity."},{"name": "Gokuwmon","profile": "A Battle Digimon born with combat instincts from the magma of the Boot Volcano. It is skilled in martial arts and witchcraft, and it craves fights with formidable enemies. However, it is banned by Sanzomon."},{"name": "Targetmon","profile": "An insistent Puppet Digimon. It is equipped with the super wide-angle, super high-resolution ’Yarimasu Gurasan’ (with shake correction). It locks on to its target with certainty and never lets it escape."},{"name": "Muchomon","profile": "A Bird Digimon who cannot fly, exactly like Penmon. It grew in the southern tropical countries. It always lives its life pleasantly."},{"name": "Makuramon","profile": "A Digimon under the control of Baihumon, one of the Four Holy Beasts. It is rather strange since it cannot speak and its emotions never appear on its face."},{"name": "Jupitermon: Wrathmode","profile": "One of the Olympos XII. It governs the sky and weather. On the battlefield it distinguishes skillfully between good and evil and applies divine punishment to the evil ones."},{"name": "Dukemon X antibody","profile": "A Digimon born from Megidramon. Its name is also linked to the Royal Knights. Its weapons, Gram and Aegis, form from its armor, which is made completely of Chrome Digizoid."},{"name": "Rosemon X antibody","profile": "A beautiful female Digimon called the queen of flowers. On its breast it wears a Tiferet, a jewel in which is engraved the symbol of love and beauty. This jewel promises eternal beauty."},{"name": "Lilimon X antibody","profile": "A Digimon emerging from a beautiful blossoming flower. It has a tomboyish and whimsical character, but it is gentle and always lends a hand to the weak. A refreshing wind blows after it flies with its leaf wings."},{"name": "Wargreymon X antibody","profile": "A Digimon equipped with Dramon Killers on both its arms and the Brave Shield on its back. It is a veteran hero wearing armor made of Chrome Digizoid. It has a humanoid shape and is remarkably powerful and fast."},{"name": "Blackwargreymon X antibody","profile": "A Dragon Warrior Digimon that earnestly pursues its own brand of justice. While its ’Brave Shield’ is missing its crest of Courage, it maintains the pride of a warrior, seeking always to understand why it has a soul."},{"name": "Dorumon","profile": "A beast Digimon with an old-style interface on its forehead. It is speculated it is an experimental ’prototype Digimon’ from before the Digimon were discovered."},{"name": "Omegamon","profile": "A Holy Knight Digimon born through the fusion of miracles by the will of the good ones. Well-rounded in combat, it effortlessly wields weapons that themselves have the strength of two Digimon."},{"name": "Paildramon","profile": "A Digimon who jogress-evolved from XV-mon and Stingmon. Although it has the skilled attacks of dragons and the defensive ability of insects, the dragon attributes are a little stronger. It is very loyal and always protects its master."},{"name": "Armagemon","profile": "A super ultimate form Digimon, formed by scattering Kuramon everywhere and then putting all the pieces together in the real world. It took over Diablomon’s plans and seeks revenge against Omegamon."},{"name": "Diablomon","profile": "A greedy Digimon that swelled to huge proportions by absorbing any and all data in the Network. It aims to take over military computers and destroy the Real World in a nuclear attack."},{"name": "Infermon","profile": "An atrocious Digimon capable of invading any network and destroying its data. Its defense is remarkably improved thanks to the limbs attached to its cocoon body."},{"name": "Apollomon","profile": "One of the Olympos XII. It has in its body a fiery energy with the power to purify all that exists. Its boiling blood and its pride give it the strength to control this fierce energy."},{"name": "Sagittarimon","profile": "A bewitching Beast Digimon who armor-evolved through the Digimental of Hope. It has been told its existence is an illusion. It is the superior species of Centalmon."},{"name": "Harpymon","profile": "A thief Digimon who steals precious data (treasure) from databases (ruins) and is called ’ the Scavenger’. It has wing arms and the upper body of a woman."},{"name": "Jupitermon","profile": "One of the Olympos XII. It governs the sky and weather. On the battlefield it distinguishes skillfully between good and evil and applies divine punishment to the evil ones."},{"name": "Wargreymon X antibody","profile": "A Digimon equipped with Dramon Killers on both its arms and the Brave Shield on its back. It is a veteran hero wearing armor made of Chrome Digizoid. It has a humanoid shape and is remarkably powerful and fast."},{"name": "Junomon","profile": "A Digimon who stands on the battlefield as Jupitermon’s lover and protector. It predicts, scouts for, and eliminates insurgents who disobey Jupitermon’s will."},{"name": "Jupitermon","profile": "One of the Olympos XII. It governs the sky and weather. On the battlefield it distinguishes skillfully between good and evil and applies divine punishment to the evil ones."},{"name": "Jupitermon","profile": "One of the Olympos XII. It governs the sky and weather. On the battlefield it distinguishes skillfully between good and evil and applies divine punishment to the evil ones."},{"name": "Jupitermon","profile": "One of the Olympos XII. It governs the sky and weather. On the battlefield it distinguishes skillfully between good and evil and applies divine punishment to the evil ones."},{"name": "Jupitermon","profile": "One of the Olympos XII. It governs the sky and weather. On the battlefield it distinguishes skillfully between good and evil and applies divine punishment to the evil ones."},{"name": "Jupitermon","profile": "One of the Olympos XII. It governs the sky and weather. On the battlefield it distinguishes skillfully between good and evil and applies divine punishment to the evil ones."},{"name": "Patamon vs Devimon","profile": "All companions fall before the fearsome Devimon. Patamon, who cannot evolve to the Adult form, musters its courage. But still, it must confront Devimon!"},{"name": "Blitzmon","profile": "A Digimon who evolved through the Human Spirit. It harbors the thunder power of the Ten Warriors. It can move at high speeds due to the high-voltage current running through its body. It uses a wrestling fighting style while scattering sparks."},{"name": "Fairimon","profile": "A Digimon evolved through the Human Spirit. It harbors the wind power of the Ten Warriors. It freely manipulates the air and can produce vacuums and mirages. It is also good at gathering information."},{"name": "Chackmon","profile": "A Digimon evolved through the Human Spirit. It harbors the ice power of the Ten Warriors. Although it pretends to belong to the noble class, it possesses a wealth of survival knowledge and precise skill with launcher technology."},{"name": "Bancholeomon","profile": "A Digimon who wins while respecting its sense of justice and holding to its beliefs. It would face even the Three Great Angels or the Royal Knights to make its sense of justice understood."},{"name": "Tonosamamamemon","profile": "An easygoing and constantly cheerful Digimon. It can barely walk due to its long hakama, which trails behind it. It always falls, rolls over, or gets tangled, making watchers laugh and relax."},{"name": "Tonosamagekomon","profile": "A Digimon that plays its main theme through the two horns on its shoulders. The tone of its voice, several octaves lower than Gekomon’s, imparts a feeling of Tonosama’s grandeur."},{"name": "Angewomon","profile": "A beautiful and gentle Angel Digimon with eight pure white wings. It has the compassionate ability to heal its allies’ wounds, but it can also destroy evil enemies."},{"name": "Omegamon","profile": "A Holy Knight Digimon born through the fusion of miracles by the will of the good ones. Well-rounded in combat, it effortlessly wields weapons that themselves have the strength of two Digimon."},{"name": "Bagramon","profile": "An Angel Digimon who originally governed over Death. It became disappointed with the world’s philosophy and started a revolt, for which it was punished. It now continues searching for a new philosophy to substitute the gods’ philosophy."},{"name": "Deckerdramon","profile": "An anti-aircraft Digimon that can be considered the natural enemy of all Flying Digimon. It shoots down flying Digimon with the various missiles mounted on its back. It takes advantage of its low height by concealing itself within the terrain."},{"name": "Omegamon Zwart","profile": "A Digimon born temporarily as a black Holy Knight by mixing in the recently discovered substance Black Digitron during the fusion process with Omegamon. It sports enhanced powers, not the least of which are the weapons on both its arms."},{"name": "Skullknightmon","profile": "A Digimon who signed a pledge of blood brotherhood with Deadlyaxemon. It is the older brother. It believes supremacy is gained through victory in battle, so it will use any cunning means to that end."},{"name": "Beowolfmon vs Duskmon","profile": "The fatal confrontation of the Ten Warriors of light and the Ten Warriors of darkness! With both the power of earthshaking conflict and the intimacy of a sibling rivalry, the battle fought for their pride and justice begins!"},{"name": "Angewomon vs Ladydevimon","profile": "An exchange of slaps in the battle of wills between the angel and the demon! Everyone cringes at such ghastly strikes... and roots them on: ’Do it! Do it!’"},{"name": "Arresterdramon","profile": "A Digimon who freed itself from Kinkoji and evolved. It wears battle armor made of a special rubber which offers it high defense without a loss in flexibility. It can also fly at high speeds with its grown wings."},{"name": "Troopmon","profile": "An Artificial Digimon built from stolen Digimon energy that was put into a body made of special rubber. It follows any command faithfully, like a machine. It shows no signs of fatigue but instead continues its numerous attacks."},{"name": "Gaioumon vs Zanbamon","profile": "A grudge fight between two samurai! For one’s path and one’s ideals, one must put its soul into the sword! Sparks will fly and swords will ring! All is decided by this one blow..."},{"name": "Plesiomon","profile": "A Digimon that rarely shows itself. It appears to be surrounded by mist, disturbing the viewer’s vision. With its white body and refined appearance, it is a very mysterious figure."},{"name": "Ultimatebrakimon","profile": "The largest and heaviest Cyborg Digimon on the ground. Whenever it moves, the booster installed on its back sends a jet downwards to support its ultra-large body."},{"name": "Dinorexmon","profile": "A Carnivorous Dinosaur Digimon nicknamed ’the King of Terror’. Its strength stands completely apart from that of other Dinosaur Digimon. It fights with unparalleled ferocity."},{"name": "Rusttyranomon","profile": "The Ultimate form of Tyranomon. It has been evolving and surviving fierce battles since the creation of the Digital World."},{"name": "Ex-tyranomon","profile": "A Puppet Digimon that sneaked its way inside a stuffed animal in the shape of Tyranomon."},{"name": "Mastertyranomon","profile": "A Dinosaur Digimon that evolved from a Tyranomon who won fierce battles. The wounds on its body are proof of the many battles it has won and survived."},{"name": "Dorugoramon","profile": "An imaginary Digimon born from the ’Digicore’s Imagination’. It has evolved through the miraculous release of the digicore’s originality through the interface on its forehead."},{"name": "Groundramon","profile": "A Ground Dragon Digimon with a large arm on its back that is said to have transformed from a wing. It is able to dig in the ground very efficiently."},{"name": "Opossummon","profile": "A lovely Digimon who prefers sandy dry lands. It holds some balloons that contain a strong virus. It is hard to capture since it holds its balloons and jumps from place to place."},{"name": "Ancientgarurumon","profile": "One of the legendary Ten Warriors. It has the attribute of ’Light’ and saved the ancient Digital World. It was one of the first Ultimate forms to exist in the distant past. It was called ’the Brilliant Supreme Beast’."},{"name": "Ancientirismon","profile": "One of the legendary Ten Warriors. It has the attribute of ’Wind’ and saved the ancient Digital World. It was one of the first Ultimate forms to exist in the distant past. It has golden wings and is beautifully colored in rainbow colors."},{"name": "Ancienttroiamon","profile": "One of the legendary Ten Warriors. It has the attribute of ’Wood’ and saved the ancient Digital World. It was one of the first Ultimate forms to exist in the distant past. It boasts the largest size among the Ancient Digimon."},{"name": "Grottemon","profile": "A Digimon who harbors the power of the legendary Ten Warriors. It has earth abilities. Various weapons and instruments, both practical and artistic, have grown from its big palms and thick fingers."},{"name": "Arbormon","profile": "A Digimon who harbors the power of the legendary Ten Warriors. It has plant abilities. It comes from a medieval wooden doll blueprint, which was made into data. Its gimmicks are unexpectedly old-fashioned."},{"name": "Mercuremon","profile": "A Digimon who harbors the power of the legendary Ten Warriors. It has steel abilities. It is an intellectual type among the evil warriors and always provides wisdom."},{"name": "Duskmon","profile": "A Digimon who harbors the power of the legendary Ten Warriors. It has darkness abilities. The regrets of exterminated Digimon of various species, as well as ’forbidden data’ from the network, turn into an intense darkness and coagulate into Duskmon."},{"name": "Magnakidmon","profile": "A Digimon who loves single combat. When it comes to important fights, it shoots bullets indescriminately and becomes very trigger happy."},{"name": "Bellestarmon","profile": "A Digimon who masterfully wields two handguns. It is also called ’Beelzebumon Ready’. Its beloved handguns ’Rizoma de Loto’ can be regarded as the sisters of Beelzebumon’s ’Berenjena’."},{"name": "Magnakidmon vs Bellestarmon","profile": "A match between two true gun masters! The bullets fly from the two handguns and collide! Bullets! Bullets! Not even dust will remain of what was standing between the two."},{"name": "Hisyaryumon","profile": "A Digimon usually as calm and intelligent as a god. However, when the crystal-like sphere it’s holding is damaged, its godly wrath is awakened and it attacks with all of its body and soul."},{"name": "Grademon","profile": "A Warrior Digimon holding two swords. It is called ’the Golden Meteor’ because it always leads the vanguard bravely."},{"name": "Spadamon","profile": "A Digimon who can transform into huge weapons of unparallelled power. According to a saying, ’If held by an Angel, it will save the world. If held by a Demon, it will destroy the world’. It is a survivor of the ’Weapon Digimon’."},{"name": "Chaosmon","profile": "Typically, during a jogress evolution, the digicores of the two Digimon completely fuse, giving birth to a new Digimon. Chaosmon keeps the two digicores as they were before the jogress and maintains its form in an extremely incomplete state."},{"name": "Bancholeomon","profile": "A Digimon who wins while respecting its sense of justice and holding to its beliefs. It would face even the Three Great Angels or the Royal Knights to make its sense of justice understood."},{"name": "Darkdramon","profile": "A Cyborg Digimon that is supposed to be the weapon of last resort for the mechanized ’D-brigade’."},{"name": "Liollmon","profile": "A Holy Beast Digimon covered in golden fur. There seem to be very few surviving individuals, and their existence has been confirmed only recently. It is very territorial and doesn’t forgive those who enter its territory, even if they are the same species as it."},{"name": "Loaderliomon","profile": "A Machine Digimon born through the fusion of Beast Digimon data and the construction machine CAD data leaked from the server."},{"name": "Aegisdramon","profile": "A Cyborg Digimon born from the fusion of Plesiomon and Seadramon’s data. It is said that its gleaming armor made of a golden Digizoid alloy can remove all evil."},{"name": "Junomon: Hysteric Mode","profile": "This evil form of Junomon was awakened after sleeping within the innermost depths of its heart. This form is never noticed by its beloved Jupitermon, so it never suffers the judgment of good and evil."},{"name": "Avengekidmon","profile": "A Digimon born from a Digimon that was defeated by Magnakidmon. Overtaken by a ruthless desire for revenge, its digicore was overloaded by negative mind data, resulting in a sudden transformation."},{"name": "Z’d Garurumon","profile": "A subspecies of Metal Garurumon. It is a beast tank carrying a huge quantity of live ammunition, most importantly ’Z’d Gun’. The laser sight on top of its nose is improved for live ammunition and can hit several hundreds of targets."},{"name": "Astamon","profile": "A young noble Digimon from the Dark Area which binds together the devil-type Digimon. It has the power to surpass the ultimate form, and it attacks its enemies without mercy. Its favorite machine gun is Oro Salmon."},{"name": "Vulcanusmon","profile": "One of the Olympus XII, it is the Digimon god of smithery. Most well-known weapons,like Beelzebumon’s famous ’Berenjena’ are the work of Vulcanusmon. However, it prefers working behind the scenes to fighting in person."},{"name": "Slashangemon","profile": "A Power Digimon that commands the Angel corps ’Powers’ and leads all battles. When it comes to defending justice, it doesn’t fear even death."},{"name": "Madleomon: Armed Mode","profile": "A Digimon enraged by the pain caused by its extensive modifications. Due to its pain, it sees anything as an enemy."},{"name": "Greyknightsmon","profile": "Holding the gigantic Drill Lance as if it was a weapon wielded by a giant, and equipped with two gigantic gun turrets, Greyknightsmon overwhelms all Digimon."},{"name": "Ofanimon","profile": "A Digimon that spreads love and mercy. It is the ultimate form of the female Angel Digimon. It protects the Kernel (the God’s land) together with Seraphimon and Cherubimon."},{"name": "Gokuwmon","profile": "A Battle Digimon born with combat instincts from the magma of the Boot Volcano. It is skilled in martial arts and witchcraft, and it craves fights with formidable enemies. However, it is banned by Sanzomon."},{"name": "Dorulumon","profile": "An aloof Digimon with the traits of a lone wolf. The fur on its tail and head has hardened to become drills, which, together with its swift movements, allow it to use ’Hit and Run’ tactics as its favorite strategy."},{"name": "Neptunemon","profile": "A Digimon that lives in the Abyss Sanctuary in the deep sea. It is the god governing over all marine Digimon. Its body is covered in scales made of blue Digizoid. Its agility and speed are excellent."},{"name": "Beelzebumon Vs Avengekidmon","profile": "A gunfight between two Master Sharpshooters can only end if one makes a mistake. But if there is no mistake, will the bullets fly until the end of time?"},{"name": "Dukemon","profile": "A Digimon born from Megidramon. Its name is also linked to the Royal Knights. Its weapons, Gram and Aegis, form from its armor, which is made completely of Chrome Digizoid."},{"name": "Qinglongmon","profile": "One of the legendary Four Great Dragons, its wields thunder with godlike powers and presence. Unbound by the shackles of black-and-white thinking, it serves as a guide to Digimon faced with tough choices."},{"name": "Holsmon","profile": "A Digimon born when Hawkmon armor-evolved through the Digimental of Love. It has the attribute of wind, being able to flap his wings and dance in the sky like the wind. Its specialty is air battles."},{"name": "Shoutmon X4","profile": "Born from Shoutmon, Ballistamon, Dorulumon, and the Starmons’ powerful desire to gain absolute victory, Shoutmon’s only reason to exist is to enforce this conviction."},{"name": "Shoutmon X4","profile": "Born from Shoutmon, Ballistamon, Dorulumon, and the Starmons’ powerful desire to gain absolute victory, Shoutmon’s only reason to exist is to enforce this conviction."},{"name": "Victorygreymon","profile": "A subspecies of Wargreymon. This Digimon is a heroic dragon warrior carrying the crushing sword ’Dramon Breaker’. It developed its own fencing style that hits and smashes its enemies rather than cutting them."},{"name": "Z’d Garurumon","profile": "A subspecies of Metal Garurumon. It is a beast tank carrying a huge quantity of live ammunition, most importantly ’Z’d Gun’. The laser sight on top of its nose is improved for live ammunition and can hit several hundreds of targets."},{"name": "Angemon","profile": "A Digimon whose job is maintaining Good in the Digital World and keeping out Evil. It has six divine wings that are said to bring happiness."},{"name": "Deckergreymon","profile": "With the tremendous power it possesses, Decker Greymon will not get defeated even if it is facing multiple opponents."},{"name": "Mervamon","profile": "A form of Minervamon that has, through time and experience, acquired an adult’s grace and charm. It fascinates everyone around it with its refined and sophisticated gestures, even during battles."},{"name": "Pumpmon & Gottsumon","profile": "They might style themselves ’Servants of Darkness’, but they are better at goofing off than fighting. However, they never back down from a good trashing."},{"name": "Lwemon","profile": "AncientSphinxmon’s ’Human Spirit of Darkness’ was changed into its Duskmon form due to Cherubimon’s spell, but Lwemon is its true form released from this magical power."},{"name": "Lwemon","profile": "AncientSphinxmon’s ’Human Spirit of Darkness’ was changed into its Duskmon form due to Cherubimon’s spell, but Lwemon is its true form released from this magical power."},{"name": "Duskmon","profile": "A Digimon who harbors the power of the legendary Ten Warriors. It has darkness abilities. The regrets of exterminated Digimon of various species, as well as ’forbidden data’ from the network, turn into an intense darkness and coagulate into Duskmon."},{"name": "Devimon","profile": "A fallen angel Digimon. It originally belonged to the angel Digimon but fell to the dark side. It wears the symbol of evil engraved on its chest. It can control other Digimon using its evil intellect and fierce eyes."},{"name": "Airdramon","profile": "An intelligent Digimon that flies freely in the sky. They say that its existence is close to the gods, especially when it calls up storms with its cry. Its fierce personality makes it difficult for ordinary tamers to use."},{"name": "Agumon","profile": "A cheerful Digimon who uses its hard claws as weapons. Hidden in its small body lies boundless courage, a fearless personality, and an uncharted potential for growth."},{"name": "Archnemon","profile": "A queen Digimon that has the appearance of the spider queen from Greek legends. It governs over all Dokugumon. It is very intelligent and uses cunning tricks when attacking its prey. It can also take human shape."},{"name": "Lucemon: Falldown Mode","profile": "The strongest of the Seven Great Demon Lords. It combines magic and holiness. It rebelled against god in very ancient times and was sent to the Dark Area along with many other Demon Lord Digimon."},{"name": "Lucemon: Falldown Mode","profile": "The strongest of the Seven Great Demon Lords. It combines magic and holiness. It rebelled against god in very ancient times and was sent to the Dark Area along with many other Demon Lord Digimon."},{"name": "Ofanimon","profile": "A Digimon that spreads love and mercy. It is the ultimate form of the female Angel Digimon. It protects the Kernel (the God’s land) together with Seraphimon and Cherubimon."},{"name": "Beelzebumon X-Antibody","profile": "The wonders of its magic bullets have intensified through X-Evolution!"},{"name": "Magnamon X-Antibody","profile": "A Digimon that digivolved through the power of the Digi-Egg of Miracles. Its armor is made of Chrome Digizoid, but it has been completely integrated with Magnamon’s body through X-Digivolution, to the point that it possesses a nature similar to muscles."},{"name": "Crossmon","profile": "The duty of this giant bird Digimon is to annihilate all invaders that enter the Digital World. Its golden armor made of Chrondigizoit deflects every attack."},{"name": "Chaosmon: Valdur Arm","profile": "This Chaosmon is believed to be one that was jogressed from Bancholeomon and Valdurmon, and the faces of each Digimon are visible on its arms."},{"name": "Justimon","profile": "A hero of justice Digimon trailing a red muffler. It can change its arm by replacing the plug of its Extend Transmitter."},{"name": "Greymon Vs Skullgreymon","profile": "A display of unbridled aggression. One highly intelligent, the other devoid of rational thought, their combat instincts are unmatched."},{"name": "Ouryumon","profile": "An imaginary Digimon born from the ’Daydream of a DigiCore’. It carries the X Antibody."},{"name": "Alphamon","profile": "One of the Royal Knights. It is also called ’the Aloof Hermit’. It wears a blue fluttering cloak, and its place is called ’the Empty Seat’."},{"name": "Susanoomon","profile": "A god from Eastern folklore. It is the strongest destruction god and is said to descend to the network system only in extraordinary situations. One part of it is responsible for regeneration and creates a new system after everything has been destroyed."},{"name": "Darkness Bagramon","profile": "This digifused form of AxeKnightmon and Bagramon became the greatest emperor of evil. The evil power spilling out of its body symbolizes that strength, and if a weak evil is bathed in it then it immediately becomes a grovelling subordinate."},{"name": "Shinegreymon Vs Craniummon","profile": "The fiery dragon challenges the ultimate shield to a battle for the ages. Bystanders to this epic combat risk annihilation but can’t look away from such magnificence."},{"name": "Fragment of Fire","profile": "Fragment used to evolve to a particular Zhuqiaomon. Can be found in specific Events."},{"name": "Grain of Fire","profile": "Grain used to evolve to a particular Zhuqiaomon. Can be found in specific Events."},{"name": "Fragment of the Tiger","profile": "Fragment used to evolve to a particular Baihumon. Can be found in specific Events."},{"name": "Grain of the Tiger","profile": "Grain used to evolve to a particular Baihumon. Can be found in specific Events."},{"name": "Fragment of the Tortoise","profile": "Fragment used to evolve to a particular Xuanwumon. Can be found in specific Events."},{"name": "Grain of the Tortoise","profile": "Grain used to evolve to a particular Xuanwumon. Can be found in specific Events."},{"name": "Fragment of Lightning","profile": "Fragment used to evolve to a particular Qinglongmon. Can be found in specific Events."},{"name": "Grain of Lightning","profile": "Grain used to evolve to a particular Qinglongmon. Can be found in specific Events."},{"name": "Algomon Ultimate","profile": "A Mutant Digimon, generated from a bug in an algorithm, hence its name. Due to its ability for high speed processing, it uses its countless ivy tendrils as tentacles, taking complete control of the battlefield."},{"name": "Beelzebumon Blastmode","profile": "An ultimate Demon Lord that raised its power to the utmost limits. Instead of evolving in wickedness, it maintained a calmer mental state, and its three, once-baleful red eyes have become green."},{"name": "Metalseadramon","profile": "A Digimon fully covered in Chrome Digizoid alloy. It is the final form of the Seadramon species. It was adapted for use in interception and repels most attacks with its body."},{"name": "Shawujinmon","profile": "A Digimon banished from the Digital World’s heaven. A certain Digicore was sealed among the nine beads of its necklace, and if even one bead is lost it will be transformed into a terrifying Digimon."},{"name": "Wargreymon Vs Blackwargreymon","profile": "What will decide the ultimate battle between two mighty and prideful warriors? Wargreymon’s courage or Blackwargreymon own brand of justice?"},{"name": "Medieval Dukemon","profile": "An ancient ’Legendary Hero’ from another dimension, it is said that it transcends time and is still in existence."},{"name": "Mervamon","profile": "A form of Minervamon that has, through time and experience, acquired an adult’s grace and charm. It fascinates everyone around it with its refined and sophisticated gestures, even during battles."},{"name": "Rosemon Burstmode","profile": "A temporary form of Rosemon who reached the limit of its abilities through Burst Evolution. It has an aura of love and beauty. It gracefully attacks its enemies with the Tiferet on its chest, which is engraved with the symbol for love and beauty."},{"name": "Splashmon","profile": "Splashmon can change itself into a liquid and is able to take the shape of a human or Digimon at will. For this reason, spying is its specialty."},{"name": "Examon","profile": "A Digimon who belongs to the Royal Knights. It also stands at the pinnacle of all Dragon Digimon. Its nickname is ’the Dragon Emperor’."},{"name": "Lordknightmon","profile": "A member of the Royal Knights that governs over all Knight Digimon. It sticks to its own sense of justice, but if it must maintain peace, it can also use force to eliminate the weak."},{"name": "Dukemon","profile": "A Digimon born from Megidramon. Its name is also linked to the Royal Knights. Its weapons, Gram and Aegis, form from its armor, which is made completely of Chrome Digizoid."},{"name": "Sleipmon","profile": "A member of the Royal Knights that dresses in Red Digizoid armor, which is known for its hardness. It moves with a superior, instantaneous speed, shooting light arrows with the sacred crossbow Muspelheim."},{"name": "Craniummon","profile": "The most respectful Digimon of the Royal Knights. It pays respect even to its enemies during combat. It holds the legendary magic spear Claiomh Solais and the sturdy shield Avalon."},{"name": "Gankoomon","profile": "A Digimon that rarely remains in the same place. It travels around the Digital World with next-generation Huckmon, seeking out and quashing any indications of abnormality or chaos."},{"name": "Jesmon","profile": "A Holy Knight Digimon endowed with the ability to sense the unusual phenomena and signs of chaos that occur all over the Digital World."},{"name": "Duftmon","profile": "A Digimon regarded by the Royal Knights as one of the best strategists. It has the skill to lead the Royal Knights. When it gets to the battlefield itself, it changes to Leopardmode."},{"name": "Mastemon","profile": "The Jogress evolution of Angewomon and Ladydevimon. It can manipulate both light and darkness, and has the power to cross through space-time."},{"name": "Megidramon","profile": "Although this Digimon is one of the Four Great Dragons, it was initially evil, and its very existence was regarded as a digital hazard. This power has been sealed, but if it were released, it could result in catastrophic damage."},{"name": "Blackseraphimon","profile": "A hybrid Digimon that stole its data from Seraphimon and Mercuremon. It has ten bat wings and wields power directed toward evil. It also has Mercuremon’s tricks."},{"name": "Valdurmon","profile": "A rare Holy Bird Digimon living in the stratosphere at 40,000m above ground. According to legend it is the guardian of the sky, and it is told that it is an ancient Digimon that has existed since the creation of the Digital World."},{"name": "Agumon Black","profile": "A Reptile Digimon which has grown up and become able to walk on two legs, it has an appearance like a tiny dinosaur. It is also a being that foretells evolution to a great and powerful Digimon."},{"name": "Imperialdramon FM Vs Vikemon","profile": "The legendary dragon warrior versus the ultimate Beast Man Digimon. Can a great intelect overcome the berserker’s rage?"},{"name": "Blizzarmon","profile": "A Digimon that possesses power over Ice which bears the might of Ancientmegatheriumon. It’s closer to recklessness than dauntless courage."},{"name": "Ancientmegatheriumon","profile": "One of the legendary Ten Warriors Digimon that saved the ancient Digital World. It is said that the power and bravery it possesses can adapt even to the intense cold of the freezing tundra."},{"name": "Omegamon Vs Omegamon Zwart","profile": "The white knight versus the black knight. The final Omega fight. Will one be deleted or the other one terminated?"},{"name": "Grandiskuwagamon","profile": "The rarest species of insect type Digimon, it is said to be in an alliance with Blackwargreymon. Its special move is tearing up enemies with the huge Gran Killers in both arms."},{"name": "Imperialdramon DM","profile": "An ancient and incredibly powerful dragon Digimon. Besides its dragon form, it also has another form that can employ its full power. However, because this force is so big, it is difficult to control."},{"name": "Blackgrowmon","profile": "A Virus-species Digimon said to be the natural form of Growmon. Unlike a Growmon raised by a Tamer, it can roughly be described as having gone feral"},{"name": "Omegamon","profile": "A Holy Knight Digimon born through the fusion of miracles by the will of the good ones. Well-rounded in combat, it effortlessly wields weapons that themselves have the strength of two Digimon."},{"name": "Mugendramon","profile": "A completely metal Digimon that was created by combining the parts of many cyborg Digimon. An evil program is written in its digicore and supplies it with infinite malice."},{"name": "Darkdramon","profile": "A Cyborg Digimon that is supposed to be the weapon of last resort for the mechanized ’D-brigade’."},{"name": "Metalgarurumon X antibody","profile": "A Digimon whose whole body is mechanized. It is the final form of Garurumon. It retains Garurumon’s speed despite the many heavy firearms attached to its body. It finds its enemies with the laser on the tip of its nose and swiftly shoots them down"},{"name": "Ancientgreymon","profile": "Possessing the attribute of ’Flame’, it is one of the legendary Ten Warriors that saved the ancient Digital World. An Ultimate who existed only in the distant past, it is told that its strength surpasses that of current Ultimates."},{"name": "Holyangemon","profile": "A Digimon responsible for surveilling the world as an agent of light. Whenever darkness approaches, it changes to battle mode. It fights the darkness with its sacred sword Excalibur in its right hand and its Beam Shield in its left hand."},{"name": "Ancientbeatmon","profile": "Possessing the attribute of ’Thunder’, it is one of the legendary Ten Warriors that saved the ancient Digital World. An Ultimate who existed only in the distant past, it has an appearance fused from many insects."},{"name": "Cherubimon (evil)","profile": "Although one of The Three Great Angels, it transformed into an evil form for some mysterious reason. It is incredibly powerful and capable of destroying the equilibrium in the Digital World. It passes divine judgement on all living things."},{"name": "Ulforcevdramon X antibody","profile": "This Holy Knight Digimon is the X-antibody carrier version of the mighty Ulforcevdramon."},{"name": "Lucemon","profile": "A great Angel Digimon that stopped a war and brought peace to the ancient Digital World. Its talents were inherited by the Three Great Angels."},{"name": "Caturamon","profile": "One of the ’Deva Digimon’, it is a Perfect Digimon with a form resembling the Dog. As a follower of the Four Holy Beasts Digimon Baihumon, it looks after its fellow followers Makuramon and Sinduramon as if they were its younger brothers."},{"name": "Metalgreymon","profile": "A Digimon with over half of its body mechanized. It is said to have the power of a nuclear warhead. Only a Greymon who has won numerous battles can evolve to this stage."},{"name": "Shutumon Vs Ranamon","profile": "Two Digimon who should be able to get along, were it not for Ranamon’s extreme jealousy of Shutumon’s looks."},{"name": "Ancientmermaimon","profile": "One of the legendary Ten Warriors. It has the attribute of ’Water’ and saved the ancient Digital World. An Ultimate who existed only in the distant past, it is the guardian goddess of the birthplace of Digimon, the ’Net Ocean’"},{"name": "Ancientirismon","profile": "One of the legendary Ten Warriors. It has the attribute of ’Wind’ and saved the ancient Digital World. It was one of the first Ultimate forms to exist in the distant past. It has golden wings and is beautifully colored in rainbow colors."},{"name": "Lotusmon","profile": "A Fairy Digimon that looks like a lotus, the flower said to be blooming in heaven. A lady with a calm and gracious personality, it has the power to make one forget one’s sorrows and have happy dreams."},{"name": "Devimon","profile": "A fallen angel Digimon. It originally belonged to the angel Digimon but fell to the dark side. It wears the symbol of evil engraved on its chest. It can control other Digimon using its evil intellect and fierce eyes."},{"name": "Metaletemon","profile": "The ’King of Digimon’ studied its weak points after each battle and coated its whole body in Chrome Digizoid. Thus, a strong and dirty warrior was born!"},{"name": "Blackwargreymon X antibody","profile": "A Dragon Warrior Digimon that earnestly pursues its own brand of justice. While its ’Brave Shield’ is missing its crest of Courage, it maintains the pride of a warrior, seeking always to understand why it has a soul."},{"name": "Skullgreymon","profile": "A menacing Digimon obsessed with fighting. Thanks to its battle instincts, it continues to fight even though it is nothing but bones. It is feared by other Digimon because it has no intelligence and fights indiscriminately."},{"name": "Gigadramon","profile": "A dark dragon Digimon developed at the same time as Megadramon. As a combat dragon that was armed to the teeth by further remodeling, its existence is the epitome of a fiendish computer virus."},{"name": "Omegamon X antibody","profile": "A Holy Knight Digimon born through the fusion of miracles by the will of the good ones. Well-rounded in combat, it effortlessly wields weapons that themselves have the strength of two Digimon."},{"name": "Zeedmillenniumon","profile": "Flying freely between space and time, it is a king of evil that is still trying to destroy all eras and worlds."},{"name": "Beelzebumon X antibody","profile": "The wonders of its magic bullets have intensified through X-Evolution!"},{"name": "Blastmon","profile": "A Mineral Digimon with a super hard and heavy body. Its strength lies in attacks that use its body. Even if its crystal armor breaks, it can regenerate. It loves eating gems."},{"name": "Jumbogamemon","profile": "A gigantic Cyborg Digimon that added beam cannons to its entire body until the strength of its Metal Body’s shell was compromised."},{"name": "Petaldramon","profile": "Petaldramon is Arbormon’s main battle form, when he needs to deal immense damage as opposed to the versatility and maneuverability of his Arbormon form. He has complete control over his form as opposed to others who need to control their instincts first"},{"name": "Shakkoumon","profile": "A Digimon who jogress-evolved from Armagemon and Angemon. It is believed that it might be an ancient Angel Digimon. Its neck and torso can rotate 360 degrees and allow it to attack in all directions."},{"name": "Leviamon","profile": "One of the Seven Great Demon Lords sleeping in the abyss of the Digital World. It has a huge body and is called the Devil Beast due to its very large jaw."},{"name": "Shurimon","profile": "A Mutant Digimon which blends in with nature and attacks the enemy from their blind spot like a ninja. It can extend its legs and arms like a spring."},{"name": "Heraklekabuterimon","profile": "An insect Digimon with a shining golden body. It has the features of both Kabuterimon and Kuwagamon. Its weapons are its huge horns and scissors, and it can fly at supersonic speed."},{"name": "Ogudomon","profile": "Ogudomon is a grotesque Super Demon Lord who has seven legs and eyes, as well as an eighth eye. It includes the whole of the Digital World’s sins, and moreover, is a mysterious personification with the ability to atone for them all."},{"name": "Susanoomon","profile": "A god from Eastern folklore. It is the strongest destruction god and is said to descend to the network system only in extraordinary situations. One part of it is responsible for regeneration and creates a new system after everything has been destroyed."},{"name": "Ancientgarurumon","profile": "One of the legendary Ten Warriors. It has the attribute of ’Light’ and saved the ancient Digital World. It was one of the first Ultimate forms to exist in the distant past. It was called ’the Brilliant Supreme Beast’."},{"name": "Ancientwisemon","profile": "Possessing the attribute of ’Steel’, it is one of the legendary Ten Warriors Digimon that saved the ancient Digital World. An Ultimate who existed only in the distant past, it is the wisest person in the Digital World."},{"name": "Ancienttroiamon","profile": "One of the legendary Ten Warriors. It has the attribute of ’Wood’ and saved the ancient Digital World. It was one of the first Ultimate forms to exist in the distant past. It boasts the largest size among the Ancient Digimon."},{"name": "Lucemon Satanmode","profile": "The final form of Lucemon in the shape of the dragon that appears in the Revelation. It wears the crown of the seven deadly sins and holds Gehenna, which absorbs all attacks. The real Digimon is inside Gehenna."},{"name": "Baalmon","profile": "An enlightened Digimon called ’The Noble King’. It encompasses all knowledge. The charms attached to its mantle contain the solutions to all possible problems. It serves as general of the Bagra army."},{"name": "Deathmon","profile": "A Digimon who was originally a high-level Angel Digimon. It fell to the Dark Area and is now one of the Demon Lords."},{"name": "Vritramon","profile": "A Digimon that possesses power over Flame which bears the might of one of the legendary Ten Warriors. It has skin that can withstand high temperatures and the ability to move even through lava."},{"name": "Sinduramon","profile": "One of the ’Deva Digimon’, it is a Perfect Digimon with a form resembling the Rooster. As a follower of the Four Holy Beasts Digimon Baihumon, it likes to quarrel and gossip above all else."},{"name": "EXP Floppy Ultimate","profile": "Use it in Digifuse as a Material Digimon to upgrade your Base digimon to the maximum level."},{"name": "Dukemon: Crimsonmode","profile": "A Digimon covered in crimson armor. It was born when Dukemon released all its hidden power. It has wings produced by overflowing energy. It holds the divine lance ’Gungnir’ and the divine sword ’Blutgang’."},{"name": "Knightmon","profile": "A loyal Digimon wearing armor made of Chrome Digizoid. It always disregards its own will and obeys the orders of its master. Depending on those orders, it can become either good or evil."},{"name": "Kumbhiramon","profile": "One of the ’Deva Digimon’, it is a Perfect Digimon with a form resembling the Rat"},{"name": "Vajramon","profile": "A Digimon who seeks to find the truth about the physical and spiritual worlds. It is under the command of Xuanwumon, one of the Four Holy Beasts."},{"name": "Vikaralamon","profile": "One of the ’Deva Digimon’, this one is a Perfect form in the shape of a boar."},{"name": "Gokumon","profile": "A fugitive Digimon born from the data on a list of wanted criminals."},{"name": "Jyureimon","profile": "A Digimon that is extremely intelligent and powerful. It is the higher evolution of Woodmon."},{"name": "X-Antibody","profile": "The X-Antibody is a vaccine that makes Digimon immune to Program X."},{"name": "Dorugamon","profile": "A ferocious Beast Dragon Digimon that possesses the disposition of a beast and a dragon, it is such a heavyweight that most Digimon run away just at the sight of its shadow."},{"name": "Doruguremon","profile": "A massive Beast Dragon Digimon whose form was released through the Interface on its brow by the potent life-force data of the legendary beast, the ’Dragon’, which slept within the deepest parts of its Digicore, and that holds the alias of ’Final Enemy’"},{"name": "Death-X-Dorugoramon","profile": "The undead version of Dorugoramon, it was created by Yggdrasil from Dorugamon’s data."},{"name": "Flamon","profile": "A Digimon that was transformed into a half-beast, half-man form when Agnimon lost its power."},{"name": "Agnimon","profile": "A Digimon that possesses power over Flame. Because its Digicore is wrapped in the Spiritual Fire which is called a holy blaze, it is able to freely manipulate flames."},{"name": "Imperialdramon DM","profile": "An ancient and incredibly powerful dragon Digimon. Besides its dragon form, it also has another form that can employ its full power. However, because this force is so big, it is difficult to control."},{"name": "Plotmon","profile": "A lop-eared, holy-type child Digimon. It is still a child, so it cannot employ its holy powers yet. It has yet to realize what its mission is."},{"name": "Pegasmon","profile": "A Digimon covered in golden armor. It armor-evolved from Patamon with the Digimental of Hope. It flies freely in the sky and holds absolute power, using its holy power against evil."},{"name": "Blackrapidmon","profile": "A Cyborg Digimon evolved from Blackgalgomon. It moves at close to the speed of light and controls a large ear-type radar. It always captures its prey, even in the darkness."},{"name": "Blacksaintgalgomon","profile": "A type of Saintgalgomon specialising in attacking enemy territory, it is equipped with massive amounts of armaments. Although it lacks speed, it is able to utilise the heat-based weapons located all over its body to counterattack in all directions without moving an inch."},{"name": "Dukemon X antibody","profile": "A Digimon born from Megidramon. Its name is also linked to the Royal Knights. Its weapons, Gram and Aegis, form from its armor, which is made completely of Chrome Digizoid."},{"name": "Miragegaogamon","profile": "A Beast Knight Digimon with its whole body covered in Chrome Digizoid armor. It moves at such incredible speed that it tricks its enemies into believing it is just a mirage. It can also cut it enemies instantly using Gale Claws."},{"name": "Blackmegalogrowmon","profile": "A Digimon that exemplifies the destructive nature of viruses, it is called the Black Destroyer Dragon. Its upper body is covered in Chrome Digizoid. Able to fly, it has outstandingly high attack and defense skills."},{"name": "Catchmamemon","profile": "A Digimon born from the data of a Japanese prize machine."},{"name": "Agumon","profile": "A cheerful Digimon who uses its hard claws as weapons. Hidden in its small body lies boundless courage, a fearless personality, and an uncharted potential for growth."},{"name": "Greymon","profile": "A Digimon with a strong body and a hard, fine horn that boasts high combat power. Its head is covered with a hard shell that increases its defensive ability. It is also skilled at cooperating with its friends in combat."},{"name": "Opossummon","profile": "A lovely Digimon who prefers sandy dry lands. It holds some balloons that contain a strong virus. It is hard to capture since it holds its balloons and jumps from place to place."},{"name": "Beelzebumon","profile": "An aloof Digimon with a powerful spirit. It has two double-barreled shotguns, the Berenjena. It is feared as one of the Seven Great Demon Lords and looks for battles with strong Digimon."},{"name": "Rosemon X antibody","profile": "A beautiful female Digimon called the queen of flowers. On its breast it wears a Tiferet, a jewel in which is engraved the symbol of love and beauty. This jewel promises eternal beauty."},{"name": "Algomon","profile": "A Digimon that was generated from a bug in an algorithm. Due to its high-speed processing ability, it uses its countless ivy tendrils as tentacles, and takes complete control of a vast field."},{"name": "Atlurkabuterimon Blue","profile": "An evolution of Kabuterimon that was discovered within the tropical region of the Net Area. It is almost 1.5 times Kabuterimon’s size, and is quite large among Insect Digimon."},{"name": "Cannonbeemon","profile": "A massive Digimon that can completely cover a vast range with a bombarding barrage fired simultaneously from the gigantic arms container on top of it."},{"name": "Frogmon","profile": "An Armor-level Mutant Digimon that evolved through the power of the Digimental of Purity"},{"name": "Dokugumon","profile": "Dokugumon are Insectoid Digimon who are said to have computer viruses running through their bodies. They are ruled over by their queen, Archnemon."},{"name": "Picklemon","profile": "A Fairy Digimon mastering magic. It can recite a sophisticated programming language from another dimension to produce miracles similar to magic."},{"name": "Deathmeramon","profile": "A Digimon that overcame water and ice, the weak points of the Meramon species. A blue burning chain winds around its body. Its skilled attacks, defensive abilities, and burning temperature are all enhanced."},{"name": "Allomon","profile": "An Armor-level Dinosaur Digimon that has a fierce rivalry with its fellow Dinosaur Digimon, Tyranomon"},{"name": "Giromon","profile": "A Digimon patrolling the computer network, he fights off illegal intruders. Called the Net Keeper, he attacks any invading enemy with all his forces."},{"name": "Warumonzaemon","profile": "A Digimon that looks like Monzaemon. However, its atrocity makes it completely different. Its left arm is equipped with ’Bear Claw’. It gets along well with Metaletemon, to whom it offered a stuffed Warumonzaemon as a present."},{"name": "Ancientmegatheriumon","profile": "One of the legendary Ten Warriors Digimon that saved the ancient Digital World. It is said that the power and bravery it possesses can adapt even to the intense cold of the freezing tundra."},{"name": "Stingmon","profile": "A very rare Insect Digimon that has the appearance of a human. It also has a hard exterior frame and the very swift moves of an insect."},{"name": "Barbamon","profile": "A Digimon living in the center of the Dark Area, he is one of Seven Great Demon Lords, the supervisors of the fallen angels. Obsessed with all the treasures in the network, he can employ any methods when it comes to materialistic issues."},{"name": "Wargreymon Vs Mugendramon","profile": "Dramon Killers versus the Ultimate Cyborg. Can the brave warrior defeat the Dark Master?"},{"name": "Nefertimon","profile": "A Digimon who armor-evolved from Tailmon using the Digimental of Light. It has the attribute of light and can gracefully fly in the sky. It can purify the corruption of the darkness using the power of intense light."},{"name": "Nefertimon X antibody","profile": "A Digimon who armor-evolved from Tailmon using the Digimental of Light. It has the attribute of light and can gracefully fly in the sky. It can purify the corruption of the darkness using the power of intense light."},{"name": "Omegamon X antibody","profile": "A Holy Knight Digimon born through the fusion of miracles by the will of the good ones. Well-rounded in combat, it effortlessly wields weapons that themselves have the strength of two Digimon."},{"name": "Magnamon","profile": "A Digimon who armor-evolved through the Digimental of Miracles. Dressed in Chrome Digizoid armor, its power is comparable to that of an ultimate form. In times of crisis, it can escape using the power of miracles."},{"name": "Chaosmon","profile": "Typically, during a jogress evolution, the digicores of the two Digimon completely fuse, giving birth to a new Digimon. Chaosmon keeps the two digicores as they were before the jogress and maintains its form in an extremely incomplete state."},{"name": "Duftmon: Leopardmode","profile": "The form Duftmon takes on the battlefield. It runs and flies through the world and strategically chooses its moves according to the conditions it faces in battle."},{"name": "Griffomon","profile": "A Synthetic Digimon with a Beast’s torso and a Bird’s head, wings, and legs. There is something like a snake attached to his tail."},{"name": "Omegamon Alter-S","profile": "A new face of Omegamon that was born from the fusion of Blitzgreymon and Cresgarurumon. Although it is a different individual from the Omegamon belonging to the Royal Knights, its multitype performance, which combines the special qualities of the two, hasn’t changed, and its strength is also on par with it."},{"name": "Miragegaogamon Burstmode","profile": "A Miragegaogamon that has temporarily reached the limits of its abilities through Burst Evolution, it is a unique form which wears a weapon and an aura of planetary-class high-energy."},{"name": "Apollomon & Dianamon","profile": "Two members of the Olympos XII, theirs is a story of Fire and Ice. Blood, boiling from the power of the sun, combines with the ice-cold beauty of the moon. United, their power could be immeasurable."},{"name": "Tylomon","profile": "An Armor-level Sea Dragon Digimon that holds the alias of ’Jet Plane of the Deep’ and has a fast moving speed underwater. It even contends for first place with Metal Seadramon."},{"name": "Tylomon X antibody","profile": "An Armor-level Sea Dragon Digimon that holds the alias of ’Jet Plane of the Deep’ and has a fast moving speed underwater. It even contends for first place with Metal Seadramon."},{"name": "Duftmon X antibody","profile": "A Digimon regarded by the Royal Knights as one of the best strategists. It has the skill to lead the Royal Knights. When it gets to the battlefield itself, it changes to Leopardmode."},{"name": "Ornismon","profile": "An Ancient Bird Digimon said to be extinct since ancient times. Called ’the Ruler of the Skies’, it attacks much larger Digimon from above."},{"name": "Ranamon","profile": "A Digimon that used to be primarily active in the oceanic part of the weather forecast system, which might account for its sharp intuition and oft-changing emotions."},{"name": "Goddramon X antibody","profile": "A Holy dragon Digimon with a shining, golden body. It is one of the Four Great Dragons. It is small and wears in its right hand Umon the Blue Thunder, a weapon of regeneration, and in its left hand Amon the Red Flame, a weapon of destruction."},{"name": "Limit Break Metamorpher","profile": "The Metamorpher can replace a missing copy of a Digimon when limit breaking."},{"name": "Metamorpher Shard","profile": "Six Metamorpher Shards can Digivolve into a Limit Break Metamorpher."},{"name": "Vademon X antibody","profile": "An Alien Digimon that looks like it has come from the farthest reaches of the universe. However, there are rumors that it was born from a plant’s fruit."},{"name": "Omegamon Zwart D","profile": "A form of Omegamon Zwart that was injected with a virus program by someone and turned into a beserker. The rampant virus program and lingering vaccine program within its body clashed with each other, causing it to become unstable, and its wounded body continues to rampage and tire without ever recovering."},{"name": "Metaltyranomon X antibody","profile": "A Cyborg Digimon who modified its body in order to become stronger. Just as Megadramon has superior aerial combat skills, Metaltyranomon has superior terrestrial combat skills."},{"name": "Growmon","profile": "A wild and ferocious Digimon. It is called ’the Deep Crimson Demon Dragon’. Its roar has the power to shake the ones who hear it, and its mouth spits burning flames. Depending on the tamer’s level of training, it can also fight in the name of justice."},{"name": "Megalogrowmon","profile": "A huge Cyborg Digimon whose upper body is covered in Chrome Digizoid. It can also fly using the verniers on its shoulders, making it immensely powerful in both terrestrial and aerial combat."},{"name": "Megalogrowmon X antibody","profile": "A huge Cyborg Digimon whose upper body is covered in Chrome Digizoid. It can also fly using the verniers on its shoulders, making it immensely powerful in both terrestrial and aerial combat."},{"name": "Alphamon: Ouryuken vs Death-X-Mon","profile": "The Holy Knight Alphamon wields the ultimate weapon Ouryumon against the ultimate threat, Death-X-Mon."},{"name": "Mihiramon","profile": "A Digimon that fiercely hunts down all its enemies. When on land, it runs faster than the wind, and when it takes to the air using its dual wings, it can break the speed of sound."},{"name": "Cerberumon","profile": "A Demon Beast Digimon called ’the Watchdog of Hell’. The claws on its four limbs are hard enough to be able to tear through a low-grade Chrome Digizoid alloy."},{"name": "Cerberumon X antibody","profile": "A Demon Beast Digimon called ’the Watchdog of Hell’. The claws on its four limbs are hard enough to be able to tear through a low-grade Chrome Digizoid alloy."},{"name": "Gizamon","profile": "An Aquatic Mammal Digimon that grew fins on its hands and feet in order to paddle through water. It is more suited for life in the water than on land."},{"name": "Mantaraymon x antibody","profile": "A Digimon who appears quick and aggressive but is actually quite the opposite. It swims gracefully in the seas of the Internet and has a gentle personality."},{"name": "Agnimon","profile": "A Digimon that possesses power over Flame. Because its Digicore is wrapped in the Spiritual Fire which is called a holy blaze, it is able to freely manipulate flames."},{"name": "Chaosdramon","profile": "A Digimon born from a successful experiment where Mugendramon, a combination of parts from numerous Cyborg Digimon, uses its abilities beyond the limits."},{"name": "Slayerdramon","profile": "A Dragon Man Digimon with its body covered in Chrome Digizoid scale armor."},{"name": "Mamemon","profile": "A Mutant Digimon that evolved in a harsh environment. Contrary to its cute appearance, it conceals a terrifying destructive power."},{"name": "Princemamemon","profile": "Having taken in data on the Net concerning a royal family, it is a prince of the Mamemon world. Partnering with King Etemon, it plays the part of a mock royal family of the Digital World, and that’s why it looks so gorgeous."},{"name": "Princemamemon X antibody","profile": "Having taken in data on the Net concerning a royal family, it is a prince of the Mamemon world. Partnering with King Etemon, it plays the part of a mock royal family of the Digital World, and that’s why it looks so gorgeous."},{"name": "Ancientsphinkmon","profile": "One of the legendary Ten Warriors who saved the ancient Digital World. It possesses the attribute of darkness."},{"name": "Triceramon","profile": "A bipedal Ceratopsian Digimon which has the appearance of the Triceratops, which has offensive ability competing for first or second among herbivorous dinosaurs. The sturdiness of its skin is top class among biological Digimon"},{"name": "Banchogolemon","profile": "It is said that only Digimon who continue to emerge victorious in battles with fierce champions, without their spirit being broken, are able to acquire the title of Bancho. This Golemon is one of those warriors."},{"name": "Banchomamemon","profile": "It is said that only Digimon who continue to emerge victorious in battles with fierce champions, without their spirit being broken, are able to acquire the title of Bancho. This Mamemon is one of those warriors."},{"name": "Banchostingmon","profile": "It is said that only Digimon who continue to emerge victorious in battles with fierce champions, without their spirit being broken, are able to acquire the title of Bancho. This Stingmon is one of those warriors."},{"name": "Bancholilimon","profile": "A crimson tokko-fuku wearing fairy-type Digimon. The gorgeous petals it had in the days it was a Lilimon have been dyed a dark color, and the pretty impression it made is long gone. It believes in fighting for the underdog, having saved a lot of those who were attacked by evil Digimon."},{"name": "Chaosdramon X antibody","profile": "A Digimon born from a successful experiment where Mugendramon, a combination of parts from numerous Cyborg Digimon, uses its abilities beyond the limits."},{"name": "Metalseadramon","profile": "A Digimon fully covered in Chrome Digizoid alloy. It is the final form of the Seadramon species. It was adapted for use in interception and repels most attacks with its body."},{"name": "Pinochimon","profile": "A Puppet Digimon born from the cursed Jyureimon data. It is like a marionette but can also move by itself. It loves saying all kinds of lies."},{"name": "Picklemon","profile": "A Fairy Digimon mastering magic. It can recite a sophisticated programming language from another dimension to produce miracles similar to magic."},{"name": "Rhinomon X antibody","profile": "An Armor-level Mammal Digimon that evolved through the power of the ’Digimental of Miracles’. It is clad in armor made of Chrome Digizoid, and this armor cannot be destroyed even by laser-based attacks let alone physical attacks."},{"name": "Fladramon","profile": "A Digimon who armor-evolved from V-mon through the Digimental of Courage. Its combat skills are similar to a burning flame, and it hits its enemies with extremely strong knuckles."},{"name": "Pteranomon","profile": "An Armor-level Pterosaur Digimon with wings of steel that evolved through the power of the Digimental of Love."},{"name": "Quetzalmon","profile": "A bewitching armor-form Beast that evolved through the Digimental of Light. It is the embodiment of the sun and wind in the shape of a winged white snake."},{"name": "Maildramon","profile": "An Armor-level Cyborg Digimon that evolved through the power of the ’Digimental of Miracles’. This dragon, possessing armor made of Chrome Digizoid, is the attendant of Knightmon, and rushes about the battlefield carrying Knightmon on its back."},{"name": "Lighdramon","profile": "A Digimon who armor-evolved from V-mon using the Digimental of Friendship. It possesses the attribute of thunder and attacks its enemies with a lightning-quick electric shock."},{"name": "Salamandamon","profile": "An Amphibian Digimon that Armor-evolved with the Digimental of Courage. With its flame-clad, salamander-like appearance, it appears to be carefree, but once it’s angered, it flares up the flames of its body even more and attacks."},{"name": "Togemogumon","profile": "An Armor-level Mammal Digimon that evolved through the power of the Digimental of Friendship. It grows ultra-low temperature ice crystals on its back like a pincushion."},{"name": "Honeybeemon","profile": "An Armor-level Insect Digimon that evolved through the power of the Digimental of Knowledge. It moves very quickly due to its tiny body, and its speciality is making sport of the enemy."},{"name": "Goatmon","profile": "An Armor-level Mammal Digimon that evolved through the power of the Digimental of Hope. This Digimon, which has the appearance of a large black goat, has had the duty of guarding treasures and ruins since ancient times."},{"name": "Shadramon","profile": "An Armor-level Insect Digimon that evolved through the power of the Digimental of Courage. To be precise, it took the form of an insect-humanoid, but its form had an unfortunate adverse reaction to the Digimental of Courage and became fiendish."},{"name": "Peacockmon","profile": "An Armor-level Machine Digimon that evolved through the power of the Digimental of Miracles. When certain Bird Digimon perform normal evolution, they have the potential to become Delumon, but there are cases where they will rarely evolve into Peacockmon by using the Digimental of Miracles."},{"name": "Digmon","profile": "A Digimon that Armor-evolved from Armadimon through the Digimental of Knowledge. It has the attribute of earth. Skilled in the use of the drills on its nose and arms, it specializes in underground combat."},{"name": "Holsmon","profile": "A Digimon born when Hawkmon armor-evolved through the Digimental of Love. It has the attribute of wind, being able to flap his wings and dance in the sky like the wind. Its specialty is air battles."},{"name": "Sethmon","profile": "A Demon Beast Digimon who armor-evolved through the Digimental of Love. The Digimental of Love’s power was too great and uncontrollable, and its power was converted into the power of hatred."},{"name": "Boarmon","profile": "An Armor-level Mammal Digimon that evolved through the power of the Digimental of Courage. Reckless; it is a Digimon that exists solely to embody this word, and its legs, tail and mane are shrouded in blazing flames."},{"name": "Elephamon","profile": "An Armor-level Cyborg Digimon that evolved through the power of the Digimental of Miracles. It is a Super Digimon that overwhelms other Digimon with its large build and extreme power, and that is able to move at high speeds, contrary to its appearance, due to the gigantic turbines on both of its ears."},{"name": "Ponchomon","profile": "An Armor-level Ghost Digimon that evolved through the power of the Digimental of Purity. Although it is classified as a Ghost-type, it is an unusual Digimon that appears to be a Plant-type, as far as you can tell from its appearance, and it is rumored that when a Togemon has died due to unforeseen circumstances, it will become a Ponchomon."},{"name": "Rune of Hope","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Kindness","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Light","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Destiny","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Miracles","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Knowledge","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Sincerity","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Love","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Friendship","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Courage","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Hope","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Kindness","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Light","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Destiny","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Miracles","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Knowledge","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Sincerity","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Love","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Friendship","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Courage","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Hope","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Kindness","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Light","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Destiny","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Miracles","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Knowledge","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Sincerity","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Love","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Friendship","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Courage","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Hope","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Kindness","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Light","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Destiny","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Miracles","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Knowledge","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Sincerity","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Love","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Friendship","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Courage","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Hope","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Kindness","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Light","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Destiny","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Miracles","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Knowledge","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Sincerity","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Love","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Friendship","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."},{"name": "Rune of Courage","profile": "Equip this rune to a Digimon in order to increase its stats. Once equipped, the rune cannot be upgraded."}]}