{"records":[{"name": "Agumon","profile": "A cheerful Digimon who uses its hard claws as weapons. Hidden in its small body lies boundless courage, a fearless personality, and an uncharted potential for growth."},{"name": "Gabumon","profile": "A Digimon that wears Garurumon’s fur and is normally very shy. However, wearing the fur inverts its personality and makes it bold. Its weapons are its stiff horn and the sharp claws attached to the fur."},{"name": "Greymon","profile": "A Digimon with a strong body and a hard, fine horn that boasts high combat power. Its head is covered with a hard shell that increases its defensive ability. It is also skilled at cooperating with its friends in combat."},{"name": "Monochromon","profile": "A Digimon whose shell and horns are hard as diamond. They say when its horns are completely grown, they will reach half the size of its body. It is an herbivorous and calm Digimon, but when it gets angry it goes on a rampage."},{"name": "Centalmon","profile": "A Digimon with the upper body of a human and the lower body of an animal. Each part of its body is covered in blue armor. It releases compressed gas through the pipe on its back to help it reach close to the speed of sound."},{"name": "Leomon","profile": "A Digimon praised as a noble hero. It is a warrior with a just heart who has defeated many atrocious Digimon. Its rival is Orgemon. On its waist, it carries a magical sword called ’Shishiou-maru’."},{"name": "Garurumon","profile": "A Digimon covered with fur as hard as mithril. It is feared by other Digimon because it hunts its prey with a carnivore’s speed and very precise attacks."},{"name": "Unimon","profile": "A synthetic Digimon with a unicorn’s horn and a pegasus’ wings. Its wings help it fly freely within the network, and its sharp horn helps it fight its enemies. It has a very wild temper."},{"name": "Pandamon","profile": "A Digimon that looks like a panda but is not very popular because of its bluntness. It pretends to be a maverick, but it secretly yearns to be like the popular Monzaemon. Surprisingly, it is actually very capable."},{"name": "Weregarurumon","profile": "A commando-type Digimon that has the leg strength of Garurumon and skilled war tactics. Its jumping abilities are top tier. It has a strong sense of duty and serves its master and partners faithfully."},{"name": "Mammon","profile": "An ancient Digimon, discovered in the melted ice and snow due to the Digital World warming. On its mask there is a crystal of knowledge which gives it the power of clairvoyance and allows it to see far into the future."},{"name": "Metalgreymon","profile": "A Digimon with over half of its body mechanized. It is said to have the power of a nuclear warhead. Only a Greymon who has won numerous battles can evolve to this stage."},{"name": "Skullgreymon","profile": "A menacing Digimon obsessed with fighting. Thanks to its battle instincts, it continues to fight even though it is nothing but bones. It is feared by other Digimon because it has no intelligence and fights indiscriminately."},{"name": "Saberleomon","profile": "An ancient Digimon that is said to be the ancestor of Leomon. It is a huge beast with overwhelmingly destructive claws, strong penetrative tusks, and legs that allow it to run at Mach speed."},{"name": "Baalmon","profile": "An enlightened Digimon called ’The Noble King’. It encompasses all knowledge. The charms attached to its mantle contain the solutions to all possible problems. It serves as general of the Bagra army."},{"name": "Metalgarurumon","profile": "A Digimon whose whole body is mechanized. It is the final form of Garurumon. It retains Garurumon’s speed despite the many heavy firearms attached to its body. It finds its enemies with the laser on the tip of its nose and swiftly shoots them down."},{"name": "Wargreymon","profile": "A Digimon equipped with Dramon Killers on both its arms and the Brave Shield on its back. It is a veteran hero wearing armor made of Chrome Digizoid. It has a humanoid shape and is remarkably powerful and fast."},{"name": "Hagurumon","profile": "A mutant Digimon made of a combination of gears. Removing even one gear is enough to make it stop working. It has the deadly skill of manipulating other Digimon, which it uses in mischievous ways."},{"name": "Kokuwamon","profile": "A mini insect machine Digimon. It has electricity stored in its body and can use this to even run domestic appliances. In crisis situations, it can release a current of 1 MV to protect its body."},{"name": "Revolmon","profile": "A Digimon with a strong sense of justice. It belongs to the Virus Busters and deletes evil Digimon. However, since it likes gambling, it pardons evil Digimon who win the Russian roulette."},{"name": "Tankmon","profile": "A Digimon that enjoys fighting so much its nickname is ’the Mercenary Digimon’. Heavy artillery is installed all throughout its body, which it likes using to shatter its enemies to pieces."},{"name": "Guardromon","profile": "A Digimon with outstanding defense. Originally it was guarding the network with Giromon the net-keeper, but it got infected by a virus and was used by evil Digimon."},{"name": "Knightmon","profile": "A loyal Digimon wearing armor made of Chrome Digizoid. It always disregards its own will and obeys the orders of its master. Depending on those orders, it can become either good or evil."},{"name": "Andromon","profile": "A cyborg Digimon created in an experiment. It has high combat power and strictly follows the orders it receives regardless of their good or evil nature."},{"name": "Mugendramon","profile": "A completely metal Digimon that was created by combining the parts of many cyborg Digimon. An evil program is written in its digicore and supplies it with infinite malice."},{"name": "Tentomon","profile": "A Digimon with a hard shell but an otherwise very peaceful personality. It is very easygoing and likes smelling the aroma of flowers and taking the occasional nap. It uses its claws deftly and can grab things like a human."},{"name": "Palmon","profile": "A rare type of Digimon that became a plant even though it started evolving like a reptile. A tropical plant blooms on its head and changes scents according to its mood. It buries its feet into the ground in order to absorb nutrients."},{"name": "Gomamon","profile": "A naughty Digimon that likes pranks. His body is covered with fur so that he can resist to cold temperatures. His claws help him break hard blocks of ice. When he gets angry, the red hair on his head bristles."},{"name": "Piyomon","profile": "A Digimon with wings that help it hold things but are unsuitable for flying. It can only fly at the same speed as Patamon. It aspires to someday become Birdramon, who can fly freely in the sky."},{"name": "Kuwagamon","profile": "A Digimon of the same maturity as Kabuterimon, its eternal rival. It has well-developed battle instincts. It attacks its prey immediately and grasps it in its scissors."},{"name": "Kabuterimon","profile": "A powerful insect Digimon with a hard shell. It boasts high defense due to its metallized head. It has no mercy when it attacks its rival Digimon."},{"name": "Birdramon","profile": "A Digimon dressed in a blazing flame and born of a firewall. It flies freely within the network. Its specialty is air attacks."},{"name": "Togemon","profile": "A plant Digimon that is easygoing and often absent-minded. However, when somebody upsets it, it angrily brings out its thorn-covered fists."},{"name": "Airdramon","profile": "An intelligent Digimon that flies freely in the sky. They say that its existence is close to the gods, especially when it calls up storms with its cry. Its fierce personality makes it difficult for ordinary tamers to use."},{"name": "Atlurkabuterimon","profile": "A Digimon discovered in the net area of the tropics. It is an evolved form of Kabuterimon. Its body is about 1.5 times that of Kabuterimon. Its fighting skills have improved thanks to the muscles it developed, but its flying skills dropped."},{"name": "Oukuwamon","profile": "An aggressive Digimon evolved from Kuwagamon. Its scissors have grown even stronger, and its scouting skills have improved due to an enhanced sense of touch. Its defensive abilities, which were not very developed in Kuwagamon, improved as well."},{"name": "Garudamon","profile": "A Digimon that loves justice and nature. It is the guardian god of earth and wind. Only bird Digimon with high intelligence and fighting ability can evolve into Garudamon. It is a close friend of Leomon, who shares its vision."},{"name": "Megaseadramon","profile": "A Digimon with an enlarged head, hard armor, and a blade in the shape of a lightning bolt. It also has a high level of intelligence and a very cautious personality, following its enemies until it brings them down."},{"name": "Heraklekabuterimon","profile": "An insect Digimon with a shining golden body. It has the features of both Kabuterimon and Kuwagamon. Its weapons are its huge horns and scissors, and it can fly at supersonic speed."},{"name": "Grankuwagamon","profile": "A dreadful Digimon called the devil of the deep forest. It is the final form of the Kuwagamon species. It lives in the depths of the forests and is fully nocturnal. Its eternal rival is Heraklekabuterimon."},{"name": "Metalseadramon","profile": "A Digimon fully covered in Chrome Digizoid alloy. It is the final form of the Seadramon species. It was adapted for use in interception and repels most attacks with its body."},{"name": "Rosemon","profile": "A beautiful female Digimon called the queen of flowers. On its breast it wears a Tiferet, a jewel in which is engraved the symbol of love and beauty. This jewel promises eternal beauty."},{"name": "Impmon","profile": "A Digimon that likes pranks and often plays them on electrical products. While it is cruel to its weak opponents, it also stubbornly faces enemies stronger than itself, rather than trying to curry favor with them. Ultimately, this Digimon is quite lonely."},{"name": "Keramon","profile": "A child Digimon that thinks destroying data is just a game. It destroys the computers it penetrates, eating away data at a rate of 100MB per second."},{"name": "Candmon","profile": "A Digimon with a burning digicore. It cannot survive if its digicore flame dies. For this reason, it is said that its true form is the flame. Although it is a flame-type, it has a calm personality."},{"name": "Picodevimon","profile": "A cunning Digimon that is said to have drawn Devimon to the dark side. It is used by its superiors, Devimon and Vamdemon, and does evil deeds for them."},{"name": "Wizarmon","profile": "A Digimon that came from Witchelny, a digital world in another dimension, in order to train. It is mastering the magic of earth and fire. It is very shy and doesn’t like to show its face."},{"name": "Devimon","profile": "A fallen angel Digimon. It originally belonged to the angel Digimon but fell to the dark side. It wears the symbol of evil engraved on its chest. It can control other Digimon using its evil intellect and fierce eyes."},{"name": "Bakemon","profile": "A ghost Digimon born from the dark area. It is made of a virus program that possesses computers and destroys them. It is said that inside its cloth there is a black hole."},{"name": "Orgemon","profile": "A Digimon hunter with a developed physique and high intelligence. Driven by its rage, it challenges strong Digimon to fight. It is not ashamed of its nickname and holds a bone club as proof that it has defeated Skullgreymon."},{"name": "Meramon","profile": "A Digimon whose whole body is shrouded in flames and was born from the firewall that protects the Internet. It has a violent temper, just like the flames that cover its body, and wants to burn everything."},{"name": "Madleomon","profile": "A frenzy Digimon who lost its own will. It is the result of extensive upgrading in order to obtain power. It relies on its physical strength and poisonous claws as it follows the orders it receives."},{"name": "Bluemeramon","profile": "A flame-type Digimon covered in blue flame. It burns at a higher temperature than Meramon. It has a rough personality and is hard to tame."},{"name": "Deathmeramon","profile": "A Digimon that overcame water and ice, the weak points of the Meramon species. A blue burning chain winds around its body. Its skilled attacks, defensive abilities, and burning temperature are all enhanced."},{"name": "Fantomon","profile": "A senior ghost Digimon which has the appearance of the god of death. It searches for its prey using the clairvoyant crystal hanging at its neck. It is said that the interior of the cloth covering its body leads to another dimension."},{"name": "Infermon","profile": "An atrocious Digimon capable of invading any network and destroying its data. Its defense is remarkably improved thanks to the limbs attached to its cocoon body."},{"name": "Ladydevimon","profile": "A female fallen angel Digimon that holds dark power of incomparable purity. It is impossible to control it using personal computers. Its enemy is Angewomon."},{"name": "Vamdemon","profile": "The king of the Undead Digimon. It was resurrected using dark magic. It is skilled at transforming broken data into evil computer viruses. Its powers are only half as strong during the daytime."},{"name": "Demon","profile": "One of the Seven Great Demon Lords. It was a high-ranking Angel Digimon, but it was exiled to the darkness after it rebelled against the good world. Now it is planning revenge against the Digital World."},{"name": "Lilithmon","profile": "A Digimon that was originally a high-ranking Angel Digimon. It fell to the dark side and is now called ’The Goddess of Darkness’. It is one of the Seven Great Demon Lords. Anything touched by the nails of its left hand will corrode."},{"name": "Piemon","profile": "A Digimon shrouded in mystery. No one knows how or why it was born. It possesses a strong and elusive power, so if you meet it you’ll have no choice but to resign yourself to your final moments."},{"name": "Patamon","profile": "A Digimon that can fly in the sky due to its big ears. However, its speed is only 1 km/h, so it is faster if it walks. It doesn’t wear a Holy Ring, but the genes of ancient Digimon are hidden inside it."},{"name": "Tailmon","profile": "A Holy Digimon wearing a Holy Ring on its tail. It looks very sweet and innocent, but it has very sharp nails that are copied from Saberleomon’s data."},{"name": "Angemon","profile": "A Digimon whose job is maintaining Good in the Digital World and keeping out Evil. It has six divine wings that are said to bring happiness."},{"name": "Angewomon","profile": "A Digimon who has a calm personality but is very strict with twisted and evil individuals. It will punish them until they change. Thanks to its morals and power, it is praised as ’The Goddess’ of the Digital World."},{"name": "Holyangemon","profile": "A Digimon responsible for surveilling the world as an agent of light. Whenever darkness approaches, it changes to battle mode. It fights the darkness with its sacred sword Excalibur in its right hand and its Beam Shield in its left hand."},{"name": "Goddramon","profile": "A Holy dragon Digimon with a shining, golden body. It is one of the Four Great Dragons. It is small and wears in its right hand Umon the Blue Thunder, a weapon of regeneration, and in its left hand Amon the Red Flame, a weapon of destruction."},{"name": "Holydramon","profile": "A Digimon seated on the highest cliff of the god beast Digimon. It is the master of the skies and has the power to invade anything. It is one of the Four Great Dragons. Legends predict its advent when the evil forces become too strong."},{"name": "Hououmon","profile": "The head of the bird Digimon. It has four shiny golden wings. It wears two Holy Rings and is said to govern all the Holy Bird Digimon. Its power is immeasurable."}]}